MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 17:15:22 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../debug.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("flush")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("flush")
      15                    .dwattr $C$DW$1, DW_AT_declaration
      16                    .dwattr $C$DW$1, DW_AT_external

     375 00007c 0045  $C$FSL14:       .string "Error",0
         00007d 0072 
         00007e 0072 
         00007f 006F 
         000080 0072 
         000081 0000 
     376                    .align  2
     377 000082 000D  $C$FSL15:       .string 13,10,">",0
         000083 000A 
         000084 003E 
         000085 0000 
     378            ;*****************************************************************************
     379            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     380            ;*****************************************************************************
     381                    .global flush
     382                    .global get_enum
     383                    .global put_cstr
     384                    .global set_img_stat_flg
     385                    .global SerialRX
     386            
     387            ;******************************************************************************
     388            ;* BUILD ATTRIBUTES                                                           *
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   11

     389            ;******************************************************************************
     390                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     391                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
     392                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     393                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     394                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     395                    .battr "mspabi", Tag_File, 1, Tag_enum_size(2)
     396            
     397            ;******************************************************************************
     398            ;* TYPE INFORMATION                                                           *
     399            ;******************************************************************************
     400            
     401            $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
     402                    .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
     403            $C$DW$32        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_NONE"), DW_AT_const_value(0x00)
     404                    .dwattr $C$DW$32, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     405                    .dwattr $C$DW$32, DW_AT_decl_line(0x1c)
     406                    .dwattr $C$DW$32, DW_AT_decl_column(0x05)
     407            $C$DW$33        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_DOWNLOAD"), DW_AT_const_value(0x01)
     408                    .dwattr $C$DW$33, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     409                    .dwattr $C$DW$33, DW_AT_decl_line(0x1d)
     410                    .dwattr $C$DW$33, DW_AT_decl_column(0x05)
     411            $C$DW$34        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_PENDING_VALIDATION"), DW_AT_const_valu
     412                    .dwattr $C$DW$34, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     413                    .dwattr $C$DW$34, DW_AT_decl_line(0x1e)
     414                    .dwattr $C$DW$34, DW_AT_decl_column(0x05)
     415            $C$DW$35        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_VALIDATED"), DW_AT_const_value(0x03)
     416                    .dwattr $C$DW$35, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     417                    .dwattr $C$DW$35, DW_AT_decl_line(0x1f)
     418                    .dwattr $C$DW$35, DW_AT_decl_column(0x05)
     419            $C$DW$36        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_RECOVERED"), DW_AT_const_value(0x04)
     420                    .dwattr $C$DW$36, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     421                    .dwattr $C$DW$36, DW_AT_decl_line(0x20)
     422                    .dwattr $C$DW$36, DW_AT_decl_column(0x05)
     423            $C$DW$37        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_FLASHING_ERROR"), DW_AT_const_value(0x
     424                    .dwattr $C$DW$37, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     425                    .dwattr $C$DW$37, DW_AT_decl_line(0x21)
     426                    .dwattr $C$DW$37, DW_AT_decl_column(0x05)
     427                    .dwendtag $C$DW$T$67
     428            
     429                    .dwattr $C$DW$T$67, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     430                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x1b)
     431                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
     432            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("bl_image_status_t")
     433                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
     434                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     435                    .dwattr $C$DW$T$68, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     436                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x22)
     437                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
     438            
     439            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     440                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
     441            $C$DW$38        .dwtag  DW_TAG_member
     442                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$21)
     443                    .dwattr $C$DW$38, DW_AT_name("base_ptr")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   12

     444                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("base_ptr")
     445                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     447                    .dwattr $C$DW$38, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     448                    .dwattr $C$DW$38, DW_AT_decl_line(0x15)
     449                    .dwattr $C$DW$38, DW_AT_decl_column(0x14)
     450            $C$DW$39        .dwtag  DW_TAG_member
     451                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     452                    .dwattr $C$DW$39, DW_AT_name("start_ptr")
     453                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("start_ptr")
     454                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     455                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     456                    .dwattr $C$DW$39, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     457                    .dwattr $C$DW$39, DW_AT_decl_line(0x16)
     458                    .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
     459            $C$DW$40        .dwtag  DW_TAG_member
     460                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$23)
     461                    .dwattr $C$DW$40, DW_AT_name("max_len")
     462                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("max_len")
     463                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     464                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     465                    .dwattr $C$DW$40, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     466                    .dwattr $C$DW$40, DW_AT_decl_line(0x17)
     467                    .dwattr $C$DW$40, DW_AT_decl_column(0x18)
     468            $C$DW$41        .dwtag  DW_TAG_member
     469                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     470                    .dwattr $C$DW$41, DW_AT_name("len")
     471                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("len")
     472                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     473                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     474                    .dwattr $C$DW$41, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     475                    .dwattr $C$DW$41, DW_AT_decl_line(0x18)
     476                    .dwattr $C$DW$41, DW_AT_decl_column(0x12)
     477                    .dwendtag $C$DW$T$24
     478            
     479                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     480                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
     481                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     482            $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
     483                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
     484                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     485                    .dwattr $C$DW$T$69, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     486                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x19)
     487                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
     488            $C$DW$T$70      .dwtag  DW_TAG_pointer_type
     489                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
     490                    .dwattr $C$DW$T$70, DW_AT_address_class(0x14)
     491            
     492            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     493                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     494            $C$DW$42        .dwtag  DW_TAG_member
     495                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$10)
     496                    .dwattr $C$DW$42, DW_AT_name("quot")
     497                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("quot")
     498                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   13

     499                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     500                    .dwattr $C$DW$42, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     501                    .dwattr $C$DW$42, DW_AT_decl_line(0x46)
     502                    .dwattr $C$DW$42, DW_AT_decl_column(0x16)
     503            $C$DW$43        .dwtag  DW_TAG_member
     504                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$10)
     505                    .dwattr $C$DW$43, DW_AT_name("rem")
     506                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("rem")
     507                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     508                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     509                    .dwattr $C$DW$43, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     510                    .dwattr $C$DW$43, DW_AT_decl_line(0x46)
     511                    .dwattr $C$DW$43, DW_AT_decl_column(0x1c)
     512                    .dwendtag $C$DW$T$25
     513            
     514                    .dwattr $C$DW$T$25, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     515                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
     516                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     517            $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     518                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$25)
     519                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     520                    .dwattr $C$DW$T$71, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     521                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x46)
     522                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x23)
     523            
     524            $C$DW$T$26      .dwtag  DW_TAG_structure_type
     525                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     526            $C$DW$44        .dwtag  DW_TAG_member
     527                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$12)
     528                    .dwattr $C$DW$44, DW_AT_name("quot")
     529                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("quot")
     530                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     531                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     532                    .dwattr $C$DW$44, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     533                    .dwattr $C$DW$44, DW_AT_decl_line(0x48)
     534                    .dwattr $C$DW$44, DW_AT_decl_column(0x17)
     535            $C$DW$45        .dwtag  DW_TAG_member
     536                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$12)
     537                    .dwattr $C$DW$45, DW_AT_name("rem")
     538                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("rem")
     539                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     540                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     541                    .dwattr $C$DW$45, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     542                    .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     543                    .dwattr $C$DW$45, DW_AT_decl_column(0x1d)
     544                    .dwendtag $C$DW$T$26
     545            
     546                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     547                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
     548                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     549            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     550                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
     551                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     552                    .dwattr $C$DW$T$72, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     553                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x48)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   14

     554                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x24)
     555            
     556            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     557                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     558            $C$DW$46        .dwtag  DW_TAG_member
     559                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$14)
     560                    .dwattr $C$DW$46, DW_AT_name("quot")
     561                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("quot")
     562                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     564                    .dwattr $C$DW$46, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     565                    .dwattr $C$DW$46, DW_AT_decl_line(0x4b)
     566                    .dwattr $C$DW$46, DW_AT_decl_column(0x1c)
     567            $C$DW$47        .dwtag  DW_TAG_member
     568                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$14)
     569                    .dwattr $C$DW$47, DW_AT_name("rem")
     570                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("rem")
     571                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     572                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     573                    .dwattr $C$DW$47, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     574                    .dwattr $C$DW$47, DW_AT_decl_line(0x4b)
     575                    .dwattr $C$DW$47, DW_AT_decl_column(0x22)
     576                    .dwendtag $C$DW$T$27
     577            
     578                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     579                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x4b)
     580                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     581            $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     582                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$27)
     583                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     584                    .dwattr $C$DW$T$73, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     585                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x4b)
     586                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x29)
     587            
     588            $C$DW$T$28      .dwtag  DW_TAG_structure_type
     589                    .dwattr $C$DW$T$28, DW_AT_name("ADC12_A_configureMemoryParam")
     590                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x05)
     591            $C$DW$48        .dwtag  DW_TAG_member
     592                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     593                    .dwattr $C$DW$48, DW_AT_name("memoryBufferControlIndex")
     594                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("memoryBufferControlIndex")
     595                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     597                    .dwattr $C$DW$48, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     598                    .dwattr $C$DW$48, DW_AT_decl_line(0x53)
     599                    .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     600            $C$DW$49        .dwtag  DW_TAG_member
     601                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     602                    .dwattr $C$DW$49, DW_AT_name("inputSourceSelect")
     603                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("inputSourceSelect")
     604                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     605                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     606                    .dwattr $C$DW$49, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     607                    .dwattr $C$DW$49, DW_AT_decl_line(0x67)
     608                    .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   15

     609            $C$DW$50        .dwtag  DW_TAG_member
     610                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     611                    .dwattr $C$DW$50, DW_AT_name("positiveRefVoltageSourceSelect")
     612                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
     613                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     614                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     615                    .dwattr $C$DW$50, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     616                    .dwattr $C$DW$50, DW_AT_decl_line(0x6e)
     617                    .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     618            $C$DW$51        .dwtag  DW_TAG_member
     619                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     620                    .dwattr $C$DW$51, DW_AT_name("negativeRefVoltageSourceSelect")
     621                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
     622                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     623                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     624                    .dwattr $C$DW$51, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     625                    .dwattr $C$DW$51, DW_AT_decl_line(0x74)
     626                    .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     627            $C$DW$52        .dwtag  DW_TAG_member
     628                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     629                    .dwattr $C$DW$52, DW_AT_name("endOfSequence")
     630                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("endOfSequence")
     631                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     632                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     633                    .dwattr $C$DW$52, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     634                    .dwattr $C$DW$52, DW_AT_decl_line(0x7a)
     635                    .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     636                    .dwendtag $C$DW$T$28
     637            
     638                    .dwattr $C$DW$T$28, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     639                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f)
     640                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     641            $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("ADC12_A_configureMemoryParam")
     642                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$28)
     643                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
     644                    .dwattr $C$DW$T$74, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     645                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x7b)
     646                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
     647            
     648            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     649                    .dwattr $C$DW$T$30, DW_AT_name("Calendar")
     650                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
     651            $C$DW$53        .dwtag  DW_TAG_member
     652                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     653                    .dwattr $C$DW$53, DW_AT_name("Seconds")
     654                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("Seconds")
     655                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     656                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     657                    .dwattr $C$DW$53, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     658                    .dwattr $C$DW$53, DW_AT_decl_line(0x42)
     659                    .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     660            $C$DW$54        .dwtag  DW_TAG_member
     661                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     662                    .dwattr $C$DW$54, DW_AT_name("Minutes")
     663                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("Minutes")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   16

     664                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     665                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     666                    .dwattr $C$DW$54, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     667                    .dwattr $C$DW$54, DW_AT_decl_line(0x44)
     668                    .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     669            $C$DW$55        .dwtag  DW_TAG_member
     670                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     671                    .dwattr $C$DW$55, DW_AT_name("Hours")
     672                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("Hours")
     673                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     674                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     675                    .dwattr $C$DW$55, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     676                    .dwattr $C$DW$55, DW_AT_decl_line(0x46)
     677                    .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     678            $C$DW$56        .dwtag  DW_TAG_member
     679                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     680                    .dwattr $C$DW$56, DW_AT_name("DayOfWeek")
     681                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("DayOfWeek")
     682                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     683                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     684                    .dwattr $C$DW$56, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     685                    .dwattr $C$DW$56, DW_AT_decl_line(0x48)
     686                    .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     687            $C$DW$57        .dwtag  DW_TAG_member
     688                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     689                    .dwattr $C$DW$57, DW_AT_name("DayOfMonth")
     690                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("DayOfMonth")
     691                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     692                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     693                    .dwattr $C$DW$57, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     694                    .dwattr $C$DW$57, DW_AT_decl_line(0x4a)
     695                    .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     696            $C$DW$58        .dwtag  DW_TAG_member
     697                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     698                    .dwattr $C$DW$58, DW_AT_name("Month")
     699                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("Month")
     700                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     701                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     702                    .dwattr $C$DW$58, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     703                    .dwattr $C$DW$58, DW_AT_decl_line(0x4c)
     704                    .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     705            $C$DW$59        .dwtag  DW_TAG_member
     706                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$29)
     707                    .dwattr $C$DW$59, DW_AT_name("Year")
     708                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("Year")
     709                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     710                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     711                    .dwattr $C$DW$59, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     712                    .dwattr $C$DW$59, DW_AT_decl_line(0x4e)
     713                    .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
     714                    .dwendtag $C$DW$T$30
     715            
     716                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     717                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
     718                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   17

     719            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("Calendar")
     720                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$30)
     721                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     722                    .dwattr $C$DW$T$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     723                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
     724                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
     725            
     726            $C$DW$T$31      .dwtag  DW_TAG_structure_type
     727                    .dwattr $C$DW$T$31, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     728                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
     729            $C$DW$60        .dwtag  DW_TAG_member
     730                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$29)
     731                    .dwattr $C$DW$60, DW_AT_name("supplyVoltageReferenceBase")
     732                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
     733                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     735                    .dwattr $C$DW$60, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     736                    .dwattr $C$DW$60, DW_AT_decl_line(0x8e)
     737                    .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
     738            $C$DW$61        .dwtag  DW_TAG_member
     739                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$29)
     740                    .dwattr $C$DW$61, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
     741                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
     742                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     743                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     744                    .dwattr $C$DW$61, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     745                    .dwattr $C$DW$61, DW_AT_decl_line(0x91)
     746                    .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     747            $C$DW$62        .dwtag  DW_TAG_member
     748                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$29)
     749                    .dwattr $C$DW$62, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
     750                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
     751                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     752                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     753                    .dwattr $C$DW$62, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     754                    .dwattr $C$DW$62, DW_AT_decl_line(0x94)
     755                    .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
     756            $C$DW$63        .dwtag  DW_TAG_member
     757                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$29)
     758                    .dwattr $C$DW$63, DW_AT_name("referenceAccuracy")
     759                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("referenceAccuracy")
     760                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     761                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     762                    .dwattr $C$DW$63, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     763                    .dwattr $C$DW$63, DW_AT_decl_line(0x9a)
     764                    .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
     765                    .dwendtag $C$DW$T$31
     766            
     767                    .dwattr $C$DW$T$31, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     768                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x85)
     769                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     770            $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     771                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$31)
     772                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
     773                    .dwattr $C$DW$T$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   18

     774                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x9b)
     775                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
     776            
     777            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     778                    .dwattr $C$DW$T$32, DW_AT_name("Comp_B_initializeParam")
     779                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
     780            $C$DW$64        .dwtag  DW_TAG_member
     781                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     782                    .dwattr $C$DW$64, DW_AT_name("positiveTerminalInput")
     783                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("positiveTerminalInput")
     784                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     786                    .dwattr $C$DW$64, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     787                    .dwattr $C$DW$64, DW_AT_decl_line(0x53)
     788                    .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     789            $C$DW$65        .dwtag  DW_TAG_member
     790                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     791                    .dwattr $C$DW$65, DW_AT_name("negativeTerminalInput")
     792                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("negativeTerminalInput")
     793                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     794                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     795                    .dwattr $C$DW$65, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     796                    .dwattr $C$DW$65, DW_AT_decl_line(0x67)
     797                    .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     798            $C$DW$66        .dwtag  DW_TAG_member
     799                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$29)
     800                    .dwattr $C$DW$66, DW_AT_name("powerModeSelect")
     801                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("powerModeSelect")
     802                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     803                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     804                    .dwattr $C$DW$66, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     805                    .dwattr $C$DW$66, DW_AT_decl_line(0x6d)
     806                    .dwattr $C$DW$66, DW_AT_decl_column(0x0e)
     807            $C$DW$67        .dwtag  DW_TAG_member
     808                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     809                    .dwattr $C$DW$67, DW_AT_name("outputFilterEnableAndDelayLevel")
     810                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
     811                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     812                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     813                    .dwattr $C$DW$67, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     814                    .dwattr $C$DW$67, DW_AT_decl_line(0x77)
     815                    .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     816            $C$DW$68        .dwtag  DW_TAG_member
     817                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$29)
     818                    .dwattr $C$DW$68, DW_AT_name("invertedOutputPolarity")
     819                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("invertedOutputPolarity")
     820                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     821                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     822                    .dwattr $C$DW$68, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     823                    .dwattr $C$DW$68, DW_AT_decl_line(0x7c)
     824                    .dwattr $C$DW$68, DW_AT_decl_column(0x0e)
     825                    .dwendtag $C$DW$T$32
     826            
     827                    .dwattr $C$DW$T$32, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     828                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x3e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   19

     829                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     830            $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_initializeParam")
     831                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$32)
     832                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     833                    .dwattr $C$DW$T$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     834                    .dwattr $C$DW$T$77, DW_AT_decl_line(0x7d)
     835                    .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
     836            
     837            $C$DW$T$33      .dwtag  DW_TAG_structure_type
     838                    .dwattr $C$DW$T$33, DW_AT_name("DMA_initializeParam")
     839                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
     840            $C$DW$69        .dwtag  DW_TAG_member
     841                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     842                    .dwattr $C$DW$69, DW_AT_name("channelSelect")
     843                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("channelSelect")
     844                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     846                    .dwattr $C$DW$69, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     847                    .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
     848                    .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     849            $C$DW$70        .dwtag  DW_TAG_member
     850                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$29)
     851                    .dwattr $C$DW$70, DW_AT_name("transferModeSelect")
     852                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("transferModeSelect")
     853                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     854                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     855                    .dwattr $C$DW$70, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     856                    .dwattr $C$DW$70, DW_AT_decl_line(0x53)
     857                    .dwattr $C$DW$70, DW_AT_decl_column(0x0e)
     858            $C$DW$71        .dwtag  DW_TAG_member
     859                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$29)
     860                    .dwattr $C$DW$71, DW_AT_name("transferSize")
     861                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("transferSize")
     862                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     864                    .dwattr $C$DW$71, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     865                    .dwattr $C$DW$71, DW_AT_decl_line(0x57)
     866                    .dwattr $C$DW$71, DW_AT_decl_column(0x0e)
     867            $C$DW$72        .dwtag  DW_TAG_member
     868                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     869                    .dwattr $C$DW$72, DW_AT_name("triggerSourceSelect")
     870                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("triggerSourceSelect")
     871                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     872                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     873                    .dwattr $C$DW$72, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     874                    .dwattr $C$DW$72, DW_AT_decl_line(0x7b)
     875                    .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     876            $C$DW$73        .dwtag  DW_TAG_member
     877                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     878                    .dwattr $C$DW$73, DW_AT_name("transferUnitSelect")
     879                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("transferUnitSelect")
     880                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     881                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     882                    .dwattr $C$DW$73, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     883                    .dwattr $C$DW$73, DW_AT_decl_line(0x82)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   20

     884                    .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     885            $C$DW$74        .dwtag  DW_TAG_member
     886                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     887                    .dwattr $C$DW$74, DW_AT_name("triggerTypeSelect")
     888                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("triggerTypeSelect")
     889                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     890                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     891                    .dwattr $C$DW$74, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     892                    .dwattr $C$DW$74, DW_AT_decl_line(0x88)
     893                    .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     894                    .dwendtag $C$DW$T$33
     895            
     896                    .dwattr $C$DW$T$33, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     897                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x3e)
     898                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
     899            $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("DMA_initializeParam")
     900                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$33)
     901                    .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     902                    .dwattr $C$DW$T$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     903                    .dwattr $C$DW$T$78, DW_AT_decl_line(0x89)
     904                    .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
     905            
     906            $C$DW$T$34      .dwtag  DW_TAG_structure_type
     907                    .dwattr $C$DW$T$34, DW_AT_name("PMAP_initPortsParam")
     908                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     909            $C$DW$75        .dwtag  DW_TAG_member
     910                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
     911                    .dwattr $C$DW$75, DW_AT_name("portMapping")
     912                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("portMapping")
     913                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     915                    .dwattr $C$DW$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     916                    .dwattr $C$DW$75, DW_AT_decl_line(0x41)
     917                    .dwattr $C$DW$75, DW_AT_decl_column(0x14)
     918            $C$DW$76        .dwtag  DW_TAG_member
     919                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
     920                    .dwattr $C$DW$76, DW_AT_name("PxMAPy")
     921                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("PxMAPy")
     922                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     923                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     924                    .dwattr $C$DW$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     925                    .dwattr $C$DW$76, DW_AT_decl_line(0x43)
     926                    .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
     927            $C$DW$77        .dwtag  DW_TAG_member
     928                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     929                    .dwattr $C$DW$77, DW_AT_name("numberOfPorts")
     930                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("numberOfPorts")
     931                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     932                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     933                    .dwattr $C$DW$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     934                    .dwattr $C$DW$77, DW_AT_decl_line(0x45)
     935                    .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     936            $C$DW$78        .dwtag  DW_TAG_member
     937                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     938                    .dwattr $C$DW$78, DW_AT_name("portMapReconfigure")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   21

     939                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("portMapReconfigure")
     940                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     941                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     942                    .dwattr $C$DW$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     943                    .dwattr $C$DW$78, DW_AT_decl_line(0x4a)
     944                    .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     945                    .dwendtag $C$DW$T$34
     946            
     947                    .dwattr $C$DW$T$34, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     948                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e)
     949                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
     950            $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("PMAP_initPortsParam")
     951                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$34)
     952                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     953                    .dwattr $C$DW$T$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     954                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x4b)
     955                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
     956            
     957            $C$DW$T$35      .dwtag  DW_TAG_structure_type
     958                    .dwattr $C$DW$T$35, DW_AT_name("RTC_B_configureCalendarAlarmParam")
     959                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     960            $C$DW$79        .dwtag  DW_TAG_member
     961                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     962                    .dwattr $C$DW$79, DW_AT_name("minutesAlarm")
     963                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("minutesAlarm")
     964                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     966                    .dwattr $C$DW$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     967                    .dwattr $C$DW$79, DW_AT_decl_line(0x5c)
     968                    .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     969            $C$DW$80        .dwtag  DW_TAG_member
     970                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     971                    .dwattr $C$DW$80, DW_AT_name("hoursAlarm")
     972                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("hoursAlarm")
     973                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     974                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     975                    .dwattr $C$DW$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     976                    .dwattr $C$DW$80, DW_AT_decl_line(0x60)
     977                    .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
     978            $C$DW$81        .dwtag  DW_TAG_member
     979                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     980                    .dwattr $C$DW$81, DW_AT_name("dayOfWeekAlarm")
     981                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("dayOfWeekAlarm")
     982                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     983                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     984                    .dwattr $C$DW$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     985                    .dwattr $C$DW$81, DW_AT_decl_line(0x64)
     986                    .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
     987            $C$DW$82        .dwtag  DW_TAG_member
     988                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     989                    .dwattr $C$DW$82, DW_AT_name("dayOfMonthAlarm")
     990                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("dayOfMonthAlarm")
     991                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     992                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     993                    .dwattr $C$DW$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   22

     994                    .dwattr $C$DW$82, DW_AT_decl_line(0x68)
     995                    .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
     996                    .dwendtag $C$DW$T$35
     997            
     998                    .dwattr $C$DW$T$35, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     999                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x57)
    1000                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1001            $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("RTC_B_configureCalendarAlarmParam")
    1002                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$35)
    1003                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1004                    .dwattr $C$DW$T$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1005                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x69)
    1006                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    1007            
    1008            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1009                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initCaptureModeParam")
    1010                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1011            $C$DW$83        .dwtag  DW_TAG_member
    1012                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
    1013                    .dwattr $C$DW$83, DW_AT_name("captureRegister")
    1014                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("captureRegister")
    1015                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1017                    .dwattr $C$DW$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1018                    .dwattr $C$DW$83, DW_AT_decl_line(0x89)
    1019                    .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1020            $C$DW$84        .dwtag  DW_TAG_member
    1021                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$29)
    1022                    .dwattr $C$DW$84, DW_AT_name("captureMode")
    1023                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("captureMode")
    1024                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1025                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1026                    .dwattr $C$DW$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1027                    .dwattr $C$DW$84, DW_AT_decl_line(0x90)
    1028                    .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1029            $C$DW$85        .dwtag  DW_TAG_member
    1030                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$29)
    1031                    .dwattr $C$DW$85, DW_AT_name("captureInputSelect")
    1032                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("captureInputSelect")
    1033                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1034                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1035                    .dwattr $C$DW$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1036                    .dwattr $C$DW$85, DW_AT_decl_line(0x97)
    1037                    .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1038            $C$DW$86        .dwtag  DW_TAG_member
    1039                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$29)
    1040                    .dwattr $C$DW$86, DW_AT_name("synchronizeCaptureSource")
    1041                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1042                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1043                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1044                    .dwattr $C$DW$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1045                    .dwattr $C$DW$86, DW_AT_decl_line(0x9c)
    1046                    .dwattr $C$DW$86, DW_AT_decl_column(0x0e)
    1047            $C$DW$87        .dwtag  DW_TAG_member
    1048                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   23

    1049                    .dwattr $C$DW$87, DW_AT_name("captureInterruptEnable")
    1050                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("captureInterruptEnable")
    1051                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1052                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1053                    .dwattr $C$DW$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1054                    .dwattr $C$DW$87, DW_AT_decl_line(0xa1)
    1055                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1056            $C$DW$88        .dwtag  DW_TAG_member
    1057                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$29)
    1058                    .dwattr $C$DW$88, DW_AT_name("captureOutputMode")
    1059                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("captureOutputMode")
    1060                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1061                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1062                    .dwattr $C$DW$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1063                    .dwattr $C$DW$88, DW_AT_decl_line(0xac)
    1064                    .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1065                    .dwendtag $C$DW$T$36
    1066            
    1067                    .dwattr $C$DW$T$36, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1068                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x7d)
    1069                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1070            $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCaptureModeParam")
    1071                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$36)
    1072                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1073                    .dwattr $C$DW$T$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1074                    .dwattr $C$DW$T$81, DW_AT_decl_line(0xad)
    1075                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    1076            
    1077            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1078                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_initCompareModeParam")
    1079                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    1080            $C$DW$89        .dwtag  DW_TAG_member
    1081                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$29)
    1082                    .dwattr $C$DW$89, DW_AT_name("compareRegister")
    1083                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("compareRegister")
    1084                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1086                    .dwattr $C$DW$89, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1087                    .dwattr $C$DW$89, DW_AT_decl_line(0x17a)
    1088                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1089            $C$DW$90        .dwtag  DW_TAG_member
    1090                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$29)
    1091                    .dwattr $C$DW$90, DW_AT_name("compareInterruptEnable")
    1092                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("compareInterruptEnable")
    1093                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1094                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1095                    .dwattr $C$DW$90, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1096                    .dwattr $C$DW$90, DW_AT_decl_line(0x17f)
    1097                    .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1098            $C$DW$91        .dwtag  DW_TAG_member
    1099                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$29)
    1100                    .dwattr $C$DW$91, DW_AT_name("compareOutputMode")
    1101                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("compareOutputMode")
    1102                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1103                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   24

    1104                    .dwattr $C$DW$91, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1105                    .dwattr $C$DW$91, DW_AT_decl_line(0x18a)
    1106                    .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1107            $C$DW$92        .dwtag  DW_TAG_member
    1108                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$29)
    1109                    .dwattr $C$DW$92, DW_AT_name("compareValue")
    1110                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("compareValue")
    1111                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1112                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1113                    .dwattr $C$DW$92, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1114                    .dwattr $C$DW$92, DW_AT_decl_line(0x18c)
    1115                    .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1116                    .dwendtag $C$DW$T$37
    1117            
    1118                    .dwattr $C$DW$T$37, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1119                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x16e)
    1120                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1121            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCompareModeParam")
    1122                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$37)
    1123                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1124                    .dwattr $C$DW$T$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1125                    .dwattr $C$DW$T$82, DW_AT_decl_line(0x18d)
    1126                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1127            
    1128            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1129                    .dwattr $C$DW$T$39, DW_AT_name("Timer_A_initContinuousModeParam")
    1130                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1131            $C$DW$93        .dwtag  DW_TAG_member
    1132                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$29)
    1133                    .dwattr $C$DW$93, DW_AT_name("clockSource")
    1134                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("clockSource")
    1135                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1137                    .dwattr $C$DW$93, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1138                    .dwattr $C$DW$93, DW_AT_decl_line(0x50)
    1139                    .dwattr $C$DW$93, DW_AT_decl_column(0x0e)
    1140            $C$DW$94        .dwtag  DW_TAG_member
    1141                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$29)
    1142                    .dwattr $C$DW$94, DW_AT_name("clockSourceDivider")
    1143                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("clockSourceDivider")
    1144                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1145                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1146                    .dwattr $C$DW$94, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1147                    .dwattr $C$DW$94, DW_AT_decl_line(0x67)
    1148                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1149            $C$DW$95        .dwtag  DW_TAG_member
    1150                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
    1151                    .dwattr $C$DW$95, DW_AT_name("timerInterruptEnable_TAIE")
    1152                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1153                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1154                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1155                    .dwattr $C$DW$95, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1156                    .dwattr $C$DW$95, DW_AT_decl_line(0x6c)
    1157                    .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1158            $C$DW$96        .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   25

    1159                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$29)
    1160                    .dwattr $C$DW$96, DW_AT_name("timerClear")
    1161                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("timerClear")
    1162                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1163                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1164                    .dwattr $C$DW$96, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1165                    .dwattr $C$DW$96, DW_AT_decl_line(0x72)
    1166                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1167            $C$DW$97        .dwtag  DW_TAG_member
    1168                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$38)
    1169                    .dwattr $C$DW$97, DW_AT_name("startTimer")
    1170                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("startTimer")
    1171                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1172                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1173                    .dwattr $C$DW$97, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1174                    .dwattr $C$DW$97, DW_AT_decl_line(0x74)
    1175                    .dwattr $C$DW$97, DW_AT_decl_column(0x0a)
    1176                    .dwendtag $C$DW$T$39
    1177            
    1178                    .dwattr $C$DW$T$39, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1179                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x48)
    1180                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1181            $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initContinuousModeParam")
    1182                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
    1183                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1184                    .dwattr $C$DW$T$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1185                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x75)
    1186                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1187            
    1188            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1189                    .dwattr $C$DW$T$40, DW_AT_name("Timer_A_initUpDownModeParam")
    1190                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    1191            $C$DW$98        .dwtag  DW_TAG_member
    1192                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$29)
    1193                    .dwattr $C$DW$98, DW_AT_name("clockSource")
    1194                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("clockSource")
    1195                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1197                    .dwattr $C$DW$98, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1198                    .dwattr $C$DW$98, DW_AT_decl_line(0xbd)
    1199                    .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1200            $C$DW$99        .dwtag  DW_TAG_member
    1201                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$29)
    1202                    .dwattr $C$DW$99, DW_AT_name("clockSourceDivider")
    1203                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("clockSourceDivider")
    1204                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1205                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1206                    .dwattr $C$DW$99, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1207                    .dwattr $C$DW$99, DW_AT_decl_line(0xd4)
    1208                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1209            $C$DW$100       .dwtag  DW_TAG_member
    1210                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$29)
    1211                    .dwattr $C$DW$100, DW_AT_name("timerPeriod")
    1212                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("timerPeriod")
    1213                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   26

    1214                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1215                    .dwattr $C$DW$100, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1216                    .dwattr $C$DW$100, DW_AT_decl_line(0xd6)
    1217                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1218            $C$DW$101       .dwtag  DW_TAG_member
    1219                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$29)
    1220                    .dwattr $C$DW$101, DW_AT_name("timerInterruptEnable_TAIE")
    1221                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1222                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1223                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1224                    .dwattr $C$DW$101, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1225                    .dwattr $C$DW$101, DW_AT_decl_line(0xdb)
    1226                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1227            $C$DW$102       .dwtag  DW_TAG_member
    1228                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1229                    .dwattr $C$DW$102, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1230                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1231                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1232                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1233                    .dwattr $C$DW$102, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1234                    .dwattr $C$DW$102, DW_AT_decl_line(0xe0)
    1235                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1236            $C$DW$103       .dwtag  DW_TAG_member
    1237                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$29)
    1238                    .dwattr $C$DW$103, DW_AT_name("timerClear")
    1239                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("timerClear")
    1240                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1241                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1242                    .dwattr $C$DW$103, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1243                    .dwattr $C$DW$103, DW_AT_decl_line(0xe6)
    1244                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1245            $C$DW$104       .dwtag  DW_TAG_member
    1246                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$38)
    1247                    .dwattr $C$DW$104, DW_AT_name("startTimer")
    1248                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("startTimer")
    1249                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1250                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1251                    .dwattr $C$DW$104, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1252                    .dwattr $C$DW$104, DW_AT_decl_line(0xe8)
    1253                    .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1254                    .dwendtag $C$DW$T$40
    1255            
    1256                    .dwattr $C$DW$T$40, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1257                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xb5)
    1258                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1259            $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpDownModeParam")
    1260                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$40)
    1261                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1262                    .dwattr $C$DW$T$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1263                    .dwattr $C$DW$T$84, DW_AT_decl_line(0xe9)
    1264                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1265            
    1266            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1267                    .dwattr $C$DW$T$41, DW_AT_name("Timer_A_initUpModeParam")
    1268                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   27

    1269            $C$DW$105       .dwtag  DW_TAG_member
    1270                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$29)
    1271                    .dwattr $C$DW$105, DW_AT_name("clockSource")
    1272                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("clockSource")
    1273                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1275                    .dwattr $C$DW$105, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1276                    .dwattr $C$DW$105, DW_AT_decl_line(0x139)
    1277                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1278            $C$DW$106       .dwtag  DW_TAG_member
    1279                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1280                    .dwattr $C$DW$106, DW_AT_name("clockSourceDivider")
    1281                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("clockSourceDivider")
    1282                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1283                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1284                    .dwattr $C$DW$106, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1285                    .dwattr $C$DW$106, DW_AT_decl_line(0x150)
    1286                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1287            $C$DW$107       .dwtag  DW_TAG_member
    1288                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    1289                    .dwattr $C$DW$107, DW_AT_name("timerPeriod")
    1290                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("timerPeriod")
    1291                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1292                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1293                    .dwattr $C$DW$107, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1294                    .dwattr $C$DW$107, DW_AT_decl_line(0x153)
    1295                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1296            $C$DW$108       .dwtag  DW_TAG_member
    1297                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$29)
    1298                    .dwattr $C$DW$108, DW_AT_name("timerInterruptEnable_TAIE")
    1299                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1300                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1301                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1302                    .dwattr $C$DW$108, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1303                    .dwattr $C$DW$108, DW_AT_decl_line(0x158)
    1304                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1305            $C$DW$109       .dwtag  DW_TAG_member
    1306                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$29)
    1307                    .dwattr $C$DW$109, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1308                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1309                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1310                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1311                    .dwattr $C$DW$109, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1312                    .dwattr $C$DW$109, DW_AT_decl_line(0x15d)
    1313                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1314            $C$DW$110       .dwtag  DW_TAG_member
    1315                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$29)
    1316                    .dwattr $C$DW$110, DW_AT_name("timerClear")
    1317                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("timerClear")
    1318                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1319                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1320                    .dwattr $C$DW$110, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1321                    .dwattr $C$DW$110, DW_AT_decl_line(0x163)
    1322                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1323            $C$DW$111       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   28

    1324                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$38)
    1325                    .dwattr $C$DW$111, DW_AT_name("startTimer")
    1326                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("startTimer")
    1327                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1328                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1329                    .dwattr $C$DW$111, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1330                    .dwattr $C$DW$111, DW_AT_decl_line(0x165)
    1331                    .dwattr $C$DW$111, DW_AT_decl_column(0x0a)
    1332                    .dwendtag $C$DW$T$41
    1333            
    1334                    .dwattr $C$DW$T$41, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1335                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x131)
    1336                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1337            $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpModeParam")
    1338                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$41)
    1339                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1340                    .dwattr $C$DW$T$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1341                    .dwattr $C$DW$T$85, DW_AT_decl_line(0x166)
    1342                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1343            
    1344            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1345                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    1346                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1347            $C$DW$112       .dwtag  DW_TAG_member
    1348                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$29)
    1349                    .dwattr $C$DW$112, DW_AT_name("clockSource")
    1350                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("clockSource")
    1351                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1353                    .dwattr $C$DW$112, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1354                    .dwattr $C$DW$112, DW_AT_decl_line(0xf8)
    1355                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1356            $C$DW$113       .dwtag  DW_TAG_member
    1357                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1358                    .dwattr $C$DW$113, DW_AT_name("clockSourceDivider")
    1359                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("clockSourceDivider")
    1360                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1361                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1362                    .dwattr $C$DW$113, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1363                    .dwattr $C$DW$113, DW_AT_decl_line(0x10f)
    1364                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1365            $C$DW$114       .dwtag  DW_TAG_member
    1366                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$29)
    1367                    .dwattr $C$DW$114, DW_AT_name("timerPeriod")
    1368                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("timerPeriod")
    1369                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1370                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1371                    .dwattr $C$DW$114, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1372                    .dwattr $C$DW$114, DW_AT_decl_line(0x111)
    1373                    .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1374            $C$DW$115       .dwtag  DW_TAG_member
    1375                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1376                    .dwattr $C$DW$115, DW_AT_name("compareRegister")
    1377                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("compareRegister")
    1378                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   29

    1379                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1380                    .dwattr $C$DW$115, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1381                    .dwattr $C$DW$115, DW_AT_decl_line(0x11c)
    1382                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1383            $C$DW$116       .dwtag  DW_TAG_member
    1384                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    1385                    .dwattr $C$DW$116, DW_AT_name("compareOutputMode")
    1386                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("compareOutputMode")
    1387                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1388                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1389                    .dwattr $C$DW$116, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1390                    .dwattr $C$DW$116, DW_AT_decl_line(0x127)
    1391                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1392            $C$DW$117       .dwtag  DW_TAG_member
    1393                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1394                    .dwattr $C$DW$117, DW_AT_name("dutyCycle")
    1395                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("dutyCycle")
    1396                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1397                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1398                    .dwattr $C$DW$117, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1399                    .dwattr $C$DW$117, DW_AT_decl_line(0x129)
    1400                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1401                    .dwendtag $C$DW$T$42
    1402            
    1403                    .dwattr $C$DW$T$42, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1404                    .dwattr $C$DW$T$42, DW_AT_decl_line(0xf0)
    1405                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    1406            $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_outputPWMParam")
    1407                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$42)
    1408                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1409                    .dwattr $C$DW$T$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1410                    .dwattr $C$DW$T$86, DW_AT_decl_line(0x12a)
    1411                    .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1412            
    1413            $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1414                    .dwattr $C$DW$T$43, DW_AT_name("Timer_B_initCaptureModeParam")
    1415                    .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    1416            $C$DW$118       .dwtag  DW_TAG_member
    1417                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1418                    .dwattr $C$DW$118, DW_AT_name("captureRegister")
    1419                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("captureRegister")
    1420                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1422                    .dwattr $C$DW$118, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1423                    .dwattr $C$DW$118, DW_AT_decl_line(0xd1)
    1424                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1425            $C$DW$119       .dwtag  DW_TAG_member
    1426                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
    1427                    .dwattr $C$DW$119, DW_AT_name("captureMode")
    1428                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("captureMode")
    1429                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1430                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1431                    .dwattr $C$DW$119, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1432                    .dwattr $C$DW$119, DW_AT_decl_line(0xd8)
    1433                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   30

    1434            $C$DW$120       .dwtag  DW_TAG_member
    1435                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$29)
    1436                    .dwattr $C$DW$120, DW_AT_name("captureInputSelect")
    1437                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("captureInputSelect")
    1438                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1439                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1440                    .dwattr $C$DW$120, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1441                    .dwattr $C$DW$120, DW_AT_decl_line(0xdf)
    1442                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1443            $C$DW$121       .dwtag  DW_TAG_member
    1444                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$29)
    1445                    .dwattr $C$DW$121, DW_AT_name("synchronizeCaptureSource")
    1446                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1447                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1448                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1449                    .dwattr $C$DW$121, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1450                    .dwattr $C$DW$121, DW_AT_decl_line(0xe4)
    1451                    .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    1452            $C$DW$122       .dwtag  DW_TAG_member
    1453                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$29)
    1454                    .dwattr $C$DW$122, DW_AT_name("captureInterruptEnable")
    1455                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("captureInterruptEnable")
    1456                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1457                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1458                    .dwattr $C$DW$122, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1459                    .dwattr $C$DW$122, DW_AT_decl_line(0xe9)
    1460                    .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    1461            $C$DW$123       .dwtag  DW_TAG_member
    1462                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$29)
    1463                    .dwattr $C$DW$123, DW_AT_name("captureOutputMode")
    1464                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("captureOutputMode")
    1465                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1466                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1467                    .dwattr $C$DW$123, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1468                    .dwattr $C$DW$123, DW_AT_decl_line(0xf4)
    1469                    .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    1470                    .dwendtag $C$DW$T$43
    1471            
    1472                    .dwattr $C$DW$T$43, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1473                    .dwattr $C$DW$T$43, DW_AT_decl_line(0xc5)
    1474                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    1475            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCaptureModeParam")
    1476                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$43)
    1477                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1478                    .dwattr $C$DW$T$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1479                    .dwattr $C$DW$T$87, DW_AT_decl_line(0xf5)
    1480                    .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1481            
    1482            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1483                    .dwattr $C$DW$T$44, DW_AT_name("Timer_B_initCompareModeParam")
    1484                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    1485            $C$DW$124       .dwtag  DW_TAG_member
    1486                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    1487                    .dwattr $C$DW$124, DW_AT_name("compareRegister")
    1488                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("compareRegister")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   31

    1489                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1491                    .dwattr $C$DW$124, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1492                    .dwattr $C$DW$124, DW_AT_decl_line(0x17a)
    1493                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    1494            $C$DW$125       .dwtag  DW_TAG_member
    1495                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    1496                    .dwattr $C$DW$125, DW_AT_name("compareInterruptEnable")
    1497                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("compareInterruptEnable")
    1498                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1499                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1500                    .dwattr $C$DW$125, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1501                    .dwattr $C$DW$125, DW_AT_decl_line(0x17f)
    1502                    .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    1503            $C$DW$126       .dwtag  DW_TAG_member
    1504                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1505                    .dwattr $C$DW$126, DW_AT_name("compareOutputMode")
    1506                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("compareOutputMode")
    1507                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1508                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1509                    .dwattr $C$DW$126, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1510                    .dwattr $C$DW$126, DW_AT_decl_line(0x18a)
    1511                    .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    1512            $C$DW$127       .dwtag  DW_TAG_member
    1513                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
    1514                    .dwattr $C$DW$127, DW_AT_name("compareValue")
    1515                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("compareValue")
    1516                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1517                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1518                    .dwattr $C$DW$127, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1519                    .dwattr $C$DW$127, DW_AT_decl_line(0x18c)
    1520                    .dwattr $C$DW$127, DW_AT_decl_column(0x0e)
    1521                    .dwendtag $C$DW$T$44
    1522            
    1523                    .dwattr $C$DW$T$44, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1524                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x16e)
    1525                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    1526            $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCompareModeParam")
    1527                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$44)
    1528                    .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1529                    .dwattr $C$DW$T$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1530                    .dwattr $C$DW$T$88, DW_AT_decl_line(0x18d)
    1531                    .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1532            
    1533            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1534                    .dwattr $C$DW$T$45, DW_AT_name("Timer_B_initContinuousModeParam")
    1535                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    1536            $C$DW$128       .dwtag  DW_TAG_member
    1537                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$29)
    1538                    .dwattr $C$DW$128, DW_AT_name("clockSource")
    1539                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("clockSource")
    1540                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1542                    .dwattr $C$DW$128, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1543                    .dwattr $C$DW$128, DW_AT_decl_line(0x105)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
debug.asm                                                            PAGE   32

    1544                    .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    1545            $C$DW$129       .dwtag  DW_TAG_member
    1546                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    1547                    .dwattr $C$DW$129, DW_AT_name("clockSourceDivider")
    1548                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("clockSourceDivider")
    1549                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1550                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1551                    .dwattr $C$DW$129, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1552                    .dwattr $C$DW$129, DW_AT_decl_line(0x11c)
    1553                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    1554            $C$DW$130       .dwtag  DW_TAG_member
    1555                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$29)
    1556                    .dwattr $C$DW$130, DW_AT_name("timerInterruptEnable_TBIE")
    1557                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1558                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1559                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1560                    .dwattr $C$DW$130, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1561                    .dwattr $C$DW$130, DW_AT_decl_line(0x121)
    1562                    .dwattr $C$DW$130, DW_AT_decl_column(0x0e)
    1563            $C$DW$131       .dwtag  DW_TAG_member
    1564                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$29)
    1565                    .dwattr $C$DW$131, DW_AT_name("timerClear")
    1566                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("timerClear")
    1567                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1568                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1569                    .dwattr $C$DW$131, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1570                    .dwattr $C$DW$131, DW_AT_decl_line(0x127)
    1571                    .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    1572            $C$DW$132       .dwtag  DW_TAG_member
    1573                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    1574                    .dwattr $C$DW$132, DW_AT_name("startTimer")
    1575                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("startTimer")
    1576                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1577                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1578                    .dwattr $C$DW$132, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1579                    .dwattr $C$DW$132, DW_AT_decl_line(0x129)
    1580                    .dwattr $C$DW$132, DW_AT_decl_column(0x0a)
    1581                    .dwendtag $C$DW$T$45
    1582            
    1583                    .dwattr $C$DW$T$45, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1584                    .dwattr $C$DW$T$45, DW_AT_decl_line(0xfd)
    1585                    .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1586            $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initContinuousModeParam")
    1587                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$45)
