MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 17:15:22 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../hw_layer.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__disable_interrupt")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("__disable_interrupt")
      15                    .dwattr $C$DW$1, DW_AT_declaration
      16                    .dwattr $C$DW$1, DW_AT_external

     989                    .global SFRIFG1
     990                    .global UCSCTL6
     991                    .global UCSCTL7
     992                    .global UCA0CTLW0_L
     993                    .global UCA0TXBUF
     994                    .global UCA0ICTL_L
     995                    .global UCA0ICTL_H
     996                    .global memcpy
     997            ;*****************************************************************************
     998            ;* SECTION GROUPS                                                            *
     999            ;*****************************************************************************
    1000                    .group    "flash_erase", 1
    1001                    .gmember  ".text:flash_erase"
    1002                    .endgroup
    1003            
    1004            
    1005            ;******************************************************************************
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   22

    1006            ;* BUILD ATTRIBUTES                                                           *
    1007            ;******************************************************************************
    1008                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1009                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
    1010                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
    1011                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1012                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1013                    .battr "mspabi", Tag_File, 1, Tag_enum_size(2)
    1014            
    1015            ;******************************************************************************
    1016            ;* TYPE INFORMATION                                                           *
    1017            ;******************************************************************************
    1018            
    1019            $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    1020                    .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    1021            $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_NONE"), DW_AT_const_value(0x00)
    1022                    .dwattr $C$DW$94, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1023                    .dwattr $C$DW$94, DW_AT_decl_line(0x1c)
    1024                    .dwattr $C$DW$94, DW_AT_decl_column(0x05)
    1025            $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_DOWNLOAD"), DW_AT_const_value(0x01)
    1026                    .dwattr $C$DW$95, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1027                    .dwattr $C$DW$95, DW_AT_decl_line(0x1d)
    1028                    .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    1029            $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_PENDING_VALIDATION"), DW_AT_const_valu
    1030                    .dwattr $C$DW$96, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1031                    .dwattr $C$DW$96, DW_AT_decl_line(0x1e)
    1032                    .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    1033            $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_VALIDATED"), DW_AT_const_value(0x03)
    1034                    .dwattr $C$DW$97, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1035                    .dwattr $C$DW$97, DW_AT_decl_line(0x1f)
    1036                    .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    1037            $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_RECOVERED"), DW_AT_const_value(0x04)
    1038                    .dwattr $C$DW$98, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1039                    .dwattr $C$DW$98, DW_AT_decl_line(0x20)
    1040                    .dwattr $C$DW$98, DW_AT_decl_column(0x05)
    1041            $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_FLASHING_ERROR"), DW_AT_const_value(0x
    1042                    .dwattr $C$DW$99, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1043                    .dwattr $C$DW$99, DW_AT_decl_line(0x21)
    1044                    .dwattr $C$DW$99, DW_AT_decl_column(0x05)
    1045                    .dwendtag $C$DW$T$67
    1046            
    1047                    .dwattr $C$DW$T$67, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1048                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x1b)
    1049                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
    1050            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("bl_image_status_t")
    1051                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1052                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1053                    .dwattr $C$DW$T$68, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1054                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x22)
    1055                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1056            
    1057            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1058                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    1059            $C$DW$100       .dwtag  DW_TAG_member
    1060                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   23

    1061                    .dwattr $C$DW$100, DW_AT_name("base_ptr")
    1062                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("base_ptr")
    1063                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1065                    .dwattr $C$DW$100, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1066                    .dwattr $C$DW$100, DW_AT_decl_line(0x15)
    1067                    .dwattr $C$DW$100, DW_AT_decl_column(0x14)
    1068            $C$DW$101       .dwtag  DW_TAG_member
    1069                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
    1070                    .dwattr $C$DW$101, DW_AT_name("start_ptr")
    1071                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("start_ptr")
    1072                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1073                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1074                    .dwattr $C$DW$101, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1075                    .dwattr $C$DW$101, DW_AT_decl_line(0x16)
    1076                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1077            $C$DW$102       .dwtag  DW_TAG_member
    1078                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$23)
    1079                    .dwattr $C$DW$102, DW_AT_name("max_len")
    1080                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("max_len")
    1081                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1082                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1083                    .dwattr $C$DW$102, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1084                    .dwattr $C$DW$102, DW_AT_decl_line(0x17)
    1085                    .dwattr $C$DW$102, DW_AT_decl_column(0x18)
    1086            $C$DW$103       .dwtag  DW_TAG_member
    1087                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1088                    .dwattr $C$DW$103, DW_AT_name("len")
    1089                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("len")
    1090                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1091                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1092                    .dwattr $C$DW$103, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1093                    .dwattr $C$DW$103, DW_AT_decl_line(0x18)
    1094                    .dwattr $C$DW$103, DW_AT_decl_column(0x12)
    1095                    .dwendtag $C$DW$T$24
    1096            
    1097                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1098                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
    1099                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1100            $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
    1101                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
    1102                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1103                    .dwattr $C$DW$T$69, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1104                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x19)
    1105                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1106            $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    1107                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1108                    .dwattr $C$DW$T$70, DW_AT_address_class(0x14)
    1109            $C$DW$104       .dwtag  DW_TAG_TI_far_type
    1110                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$69)
    1111            $C$DW$T$71      .dwtag  DW_TAG_const_type
    1112                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$104)
    1113            
    1114            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1115                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   24

    1116            $C$DW$105       .dwtag  DW_TAG_member
    1117                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$10)
    1118                    .dwattr $C$DW$105, DW_AT_name("quot")
    1119                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("quot")
    1120                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1121                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1122                    .dwattr $C$DW$105, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1123                    .dwattr $C$DW$105, DW_AT_decl_line(0x46)
    1124                    .dwattr $C$DW$105, DW_AT_decl_column(0x16)
    1125            $C$DW$106       .dwtag  DW_TAG_member
    1126                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$10)
    1127                    .dwattr $C$DW$106, DW_AT_name("rem")
    1128                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("rem")
    1129                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1130                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1131                    .dwattr $C$DW$106, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1132                    .dwattr $C$DW$106, DW_AT_decl_line(0x46)
    1133                    .dwattr $C$DW$106, DW_AT_decl_column(0x1c)
    1134                    .dwendtag $C$DW$T$25
    1135            
    1136                    .dwattr $C$DW$T$25, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1137                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    1138                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1139            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1140                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
    1141                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1142                    .dwattr $C$DW$T$72, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1143                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x46)
    1144                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x23)
    1145            
    1146            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1147                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1148            $C$DW$107       .dwtag  DW_TAG_member
    1149                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$12)
    1150                    .dwattr $C$DW$107, DW_AT_name("quot")
    1151                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("quot")
    1152                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1154                    .dwattr $C$DW$107, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1155                    .dwattr $C$DW$107, DW_AT_decl_line(0x48)
    1156                    .dwattr $C$DW$107, DW_AT_decl_column(0x17)
    1157            $C$DW$108       .dwtag  DW_TAG_member
    1158                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$12)
    1159                    .dwattr $C$DW$108, DW_AT_name("rem")
    1160                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("rem")
    1161                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1162                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1163                    .dwattr $C$DW$108, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1164                    .dwattr $C$DW$108, DW_AT_decl_line(0x48)
    1165                    .dwattr $C$DW$108, DW_AT_decl_column(0x1d)
    1166                    .dwendtag $C$DW$T$26
    1167            
    1168                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1169                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
    1170                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   25

    1171            $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1172                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$26)
    1173                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1174                    .dwattr $C$DW$T$73, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1175                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x48)
    1176                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x24)
    1177            
    1178            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1179                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    1180            $C$DW$109       .dwtag  DW_TAG_member
    1181                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$14)
    1182                    .dwattr $C$DW$109, DW_AT_name("quot")
    1183                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("quot")
    1184                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1186                    .dwattr $C$DW$109, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1187                    .dwattr $C$DW$109, DW_AT_decl_line(0x4b)
    1188                    .dwattr $C$DW$109, DW_AT_decl_column(0x1c)
    1189            $C$DW$110       .dwtag  DW_TAG_member
    1190                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$14)
    1191                    .dwattr $C$DW$110, DW_AT_name("rem")
    1192                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("rem")
    1193                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1194                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1195                    .dwattr $C$DW$110, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1196                    .dwattr $C$DW$110, DW_AT_decl_line(0x4b)
    1197                    .dwattr $C$DW$110, DW_AT_decl_column(0x22)
    1198                    .dwendtag $C$DW$T$27
    1199            
    1200                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1201                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x4b)
    1202                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1203            $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1204                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$27)
    1205                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1206                    .dwattr $C$DW$T$74, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1207                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x4b)
    1208                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x29)
    1209            
    1210            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1211                    .dwattr $C$DW$T$28, DW_AT_name("ADC12_A_configureMemoryParam")
    1212                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x05)
    1213            $C$DW$111       .dwtag  DW_TAG_member
    1214                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1215                    .dwattr $C$DW$111, DW_AT_name("memoryBufferControlIndex")
    1216                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    1217                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1219                    .dwattr $C$DW$111, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1220                    .dwattr $C$DW$111, DW_AT_decl_line(0x53)
    1221                    .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1222            $C$DW$112       .dwtag  DW_TAG_member
    1223                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1224                    .dwattr $C$DW$112, DW_AT_name("inputSourceSelect")
    1225                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("inputSourceSelect")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   26

    1226                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1227                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1228                    .dwattr $C$DW$112, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1229                    .dwattr $C$DW$112, DW_AT_decl_line(0x67)
    1230                    .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1231            $C$DW$113       .dwtag  DW_TAG_member
    1232                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1233                    .dwattr $C$DW$113, DW_AT_name("positiveRefVoltageSourceSelect")
    1234                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    1235                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1236                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1237                    .dwattr $C$DW$113, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1238                    .dwattr $C$DW$113, DW_AT_decl_line(0x6e)
    1239                    .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1240            $C$DW$114       .dwtag  DW_TAG_member
    1241                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1242                    .dwattr $C$DW$114, DW_AT_name("negativeRefVoltageSourceSelect")
    1243                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    1244                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1245                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1246                    .dwattr $C$DW$114, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1247                    .dwattr $C$DW$114, DW_AT_decl_line(0x74)
    1248                    .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1249            $C$DW$115       .dwtag  DW_TAG_member
    1250                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1251                    .dwattr $C$DW$115, DW_AT_name("endOfSequence")
    1252                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("endOfSequence")
    1253                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1254                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1255                    .dwattr $C$DW$115, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1256                    .dwattr $C$DW$115, DW_AT_decl_line(0x7a)
    1257                    .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1258                    .dwendtag $C$DW$T$28
    1259            
    1260                    .dwattr $C$DW$T$28, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1261                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f)
    1262                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1263            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC12_A_configureMemoryParam")
    1264                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    1265                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1266                    .dwattr $C$DW$T$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1267                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x7b)
    1268                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    1269            
    1270            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1271                    .dwattr $C$DW$T$30, DW_AT_name("Calendar")
    1272                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1273            $C$DW$116       .dwtag  DW_TAG_member
    1274                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1275                    .dwattr $C$DW$116, DW_AT_name("Seconds")
    1276                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("Seconds")
    1277                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1279                    .dwattr $C$DW$116, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1280                    .dwattr $C$DW$116, DW_AT_decl_line(0x42)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   27

    1281                    .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1282            $C$DW$117       .dwtag  DW_TAG_member
    1283                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1284                    .dwattr $C$DW$117, DW_AT_name("Minutes")
    1285                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("Minutes")
    1286                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1287                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1288                    .dwattr $C$DW$117, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1289                    .dwattr $C$DW$117, DW_AT_decl_line(0x44)
    1290                    .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1291            $C$DW$118       .dwtag  DW_TAG_member
    1292                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1293                    .dwattr $C$DW$118, DW_AT_name("Hours")
    1294                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("Hours")
    1295                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1296                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1297                    .dwattr $C$DW$118, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1298                    .dwattr $C$DW$118, DW_AT_decl_line(0x46)
    1299                    .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1300            $C$DW$119       .dwtag  DW_TAG_member
    1301                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1302                    .dwattr $C$DW$119, DW_AT_name("DayOfWeek")
    1303                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("DayOfWeek")
    1304                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1305                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1306                    .dwattr $C$DW$119, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1307                    .dwattr $C$DW$119, DW_AT_decl_line(0x48)
    1308                    .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1309            $C$DW$120       .dwtag  DW_TAG_member
    1310                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1311                    .dwattr $C$DW$120, DW_AT_name("DayOfMonth")
    1312                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("DayOfMonth")
    1313                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1314                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1315                    .dwattr $C$DW$120, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1316                    .dwattr $C$DW$120, DW_AT_decl_line(0x4a)
    1317                    .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1318            $C$DW$121       .dwtag  DW_TAG_member
    1319                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1320                    .dwattr $C$DW$121, DW_AT_name("Month")
    1321                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("Month")
    1322                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1323                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1324                    .dwattr $C$DW$121, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1325                    .dwattr $C$DW$121, DW_AT_decl_line(0x4c)
    1326                    .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1327            $C$DW$122       .dwtag  DW_TAG_member
    1328                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$29)
    1329                    .dwattr $C$DW$122, DW_AT_name("Year")
    1330                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("Year")
    1331                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1332                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1333                    .dwattr $C$DW$122, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1334                    .dwattr $C$DW$122, DW_AT_decl_line(0x4e)
    1335                    .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   28

    1336                    .dwendtag $C$DW$T$30
    1337            
    1338                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1339                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
    1340                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1341            $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("Calendar")
    1342                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
    1343                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1344                    .dwattr $C$DW$T$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1345                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x4f)
    1346                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1347            
    1348            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1349                    .dwattr $C$DW$T$31, DW_AT_name("Comp_B_configureReferenceVoltageParam")
    1350                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    1351            $C$DW$123       .dwtag  DW_TAG_member
    1352                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$29)
    1353                    .dwattr $C$DW$123, DW_AT_name("supplyVoltageReferenceBase")
    1354                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
    1355                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1357                    .dwattr $C$DW$123, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1358                    .dwattr $C$DW$123, DW_AT_decl_line(0x8e)
    1359                    .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    1360            $C$DW$124       .dwtag  DW_TAG_member
    1361                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    1362                    .dwattr $C$DW$124, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
    1363                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
    1364                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1365                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1366                    .dwattr $C$DW$124, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1367                    .dwattr $C$DW$124, DW_AT_decl_line(0x91)
    1368                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    1369            $C$DW$125       .dwtag  DW_TAG_member
    1370                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
    1371                    .dwattr $C$DW$125, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
    1372                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
    1373                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1374                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1375                    .dwattr $C$DW$125, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1376                    .dwattr $C$DW$125, DW_AT_decl_line(0x94)
    1377                    .dwattr $C$DW$125, DW_AT_decl_column(0x0e)
    1378            $C$DW$126       .dwtag  DW_TAG_member
    1379                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1380                    .dwattr $C$DW$126, DW_AT_name("referenceAccuracy")
    1381                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("referenceAccuracy")
    1382                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1383                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1384                    .dwattr $C$DW$126, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1385                    .dwattr $C$DW$126, DW_AT_decl_line(0x9a)
    1386                    .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    1387                    .dwendtag $C$DW$T$31
    1388            
    1389                    .dwattr $C$DW$T$31, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1390                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x85)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   29

    1391                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1392            $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_configureReferenceVoltageParam")
    1393                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$31)
    1394                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1395                    .dwattr $C$DW$T$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1396                    .dwattr $C$DW$T$77, DW_AT_decl_line(0x9b)
    1397                    .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1398            
    1399            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1400                    .dwattr $C$DW$T$32, DW_AT_name("Comp_B_initializeParam")
    1401                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    1402            $C$DW$127       .dwtag  DW_TAG_member
    1403                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1404                    .dwattr $C$DW$127, DW_AT_name("positiveTerminalInput")
    1405                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("positiveTerminalInput")
    1406                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1408                    .dwattr $C$DW$127, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1409                    .dwattr $C$DW$127, DW_AT_decl_line(0x53)
    1410                    .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1411            $C$DW$128       .dwtag  DW_TAG_member
    1412                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1413                    .dwattr $C$DW$128, DW_AT_name("negativeTerminalInput")
    1414                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("negativeTerminalInput")
    1415                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1416                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1417                    .dwattr $C$DW$128, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1418                    .dwattr $C$DW$128, DW_AT_decl_line(0x67)
    1419                    .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1420            $C$DW$129       .dwtag  DW_TAG_member
    1421                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    1422                    .dwattr $C$DW$129, DW_AT_name("powerModeSelect")
    1423                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("powerModeSelect")
    1424                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1425                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1426                    .dwattr $C$DW$129, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1427                    .dwattr $C$DW$129, DW_AT_decl_line(0x6d)
    1428                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    1429            $C$DW$130       .dwtag  DW_TAG_member
    1430                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1431                    .dwattr $C$DW$130, DW_AT_name("outputFilterEnableAndDelayLevel")
    1432                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
    1433                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1434                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1435                    .dwattr $C$DW$130, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1436                    .dwattr $C$DW$130, DW_AT_decl_line(0x77)
    1437                    .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1438            $C$DW$131       .dwtag  DW_TAG_member
    1439                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$29)
    1440                    .dwattr $C$DW$131, DW_AT_name("invertedOutputPolarity")
    1441                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("invertedOutputPolarity")
    1442                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1443                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1444                    .dwattr $C$DW$131, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1445                    .dwattr $C$DW$131, DW_AT_decl_line(0x7c)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   30

    1446                    .dwattr $C$DW$131, DW_AT_decl_column(0x0e)
    1447                    .dwendtag $C$DW$T$32
    1448            
    1449                    .dwattr $C$DW$T$32, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1450                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x3e)
    1451                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1452            $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_initializeParam")
    1453                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$32)
    1454                    .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1455                    .dwattr $C$DW$T$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1456                    .dwattr $C$DW$T$78, DW_AT_decl_line(0x7d)
    1457                    .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1458            
    1459            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1460                    .dwattr $C$DW$T$33, DW_AT_name("DMA_initializeParam")
    1461                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1462            $C$DW$132       .dwtag  DW_TAG_member
    1463                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1464                    .dwattr $C$DW$132, DW_AT_name("channelSelect")
    1465                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("channelSelect")
    1466                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1468                    .dwattr $C$DW$132, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1469                    .dwattr $C$DW$132, DW_AT_decl_line(0x4a)
    1470                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1471            $C$DW$133       .dwtag  DW_TAG_member
    1472                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
    1473                    .dwattr $C$DW$133, DW_AT_name("transferModeSelect")
    1474                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("transferModeSelect")
    1475                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1476                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1477                    .dwattr $C$DW$133, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1478                    .dwattr $C$DW$133, DW_AT_decl_line(0x53)
    1479                    .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    1480            $C$DW$134       .dwtag  DW_TAG_member
    1481                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    1482                    .dwattr $C$DW$134, DW_AT_name("transferSize")
    1483                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("transferSize")
    1484                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1485                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1486                    .dwattr $C$DW$134, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1487                    .dwattr $C$DW$134, DW_AT_decl_line(0x57)
    1488                    .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    1489            $C$DW$135       .dwtag  DW_TAG_member
    1490                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1491                    .dwattr $C$DW$135, DW_AT_name("triggerSourceSelect")
    1492                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("triggerSourceSelect")
    1493                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1494                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1495                    .dwattr $C$DW$135, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1496                    .dwattr $C$DW$135, DW_AT_decl_line(0x7b)
    1497                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1498            $C$DW$136       .dwtag  DW_TAG_member
    1499                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1500                    .dwattr $C$DW$136, DW_AT_name("transferUnitSelect")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   31

    1501                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("transferUnitSelect")
    1502                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1503                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1504                    .dwattr $C$DW$136, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1505                    .dwattr $C$DW$136, DW_AT_decl_line(0x82)
    1506                    .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1507            $C$DW$137       .dwtag  DW_TAG_member
    1508                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1509                    .dwattr $C$DW$137, DW_AT_name("triggerTypeSelect")
    1510                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("triggerTypeSelect")
    1511                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1512                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1513                    .dwattr $C$DW$137, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1514                    .dwattr $C$DW$137, DW_AT_decl_line(0x88)
    1515                    .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1516                    .dwendtag $C$DW$T$33
    1517            
    1518                    .dwattr $C$DW$T$33, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1519                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x3e)
    1520                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1521            $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("DMA_initializeParam")
    1522                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$33)
    1523                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1524                    .dwattr $C$DW$T$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1525                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x89)
    1526                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1527            
    1528            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1529                    .dwattr $C$DW$T$34, DW_AT_name("PMAP_initPortsParam")
    1530                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1531            $C$DW$138       .dwtag  DW_TAG_member
    1532                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1533                    .dwattr $C$DW$138, DW_AT_name("portMapping")
    1534                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("portMapping")
    1535                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1537                    .dwattr $C$DW$138, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1538                    .dwattr $C$DW$138, DW_AT_decl_line(0x41)
    1539                    .dwattr $C$DW$138, DW_AT_decl_column(0x14)
    1540            $C$DW$139       .dwtag  DW_TAG_member
    1541                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$22)
    1542                    .dwattr $C$DW$139, DW_AT_name("PxMAPy")
    1543                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("PxMAPy")
    1544                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1545                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1546                    .dwattr $C$DW$139, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1547                    .dwattr $C$DW$139, DW_AT_decl_line(0x43)
    1548                    .dwattr $C$DW$139, DW_AT_decl_column(0x0e)
    1549            $C$DW$140       .dwtag  DW_TAG_member
    1550                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1551                    .dwattr $C$DW$140, DW_AT_name("numberOfPorts")
    1552                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("numberOfPorts")
    1553                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1554                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1555                    .dwattr $C$DW$140, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   32

    1556                    .dwattr $C$DW$140, DW_AT_decl_line(0x45)
    1557                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1558            $C$DW$141       .dwtag  DW_TAG_member
    1559                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1560                    .dwattr $C$DW$141, DW_AT_name("portMapReconfigure")
    1561                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("portMapReconfigure")
    1562                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1563                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1564                    .dwattr $C$DW$141, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1565                    .dwattr $C$DW$141, DW_AT_decl_line(0x4a)
    1566                    .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    1567                    .dwendtag $C$DW$T$34
    1568            
    1569                    .dwattr $C$DW$T$34, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1570                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e)
    1571                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1572            $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("PMAP_initPortsParam")
    1573                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    1574                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1575                    .dwattr $C$DW$T$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1576                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x4b)
    1577                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    1578            
    1579            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1580                    .dwattr $C$DW$T$35, DW_AT_name("RTC_B_configureCalendarAlarmParam")
    1581                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1582            $C$DW$142       .dwtag  DW_TAG_member
    1583                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1584                    .dwattr $C$DW$142, DW_AT_name("minutesAlarm")
    1585                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("minutesAlarm")
    1586                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1588                    .dwattr $C$DW$142, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1589                    .dwattr $C$DW$142, DW_AT_decl_line(0x5c)
    1590                    .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1591            $C$DW$143       .dwtag  DW_TAG_member
    1592                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1593                    .dwattr $C$DW$143, DW_AT_name("hoursAlarm")
    1594                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("hoursAlarm")
    1595                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1596                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1597                    .dwattr $C$DW$143, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1598                    .dwattr $C$DW$143, DW_AT_decl_line(0x60)
    1599                    .dwattr $C$DW$143, DW_AT_decl_column(0x0d)
    1600            $C$DW$144       .dwtag  DW_TAG_member
    1601                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1602                    .dwattr $C$DW$144, DW_AT_name("dayOfWeekAlarm")
    1603                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("dayOfWeekAlarm")
    1604                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1605                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1606                    .dwattr $C$DW$144, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1607                    .dwattr $C$DW$144, DW_AT_decl_line(0x64)
    1608                    .dwattr $C$DW$144, DW_AT_decl_column(0x0d)
    1609            $C$DW$145       .dwtag  DW_TAG_member
    1610                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   33

    1611                    .dwattr $C$DW$145, DW_AT_name("dayOfMonthAlarm")
    1612                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("dayOfMonthAlarm")
    1613                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1614                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1615                    .dwattr $C$DW$145, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1616                    .dwattr $C$DW$145, DW_AT_decl_line(0x68)
    1617                    .dwattr $C$DW$145, DW_AT_decl_column(0x0d)
    1618                    .dwendtag $C$DW$T$35
    1619            
    1620                    .dwattr $C$DW$T$35, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1621                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x57)
    1622                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1623            $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("RTC_B_configureCalendarAlarmParam")
    1624                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    1625                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1626                    .dwattr $C$DW$T$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1627                    .dwattr $C$DW$T$81, DW_AT_decl_line(0x69)
    1628                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    1629            
    1630            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1631                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initCaptureModeParam")
    1632                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1633            $C$DW$146       .dwtag  DW_TAG_member
    1634                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
    1635                    .dwattr $C$DW$146, DW_AT_name("captureRegister")
    1636                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("captureRegister")
    1637                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1639                    .dwattr $C$DW$146, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1640                    .dwattr $C$DW$146, DW_AT_decl_line(0x89)
    1641                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    1642            $C$DW$147       .dwtag  DW_TAG_member
    1643                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    1644                    .dwattr $C$DW$147, DW_AT_name("captureMode")
    1645                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("captureMode")
    1646                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1647                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1648                    .dwattr $C$DW$147, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1649                    .dwattr $C$DW$147, DW_AT_decl_line(0x90)
    1650                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    1651            $C$DW$148       .dwtag  DW_TAG_member
    1652                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1653                    .dwattr $C$DW$148, DW_AT_name("captureInputSelect")
    1654                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureInputSelect")
    1655                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1656                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1657                    .dwattr $C$DW$148, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1658                    .dwattr $C$DW$148, DW_AT_decl_line(0x97)
    1659                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    1660            $C$DW$149       .dwtag  DW_TAG_member
    1661                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    1662                    .dwattr $C$DW$149, DW_AT_name("synchronizeCaptureSource")
    1663                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1664                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1665                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   34

    1666                    .dwattr $C$DW$149, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1667                    .dwattr $C$DW$149, DW_AT_decl_line(0x9c)
    1668                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    1669            $C$DW$150       .dwtag  DW_TAG_member
    1670                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    1671                    .dwattr $C$DW$150, DW_AT_name("captureInterruptEnable")
    1672                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("captureInterruptEnable")
    1673                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1674                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1675                    .dwattr $C$DW$150, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1676                    .dwattr $C$DW$150, DW_AT_decl_line(0xa1)
    1677                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    1678            $C$DW$151       .dwtag  DW_TAG_member
    1679                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$29)
    1680                    .dwattr $C$DW$151, DW_AT_name("captureOutputMode")
    1681                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("captureOutputMode")
    1682                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1683                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1684                    .dwattr $C$DW$151, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1685                    .dwattr $C$DW$151, DW_AT_decl_line(0xac)
    1686                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    1687                    .dwendtag $C$DW$T$36
    1688            
    1689                    .dwattr $C$DW$T$36, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1690                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x7d)
    1691                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1692            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCaptureModeParam")
    1693                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    1694                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1695                    .dwattr $C$DW$T$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1696                    .dwattr $C$DW$T$82, DW_AT_decl_line(0xad)
    1697                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1698            
    1699            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1700                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_initCompareModeParam")
    1701                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    1702            $C$DW$152       .dwtag  DW_TAG_member
    1703                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$29)
    1704                    .dwattr $C$DW$152, DW_AT_name("compareRegister")
    1705                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("compareRegister")
    1706                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1708                    .dwattr $C$DW$152, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1709                    .dwattr $C$DW$152, DW_AT_decl_line(0x17a)
    1710                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    1711            $C$DW$153       .dwtag  DW_TAG_member
    1712                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$29)
    1713                    .dwattr $C$DW$153, DW_AT_name("compareInterruptEnable")
    1714                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("compareInterruptEnable")
    1715                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1716                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1717                    .dwattr $C$DW$153, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1718                    .dwattr $C$DW$153, DW_AT_decl_line(0x17f)
    1719                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    1720            $C$DW$154       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   35

    1721                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$29)
    1722                    .dwattr $C$DW$154, DW_AT_name("compareOutputMode")
    1723                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("compareOutputMode")
    1724                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1725                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1726                    .dwattr $C$DW$154, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1727                    .dwattr $C$DW$154, DW_AT_decl_line(0x18a)
    1728                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    1729            $C$DW$155       .dwtag  DW_TAG_member
    1730                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$29)
    1731                    .dwattr $C$DW$155, DW_AT_name("compareValue")
    1732                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("compareValue")
    1733                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1734                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1735                    .dwattr $C$DW$155, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1736                    .dwattr $C$DW$155, DW_AT_decl_line(0x18c)
    1737                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    1738                    .dwendtag $C$DW$T$37
    1739            
    1740                    .dwattr $C$DW$T$37, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1741                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x16e)
    1742                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1743            $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCompareModeParam")
    1744                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$37)
    1745                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1746                    .dwattr $C$DW$T$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1747                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x18d)
    1748                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1749            
    1750            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1751                    .dwattr $C$DW$T$39, DW_AT_name("Timer_A_initContinuousModeParam")
    1752                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1753            $C$DW$156       .dwtag  DW_TAG_member
    1754                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$29)
    1755                    .dwattr $C$DW$156, DW_AT_name("clockSource")
    1756                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("clockSource")
    1757                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1759                    .dwattr $C$DW$156, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1760                    .dwattr $C$DW$156, DW_AT_decl_line(0x50)
    1761                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    1762            $C$DW$157       .dwtag  DW_TAG_member
    1763                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$29)
    1764                    .dwattr $C$DW$157, DW_AT_name("clockSourceDivider")
    1765                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("clockSourceDivider")
    1766                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1767                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1768                    .dwattr $C$DW$157, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1769                    .dwattr $C$DW$157, DW_AT_decl_line(0x67)
    1770                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    1771            $C$DW$158       .dwtag  DW_TAG_member
    1772                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$29)
    1773                    .dwattr $C$DW$158, DW_AT_name("timerInterruptEnable_TAIE")
    1774                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1775                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   36

    1776                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1777                    .dwattr $C$DW$158, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1778                    .dwattr $C$DW$158, DW_AT_decl_line(0x6c)
    1779                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    1780            $C$DW$159       .dwtag  DW_TAG_member
    1781                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$29)
    1782                    .dwattr $C$DW$159, DW_AT_name("timerClear")
    1783                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("timerClear")
    1784                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1785                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1786                    .dwattr $C$DW$159, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1787                    .dwattr $C$DW$159, DW_AT_decl_line(0x72)
    1788                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1789            $C$DW$160       .dwtag  DW_TAG_member
    1790                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
    1791                    .dwattr $C$DW$160, DW_AT_name("startTimer")
    1792                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("startTimer")
    1793                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1794                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1795                    .dwattr $C$DW$160, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1796                    .dwattr $C$DW$160, DW_AT_decl_line(0x74)
    1797                    .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    1798                    .dwendtag $C$DW$T$39
    1799            
    1800                    .dwattr $C$DW$T$39, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1801                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x48)
    1802                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1803            $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initContinuousModeParam")
    1804                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$39)
    1805                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1806                    .dwattr $C$DW$T$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1807                    .dwattr $C$DW$T$84, DW_AT_decl_line(0x75)
    1808                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1809            
    1810            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1811                    .dwattr $C$DW$T$40, DW_AT_name("Timer_A_initUpDownModeParam")
    1812                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    1813            $C$DW$161       .dwtag  DW_TAG_member
    1814                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    1815                    .dwattr $C$DW$161, DW_AT_name("clockSource")
    1816                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("clockSource")
    1817                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1819                    .dwattr $C$DW$161, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1820                    .dwattr $C$DW$161, DW_AT_decl_line(0xbd)
    1821                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1822            $C$DW$162       .dwtag  DW_TAG_member
    1823                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$29)
    1824                    .dwattr $C$DW$162, DW_AT_name("clockSourceDivider")
    1825                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("clockSourceDivider")
    1826                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1827                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1828                    .dwattr $C$DW$162, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1829                    .dwattr $C$DW$162, DW_AT_decl_line(0xd4)
    1830                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   37

    1831            $C$DW$163       .dwtag  DW_TAG_member
    1832                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$29)
    1833                    .dwattr $C$DW$163, DW_AT_name("timerPeriod")
    1834                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("timerPeriod")
    1835                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1836                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1837                    .dwattr $C$DW$163, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1838                    .dwattr $C$DW$163, DW_AT_decl_line(0xd6)
    1839                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1840            $C$DW$164       .dwtag  DW_TAG_member
    1841                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$29)
    1842                    .dwattr $C$DW$164, DW_AT_name("timerInterruptEnable_TAIE")
    1843                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1844                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1845                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1846                    .dwattr $C$DW$164, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1847                    .dwattr $C$DW$164, DW_AT_decl_line(0xdb)
    1848                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1849            $C$DW$165       .dwtag  DW_TAG_member
    1850                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$29)
    1851                    .dwattr $C$DW$165, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1852                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1853                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1854                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1855                    .dwattr $C$DW$165, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1856                    .dwattr $C$DW$165, DW_AT_decl_line(0xe0)
    1857                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1858            $C$DW$166       .dwtag  DW_TAG_member
    1859                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$29)
    1860                    .dwattr $C$DW$166, DW_AT_name("timerClear")
    1861                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("timerClear")
    1862                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1863                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1864                    .dwattr $C$DW$166, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1865                    .dwattr $C$DW$166, DW_AT_decl_line(0xe6)
    1866                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1867            $C$DW$167       .dwtag  DW_TAG_member
    1868                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$38)
    1869                    .dwattr $C$DW$167, DW_AT_name("startTimer")
    1870                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("startTimer")
    1871                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1872                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1873                    .dwattr $C$DW$167, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1874                    .dwattr $C$DW$167, DW_AT_decl_line(0xe8)
    1875                    .dwattr $C$DW$167, DW_AT_decl_column(0x0a)
    1876                    .dwendtag $C$DW$T$40
    1877            
    1878                    .dwattr $C$DW$T$40, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1879                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xb5)
    1880                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1881            $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpDownModeParam")
    1882                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$40)
    1883                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1884                    .dwattr $C$DW$T$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1885                    .dwattr $C$DW$T$85, DW_AT_decl_line(0xe9)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   38

    1886                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1887            
    1888            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1889                    .dwattr $C$DW$T$41, DW_AT_name("Timer_A_initUpModeParam")
    1890                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
    1891            $C$DW$168       .dwtag  DW_TAG_member
    1892                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
    1893                    .dwattr $C$DW$168, DW_AT_name("clockSource")
    1894                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("clockSource")
    1895                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1897                    .dwattr $C$DW$168, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1898                    .dwattr $C$DW$168, DW_AT_decl_line(0x139)
    1899                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    1900            $C$DW$169       .dwtag  DW_TAG_member
    1901                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$29)
    1902                    .dwattr $C$DW$169, DW_AT_name("clockSourceDivider")
    1903                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSourceDivider")
    1904                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1905                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1906                    .dwattr $C$DW$169, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1907                    .dwattr $C$DW$169, DW_AT_decl_line(0x150)
    1908                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1909            $C$DW$170       .dwtag  DW_TAG_member
    1910                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$29)
    1911                    .dwattr $C$DW$170, DW_AT_name("timerPeriod")
    1912                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("timerPeriod")
    1913                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1914                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1915                    .dwattr $C$DW$170, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1916                    .dwattr $C$DW$170, DW_AT_decl_line(0x153)
    1917                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1918            $C$DW$171       .dwtag  DW_TAG_member
    1919                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$29)
    1920                    .dwattr $C$DW$171, DW_AT_name("timerInterruptEnable_TAIE")
    1921                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1922                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1923                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1924                    .dwattr $C$DW$171, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1925                    .dwattr $C$DW$171, DW_AT_decl_line(0x158)
    1926                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1927            $C$DW$172       .dwtag  DW_TAG_member
    1928                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$29)
    1929                    .dwattr $C$DW$172, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1930                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1931                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1932                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1933                    .dwattr $C$DW$172, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1934                    .dwattr $C$DW$172, DW_AT_decl_line(0x15d)
    1935                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1936            $C$DW$173       .dwtag  DW_TAG_member
    1937                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$29)
    1938                    .dwattr $C$DW$173, DW_AT_name("timerClear")
    1939                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("timerClear")
    1940                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   39

    1941                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1942                    .dwattr $C$DW$173, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1943                    .dwattr $C$DW$173, DW_AT_decl_line(0x163)
    1944                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1945            $C$DW$174       .dwtag  DW_TAG_member
    1946                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$38)
    1947                    .dwattr $C$DW$174, DW_AT_name("startTimer")
    1948                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("startTimer")
    1949                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1950                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1951                    .dwattr $C$DW$174, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1952                    .dwattr $C$DW$174, DW_AT_decl_line(0x165)
    1953                    .dwattr $C$DW$174, DW_AT_decl_column(0x0a)
    1954                    .dwendtag $C$DW$T$41
    1955            
    1956                    .dwattr $C$DW$T$41, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1957                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x131)
    1958                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1959            $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpModeParam")
    1960                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$41)
    1961                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1962                    .dwattr $C$DW$T$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1963                    .dwattr $C$DW$T$86, DW_AT_decl_line(0x166)
    1964                    .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1965            
    1966            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1967                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    1968                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1969            $C$DW$175       .dwtag  DW_TAG_member
    1970                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$29)
    1971                    .dwattr $C$DW$175, DW_AT_name("clockSource")
    1972                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("clockSource")
    1973                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1975                    .dwattr $C$DW$175, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1976                    .dwattr $C$DW$175, DW_AT_decl_line(0xf8)
    1977                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    1978            $C$DW$176       .dwtag  DW_TAG_member
    1979                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$29)
    1980                    .dwattr $C$DW$176, DW_AT_name("clockSourceDivider")
    1981                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("clockSourceDivider")
    1982                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1983                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1984                    .dwattr $C$DW$176, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1985                    .dwattr $C$DW$176, DW_AT_decl_line(0x10f)
    1986                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1987            $C$DW$177       .dwtag  DW_TAG_member
    1988                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$29)
    1989                    .dwattr $C$DW$177, DW_AT_name("timerPeriod")
    1990                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("timerPeriod")
    1991                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1992                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1993                    .dwattr $C$DW$177, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1994                    .dwattr $C$DW$177, DW_AT_decl_line(0x111)
    1995                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   40

    1996            $C$DW$178       .dwtag  DW_TAG_member
    1997                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$29)
    1998                    .dwattr $C$DW$178, DW_AT_name("compareRegister")
    1999                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("compareRegister")
    2000                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2001                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2002                    .dwattr $C$DW$178, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2003                    .dwattr $C$DW$178, DW_AT_decl_line(0x11c)
    2004                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2005            $C$DW$179       .dwtag  DW_TAG_member
    2006                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$29)
    2007                    .dwattr $C$DW$179, DW_AT_name("compareOutputMode")
    2008                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("compareOutputMode")
    2009                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2010                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2011                    .dwattr $C$DW$179, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2012                    .dwattr $C$DW$179, DW_AT_decl_line(0x127)
    2013                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2014            $C$DW$180       .dwtag  DW_TAG_member
    2015                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    2016                    .dwattr $C$DW$180, DW_AT_name("dutyCycle")
    2017                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("dutyCycle")
    2018                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2019                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2020                    .dwattr $C$DW$180, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2021                    .dwattr $C$DW$180, DW_AT_decl_line(0x129)
    2022                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2023                    .dwendtag $C$DW$T$42
    2024            
    2025                    .dwattr $C$DW$T$42, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2026                    .dwattr $C$DW$T$42, DW_AT_decl_line(0xf0)
    2027                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2028            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_outputPWMParam")
    2029                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$42)
    2030                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2031                    .dwattr $C$DW$T$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2032                    .dwattr $C$DW$T$87, DW_AT_decl_line(0x12a)
    2033                    .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2034            
    2035            $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2036                    .dwattr $C$DW$T$43, DW_AT_name("Timer_B_initCaptureModeParam")
    2037                    .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    2038            $C$DW$181       .dwtag  DW_TAG_member
    2039                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
    2040                    .dwattr $C$DW$181, DW_AT_name("captureRegister")
    2041                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("captureRegister")
    2042                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2044                    .dwattr $C$DW$181, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2045                    .dwattr $C$DW$181, DW_AT_decl_line(0xd1)
    2046                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    2047            $C$DW$182       .dwtag  DW_TAG_member
    2048                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$29)
    2049                    .dwattr $C$DW$182, DW_AT_name("captureMode")
    2050                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("captureMode")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   41

    2051                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2052                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2053                    .dwattr $C$DW$182, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2054                    .dwattr $C$DW$182, DW_AT_decl_line(0xd8)
    2055                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    2056            $C$DW$183       .dwtag  DW_TAG_member
    2057                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$29)
    2058                    .dwattr $C$DW$183, DW_AT_name("captureInputSelect")
    2059                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("captureInputSelect")
    2060                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2061                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2062                    .dwattr $C$DW$183, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2063                    .dwattr $C$DW$183, DW_AT_decl_line(0xdf)
    2064                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2065            $C$DW$184       .dwtag  DW_TAG_member
    2066                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$29)
    2067                    .dwattr $C$DW$184, DW_AT_name("synchronizeCaptureSource")
    2068                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2069                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2070                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2071                    .dwattr $C$DW$184, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2072                    .dwattr $C$DW$184, DW_AT_decl_line(0xe4)
    2073                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    2074            $C$DW$185       .dwtag  DW_TAG_member
    2075                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$29)
    2076                    .dwattr $C$DW$185, DW_AT_name("captureInterruptEnable")
    2077                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("captureInterruptEnable")
    2078                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2079                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2080                    .dwattr $C$DW$185, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2081                    .dwattr $C$DW$185, DW_AT_decl_line(0xe9)
    2082                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    2083            $C$DW$186       .dwtag  DW_TAG_member
    2084                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
    2085                    .dwattr $C$DW$186, DW_AT_name("captureOutputMode")
    2086                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("captureOutputMode")
    2087                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2088                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2089                    .dwattr $C$DW$186, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2090                    .dwattr $C$DW$186, DW_AT_decl_line(0xf4)
    2091                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    2092                    .dwendtag $C$DW$T$43
    2093            
    2094                    .dwattr $C$DW$T$43, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2095                    .dwattr $C$DW$T$43, DW_AT_decl_line(0xc5)
    2096                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    2097            $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCaptureModeParam")
    2098                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$43)
    2099                    .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2100                    .dwattr $C$DW$T$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2101                    .dwattr $C$DW$T$88, DW_AT_decl_line(0xf5)
    2102                    .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    2103            
    2104            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2105                    .dwattr $C$DW$T$44, DW_AT_name("Timer_B_initCompareModeParam")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   42

    2106                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    2107            $C$DW$187       .dwtag  DW_TAG_member
    2108                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$29)
    2109                    .dwattr $C$DW$187, DW_AT_name("compareRegister")
    2110                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("compareRegister")
    2111                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2112                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2113                    .dwattr $C$DW$187, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2114                    .dwattr $C$DW$187, DW_AT_decl_line(0x17a)
    2115                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2116            $C$DW$188       .dwtag  DW_TAG_member
    2117                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$29)
    2118                    .dwattr $C$DW$188, DW_AT_name("compareInterruptEnable")
    2119                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("compareInterruptEnable")
    2120                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2121                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2122                    .dwattr $C$DW$188, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2123                    .dwattr $C$DW$188, DW_AT_decl_line(0x17f)
    2124                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2125            $C$DW$189       .dwtag  DW_TAG_member
    2126                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$29)
    2127                    .dwattr $C$DW$189, DW_AT_name("compareOutputMode")
    2128                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("compareOutputMode")
    2129                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2130                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2131                    .dwattr $C$DW$189, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2132                    .dwattr $C$DW$189, DW_AT_decl_line(0x18a)
    2133                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2134            $C$DW$190       .dwtag  DW_TAG_member
    2135                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$29)
    2136                    .dwattr $C$DW$190, DW_AT_name("compareValue")
    2137                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("compareValue")
    2138                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2139                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2140                    .dwattr $C$DW$190, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2141                    .dwattr $C$DW$190, DW_AT_decl_line(0x18c)
    2142                    .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2143                    .dwendtag $C$DW$T$44
    2144            
    2145                    .dwattr $C$DW$T$44, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2146                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x16e)
    2147                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    2148            $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCompareModeParam")
    2149                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$44)
    2150                    .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2151                    .dwattr $C$DW$T$89, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2152                    .dwattr $C$DW$T$89, DW_AT_decl_line(0x18d)
    2153                    .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2154            
    2155            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2156                    .dwattr $C$DW$T$45, DW_AT_name("Timer_B_initContinuousModeParam")
    2157                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    2158            $C$DW$191       .dwtag  DW_TAG_member
    2159                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$29)
    2160                    .dwattr $C$DW$191, DW_AT_name("clockSource")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   43

    2161                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("clockSource")
    2162                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2164                    .dwattr $C$DW$191, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2165                    .dwattr $C$DW$191, DW_AT_decl_line(0x105)
    2166                    .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2167            $C$DW$192       .dwtag  DW_TAG_member
    2168                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
    2169                    .dwattr $C$DW$192, DW_AT_name("clockSourceDivider")
    2170                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("clockSourceDivider")
    2171                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2172                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2173                    .dwattr $C$DW$192, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2174                    .dwattr $C$DW$192, DW_AT_decl_line(0x11c)
    2175                    .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    2176            $C$DW$193       .dwtag  DW_TAG_member
    2177                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$29)
    2178                    .dwattr $C$DW$193, DW_AT_name("timerInterruptEnable_TBIE")
    2179                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2180                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2181                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2182                    .dwattr $C$DW$193, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2183                    .dwattr $C$DW$193, DW_AT_decl_line(0x121)
    2184                    .dwattr $C$DW$193, DW_AT_decl_column(0x0e)
    2185            $C$DW$194       .dwtag  DW_TAG_member
    2186                    .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
    2187                    .dwattr $C$DW$194, DW_AT_name("timerClear")
    2188                    .dwattr $C$DW$194, DW_AT_TI_symbol_name("timerClear")
    2189                    .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2190                    .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2191                    .dwattr $C$DW$194, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2192                    .dwattr $C$DW$194, DW_AT_decl_line(0x127)
    2193                    .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2194            $C$DW$195       .dwtag  DW_TAG_member
    2195                    .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$38)
    2196                    .dwattr $C$DW$195, DW_AT_name("startTimer")
    2197                    .dwattr $C$DW$195, DW_AT_TI_symbol_name("startTimer")
    2198                    .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2199                    .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
