MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 11:28:30 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../hw_layer.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__disable_interrupt")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("__disable_interrupt")
      15                    .dwattr $C$DW$1, DW_AT_declaration
      16                    .dwattr $C$DW$1, DW_AT_external

     958                    .global BAKCTL
     959                    .global FCTL1
     960                    .global FCTL3
     961                    .global PMAPKEYID
     962                    .global PMAPCTL
     963                    .global SFRIFG1
     964                    .global UCSCTL6
     965                    .global UCSCTL7
     966                    .global UCA0CTLW0_L
     967                    .global UCA0TXBUF
     968                    .global UCA0ICTL_L
     969                    .global UCA0ICTL_H
     970                    .global memcpy
     971            ;*****************************************************************************
     972            ;* SECTION GROUPS                                                            *
     973            ;*****************************************************************************
     974                    .group    "flash_erase", 1
     975                    .gmember  ".text:flash_erase"
     976                    .endgroup
     977            
     978            
     979            ;******************************************************************************
     980            ;* BUILD ATTRIBUTES                                                           *
     981            ;******************************************************************************
     982                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     983                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
     984                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     985                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     986                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     987                    .battr "mspabi", Tag_File, 1, Tag_enum_size(2)
     988            
     989            ;******************************************************************************
     990            ;* TYPE INFORMATION                                                           *
     991            ;******************************************************************************
     992            
     993            $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
     994                    .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
     995            $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_NONE"), DW_AT_const_value(0x00)
     996                    .dwattr $C$DW$89, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     997                    .dwattr $C$DW$89, DW_AT_decl_line(0x1c)
     998                    .dwattr $C$DW$89, DW_AT_decl_column(0x05)
     999            $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_DOWNLOAD"), DW_AT_const_value(0x01)
    1000                    .dwattr $C$DW$90, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1001                    .dwattr $C$DW$90, DW_AT_decl_line(0x1d)
    1002                    .dwattr $C$DW$90, DW_AT_decl_column(0x05)
    1003            $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_PENDING_VALIDATION"), DW_AT_const_valu
    1004                    .dwattr $C$DW$91, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1005                    .dwattr $C$DW$91, DW_AT_decl_line(0x1e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   22

    1006                    .dwattr $C$DW$91, DW_AT_decl_column(0x05)
    1007            $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_VALIDATED"), DW_AT_const_value(0x03)
    1008                    .dwattr $C$DW$92, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1009                    .dwattr $C$DW$92, DW_AT_decl_line(0x1f)
    1010                    .dwattr $C$DW$92, DW_AT_decl_column(0x05)
    1011            $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_RECOVERED"), DW_AT_const_value(0x04)
    1012                    .dwattr $C$DW$93, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1013                    .dwattr $C$DW$93, DW_AT_decl_line(0x20)
    1014                    .dwattr $C$DW$93, DW_AT_decl_column(0x05)
    1015            $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_FLASHING_ERROR"), DW_AT_const_value(0x
    1016                    .dwattr $C$DW$94, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1017                    .dwattr $C$DW$94, DW_AT_decl_line(0x21)
    1018                    .dwattr $C$DW$94, DW_AT_decl_column(0x05)
    1019                    .dwendtag $C$DW$T$67
    1020            
    1021                    .dwattr $C$DW$T$67, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1022                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x1b)
    1023                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
    1024            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("bl_image_status_t")
    1025                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1026                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1027                    .dwattr $C$DW$T$68, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
    1028                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x22)
    1029                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1030            
    1031            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1032                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    1033            $C$DW$95        .dwtag  DW_TAG_member
    1034                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1035                    .dwattr $C$DW$95, DW_AT_name("base_ptr")
    1036                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("base_ptr")
    1037                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1039                    .dwattr $C$DW$95, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1040                    .dwattr $C$DW$95, DW_AT_decl_line(0x15)
    1041                    .dwattr $C$DW$95, DW_AT_decl_column(0x14)
    1042            $C$DW$96        .dwtag  DW_TAG_member
    1043                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
    1044                    .dwattr $C$DW$96, DW_AT_name("start_ptr")
    1045                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("start_ptr")
    1046                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1047                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1048                    .dwattr $C$DW$96, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1049                    .dwattr $C$DW$96, DW_AT_decl_line(0x16)
    1050                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1051            $C$DW$97        .dwtag  DW_TAG_member
    1052                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$23)
    1053                    .dwattr $C$DW$97, DW_AT_name("max_len")
    1054                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("max_len")
    1055                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1056                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1057                    .dwattr $C$DW$97, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1058                    .dwattr $C$DW$97, DW_AT_decl_line(0x17)
    1059                    .dwattr $C$DW$97, DW_AT_decl_column(0x18)
    1060            $C$DW$98        .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   23

    1061                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1062                    .dwattr $C$DW$98, DW_AT_name("len")
    1063                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("len")
    1064                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1065                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1066                    .dwattr $C$DW$98, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1067                    .dwattr $C$DW$98, DW_AT_decl_line(0x18)
    1068                    .dwattr $C$DW$98, DW_AT_decl_column(0x12)
    1069                    .dwendtag $C$DW$T$24
    1070            
    1071                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1072                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
    1073                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1074            $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
    1075                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
    1076                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1077                    .dwattr $C$DW$T$69, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1078                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x19)
    1079                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    1080            $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    1081                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    1082                    .dwattr $C$DW$T$70, DW_AT_address_class(0x14)
    1083            $C$DW$99        .dwtag  DW_TAG_TI_far_type
    1084                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$69)
    1085            $C$DW$T$71      .dwtag  DW_TAG_const_type
    1086                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$99)
    1087            
    1088            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1089                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1090            $C$DW$100       .dwtag  DW_TAG_member
    1091                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$10)
    1092                    .dwattr $C$DW$100, DW_AT_name("quot")
    1093                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("quot")
    1094                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1096                    .dwattr $C$DW$100, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1097                    .dwattr $C$DW$100, DW_AT_decl_line(0x46)
    1098                    .dwattr $C$DW$100, DW_AT_decl_column(0x16)
    1099            $C$DW$101       .dwtag  DW_TAG_member
    1100                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$10)
    1101                    .dwattr $C$DW$101, DW_AT_name("rem")
    1102                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("rem")
    1103                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1104                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1105                    .dwattr $C$DW$101, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1106                    .dwattr $C$DW$101, DW_AT_decl_line(0x46)
    1107                    .dwattr $C$DW$101, DW_AT_decl_column(0x1c)
    1108                    .dwendtag $C$DW$T$25
    1109            
    1110                    .dwattr $C$DW$T$25, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1111                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
    1112                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1113            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1114                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
    1115                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   24

    1116                    .dwattr $C$DW$T$72, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1117                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x46)
    1118                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x23)
    1119            
    1120            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1121                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1122            $C$DW$102       .dwtag  DW_TAG_member
    1123                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$12)
    1124                    .dwattr $C$DW$102, DW_AT_name("quot")
    1125                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("quot")
    1126                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1128                    .dwattr $C$DW$102, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1129                    .dwattr $C$DW$102, DW_AT_decl_line(0x48)
    1130                    .dwattr $C$DW$102, DW_AT_decl_column(0x17)
    1131            $C$DW$103       .dwtag  DW_TAG_member
    1132                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$12)
    1133                    .dwattr $C$DW$103, DW_AT_name("rem")
    1134                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("rem")
    1135                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1136                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1137                    .dwattr $C$DW$103, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1138                    .dwattr $C$DW$103, DW_AT_decl_line(0x48)
    1139                    .dwattr $C$DW$103, DW_AT_decl_column(0x1d)
    1140                    .dwendtag $C$DW$T$26
    1141            
    1142                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1143                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
    1144                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1145            $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1146                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$26)
    1147                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1148                    .dwattr $C$DW$T$73, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1149                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x48)
    1150                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x24)
    1151            
    1152            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1153                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    1154            $C$DW$104       .dwtag  DW_TAG_member
    1155                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$14)
    1156                    .dwattr $C$DW$104, DW_AT_name("quot")
    1157                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("quot")
    1158                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1160                    .dwattr $C$DW$104, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1161                    .dwattr $C$DW$104, DW_AT_decl_line(0x4b)
    1162                    .dwattr $C$DW$104, DW_AT_decl_column(0x1c)
    1163            $C$DW$105       .dwtag  DW_TAG_member
    1164                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$14)
    1165                    .dwattr $C$DW$105, DW_AT_name("rem")
    1166                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("rem")
    1167                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1168                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1169                    .dwattr $C$DW$105, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    1170                    .dwattr $C$DW$105, DW_AT_decl_line(0x4b)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   25

    1171                    .dwattr $C$DW$105, DW_AT_decl_column(0x22)
    1172                    .dwendtag $C$DW$T$27
    1173            
    1174                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1175                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x4b)
    1176                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1177            $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1178                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$27)
    1179                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1180                    .dwattr $C$DW$T$74, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    1181                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x4b)
    1182                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x29)
    1183            
    1184            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1185                    .dwattr $C$DW$T$28, DW_AT_name("ADC12_A_configureMemoryParam")
    1186                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x05)
    1187            $C$DW$106       .dwtag  DW_TAG_member
    1188                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1189                    .dwattr $C$DW$106, DW_AT_name("memoryBufferControlIndex")
    1190                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("memoryBufferControlIndex")
    1191                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1193                    .dwattr $C$DW$106, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1194                    .dwattr $C$DW$106, DW_AT_decl_line(0x53)
    1195                    .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1196            $C$DW$107       .dwtag  DW_TAG_member
    1197                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1198                    .dwattr $C$DW$107, DW_AT_name("inputSourceSelect")
    1199                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("inputSourceSelect")
    1200                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1201                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1202                    .dwattr $C$DW$107, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1203                    .dwattr $C$DW$107, DW_AT_decl_line(0x67)
    1204                    .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1205            $C$DW$108       .dwtag  DW_TAG_member
    1206                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1207                    .dwattr $C$DW$108, DW_AT_name("positiveRefVoltageSourceSelect")
    1208                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
    1209                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1210                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1211                    .dwattr $C$DW$108, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1212                    .dwattr $C$DW$108, DW_AT_decl_line(0x6e)
    1213                    .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1214            $C$DW$109       .dwtag  DW_TAG_member
    1215                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1216                    .dwattr $C$DW$109, DW_AT_name("negativeRefVoltageSourceSelect")
    1217                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
    1218                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1219                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1220                    .dwattr $C$DW$109, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1221                    .dwattr $C$DW$109, DW_AT_decl_line(0x74)
    1222                    .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1223            $C$DW$110       .dwtag  DW_TAG_member
    1224                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1225                    .dwattr $C$DW$110, DW_AT_name("endOfSequence")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   26

    1226                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("endOfSequence")
    1227                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1228                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1229                    .dwattr $C$DW$110, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1230                    .dwattr $C$DW$110, DW_AT_decl_line(0x7a)
    1231                    .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1232                    .dwendtag $C$DW$T$28
    1233            
    1234                    .dwattr $C$DW$T$28, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1235                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f)
    1236                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1237            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC12_A_configureMemoryParam")
    1238                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    1239                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1240                    .dwattr $C$DW$T$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
    1241                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x7b)
    1242                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    1243            
    1244            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1245                    .dwattr $C$DW$T$30, DW_AT_name("Calendar")
    1246                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1247            $C$DW$111       .dwtag  DW_TAG_member
    1248                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1249                    .dwattr $C$DW$111, DW_AT_name("Seconds")
    1250                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("Seconds")
    1251                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1253                    .dwattr $C$DW$111, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1254                    .dwattr $C$DW$111, DW_AT_decl_line(0x42)
    1255                    .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1256            $C$DW$112       .dwtag  DW_TAG_member
    1257                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1258                    .dwattr $C$DW$112, DW_AT_name("Minutes")
    1259                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("Minutes")
    1260                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1261                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1262                    .dwattr $C$DW$112, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1263                    .dwattr $C$DW$112, DW_AT_decl_line(0x44)
    1264                    .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1265            $C$DW$113       .dwtag  DW_TAG_member
    1266                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1267                    .dwattr $C$DW$113, DW_AT_name("Hours")
    1268                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("Hours")
    1269                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1270                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1271                    .dwattr $C$DW$113, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1272                    .dwattr $C$DW$113, DW_AT_decl_line(0x46)
    1273                    .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1274            $C$DW$114       .dwtag  DW_TAG_member
    1275                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1276                    .dwattr $C$DW$114, DW_AT_name("DayOfWeek")
    1277                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("DayOfWeek")
    1278                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1279                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1280                    .dwattr $C$DW$114, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   27

    1281                    .dwattr $C$DW$114, DW_AT_decl_line(0x48)
    1282                    .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1283            $C$DW$115       .dwtag  DW_TAG_member
    1284                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1285                    .dwattr $C$DW$115, DW_AT_name("DayOfMonth")
    1286                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("DayOfMonth")
    1287                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1288                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1289                    .dwattr $C$DW$115, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1290                    .dwattr $C$DW$115, DW_AT_decl_line(0x4a)
    1291                    .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1292            $C$DW$116       .dwtag  DW_TAG_member
    1293                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1294                    .dwattr $C$DW$116, DW_AT_name("Month")
    1295                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("Month")
    1296                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1297                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1298                    .dwattr $C$DW$116, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1299                    .dwattr $C$DW$116, DW_AT_decl_line(0x4c)
    1300                    .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1301            $C$DW$117       .dwtag  DW_TAG_member
    1302                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1303                    .dwattr $C$DW$117, DW_AT_name("Year")
    1304                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("Year")
    1305                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1306                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1307                    .dwattr $C$DW$117, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1308                    .dwattr $C$DW$117, DW_AT_decl_line(0x4e)
    1309                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1310                    .dwendtag $C$DW$T$30
    1311            
    1312                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1313                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
    1314                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1315            $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("Calendar")
    1316                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$30)
    1317                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1318                    .dwattr $C$DW$T$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1319                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x4f)
    1320                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1321            
    1322            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1323                    .dwattr $C$DW$T$31, DW_AT_name("Comp_B_configureReferenceVoltageParam")
    1324                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    1325            $C$DW$118       .dwtag  DW_TAG_member
    1326                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1327                    .dwattr $C$DW$118, DW_AT_name("supplyVoltageReferenceBase")
    1328                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
    1329                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1331                    .dwattr $C$DW$118, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1332                    .dwattr $C$DW$118, DW_AT_decl_line(0x8e)
    1333                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1334            $C$DW$119       .dwtag  DW_TAG_member
    1335                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   28

    1336                    .dwattr $C$DW$119, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
    1337                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
    1338                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1339                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1340                    .dwattr $C$DW$119, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1341                    .dwattr $C$DW$119, DW_AT_decl_line(0x91)
    1342                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1343            $C$DW$120       .dwtag  DW_TAG_member
    1344                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$29)
    1345                    .dwattr $C$DW$120, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
    1346                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
    1347                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1348                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1349                    .dwattr $C$DW$120, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1350                    .dwattr $C$DW$120, DW_AT_decl_line(0x94)
    1351                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1352            $C$DW$121       .dwtag  DW_TAG_member
    1353                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$29)
    1354                    .dwattr $C$DW$121, DW_AT_name("referenceAccuracy")
    1355                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("referenceAccuracy")
    1356                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1357                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1358                    .dwattr $C$DW$121, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1359                    .dwattr $C$DW$121, DW_AT_decl_line(0x9a)
    1360                    .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    1361                    .dwendtag $C$DW$T$31
    1362            
    1363                    .dwattr $C$DW$T$31, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1364                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x85)
    1365                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1366            $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_configureReferenceVoltageParam")
    1367                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$31)
    1368                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1369                    .dwattr $C$DW$T$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1370                    .dwattr $C$DW$T$77, DW_AT_decl_line(0x9b)
    1371                    .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1372            
    1373            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1374                    .dwattr $C$DW$T$32, DW_AT_name("Comp_B_initializeParam")
    1375                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    1376            $C$DW$122       .dwtag  DW_TAG_member
    1377                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1378                    .dwattr $C$DW$122, DW_AT_name("positiveTerminalInput")
    1379                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("positiveTerminalInput")
    1380                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1382                    .dwattr $C$DW$122, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1383                    .dwattr $C$DW$122, DW_AT_decl_line(0x53)
    1384                    .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1385            $C$DW$123       .dwtag  DW_TAG_member
    1386                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1387                    .dwattr $C$DW$123, DW_AT_name("negativeTerminalInput")
    1388                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("negativeTerminalInput")
    1389                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1390                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   29

    1391                    .dwattr $C$DW$123, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1392                    .dwattr $C$DW$123, DW_AT_decl_line(0x67)
    1393                    .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1394            $C$DW$124       .dwtag  DW_TAG_member
    1395                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    1396                    .dwattr $C$DW$124, DW_AT_name("powerModeSelect")
    1397                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("powerModeSelect")
    1398                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1399                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1400                    .dwattr $C$DW$124, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1401                    .dwattr $C$DW$124, DW_AT_decl_line(0x6d)
    1402                    .dwattr $C$DW$124, DW_AT_decl_column(0x0e)
    1403            $C$DW$125       .dwtag  DW_TAG_member
    1404                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1405                    .dwattr $C$DW$125, DW_AT_name("outputFilterEnableAndDelayLevel")
    1406                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
    1407                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1408                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1409                    .dwattr $C$DW$125, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1410                    .dwattr $C$DW$125, DW_AT_decl_line(0x77)
    1411                    .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1412            $C$DW$126       .dwtag  DW_TAG_member
    1413                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$29)
    1414                    .dwattr $C$DW$126, DW_AT_name("invertedOutputPolarity")
    1415                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("invertedOutputPolarity")
    1416                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1417                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1418                    .dwattr $C$DW$126, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1419                    .dwattr $C$DW$126, DW_AT_decl_line(0x7c)
    1420                    .dwattr $C$DW$126, DW_AT_decl_column(0x0e)
    1421                    .dwendtag $C$DW$T$32
    1422            
    1423                    .dwattr $C$DW$T$32, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1424                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x3e)
    1425                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1426            $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_initializeParam")
    1427                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$32)
    1428                    .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1429                    .dwattr $C$DW$T$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
    1430                    .dwattr $C$DW$T$78, DW_AT_decl_line(0x7d)
    1431                    .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1432            
    1433            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1434                    .dwattr $C$DW$T$33, DW_AT_name("DMA_initializeParam")
    1435                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
    1436            $C$DW$127       .dwtag  DW_TAG_member
    1437                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1438                    .dwattr $C$DW$127, DW_AT_name("channelSelect")
    1439                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("channelSelect")
    1440                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1442                    .dwattr $C$DW$127, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1443                    .dwattr $C$DW$127, DW_AT_decl_line(0x4a)
    1444                    .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1445            $C$DW$128       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   30

    1446                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$29)
    1447                    .dwattr $C$DW$128, DW_AT_name("transferModeSelect")
    1448                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("transferModeSelect")
    1449                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1450                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1451                    .dwattr $C$DW$128, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1452                    .dwattr $C$DW$128, DW_AT_decl_line(0x53)
    1453                    .dwattr $C$DW$128, DW_AT_decl_column(0x0e)
    1454            $C$DW$129       .dwtag  DW_TAG_member
    1455                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
    1456                    .dwattr $C$DW$129, DW_AT_name("transferSize")
    1457                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("transferSize")
    1458                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1459                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1460                    .dwattr $C$DW$129, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1461                    .dwattr $C$DW$129, DW_AT_decl_line(0x57)
    1462                    .dwattr $C$DW$129, DW_AT_decl_column(0x0e)
    1463            $C$DW$130       .dwtag  DW_TAG_member
    1464                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1465                    .dwattr $C$DW$130, DW_AT_name("triggerSourceSelect")
    1466                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("triggerSourceSelect")
    1467                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1468                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1469                    .dwattr $C$DW$130, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1470                    .dwattr $C$DW$130, DW_AT_decl_line(0x7b)
    1471                    .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1472            $C$DW$131       .dwtag  DW_TAG_member
    1473                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1474                    .dwattr $C$DW$131, DW_AT_name("transferUnitSelect")
    1475                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("transferUnitSelect")
    1476                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1477                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1478                    .dwattr $C$DW$131, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1479                    .dwattr $C$DW$131, DW_AT_decl_line(0x82)
    1480                    .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1481            $C$DW$132       .dwtag  DW_TAG_member
    1482                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1483                    .dwattr $C$DW$132, DW_AT_name("triggerTypeSelect")
    1484                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("triggerTypeSelect")
    1485                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1486                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1487                    .dwattr $C$DW$132, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1488                    .dwattr $C$DW$132, DW_AT_decl_line(0x88)
    1489                    .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1490                    .dwendtag $C$DW$T$33
    1491            
    1492                    .dwattr $C$DW$T$33, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1493                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x3e)
    1494                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1495            $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("DMA_initializeParam")
    1496                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$33)
    1497                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1498                    .dwattr $C$DW$T$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
    1499                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x89)
    1500                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   31

    1501            
    1502            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1503                    .dwattr $C$DW$T$34, DW_AT_name("PMAP_initPortsParam")
    1504                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    1505            $C$DW$133       .dwtag  DW_TAG_member
    1506                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    1507                    .dwattr $C$DW$133, DW_AT_name("portMapping")
    1508                    .dwattr $C$DW$133, DW_AT_TI_symbol_name("portMapping")
    1509                    .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510                    .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1511                    .dwattr $C$DW$133, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1512                    .dwattr $C$DW$133, DW_AT_decl_line(0x41)
    1513                    .dwattr $C$DW$133, DW_AT_decl_column(0x14)
    1514            $C$DW$134       .dwtag  DW_TAG_member
    1515                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$22)
    1516                    .dwattr $C$DW$134, DW_AT_name("PxMAPy")
    1517                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("PxMAPy")
    1518                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1519                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1520                    .dwattr $C$DW$134, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1521                    .dwattr $C$DW$134, DW_AT_decl_line(0x43)
    1522                    .dwattr $C$DW$134, DW_AT_decl_column(0x0e)
    1523            $C$DW$135       .dwtag  DW_TAG_member
    1524                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1525                    .dwattr $C$DW$135, DW_AT_name("numberOfPorts")
    1526                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("numberOfPorts")
    1527                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1528                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1529                    .dwattr $C$DW$135, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1530                    .dwattr $C$DW$135, DW_AT_decl_line(0x45)
    1531                    .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1532            $C$DW$136       .dwtag  DW_TAG_member
    1533                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1534                    .dwattr $C$DW$136, DW_AT_name("portMapReconfigure")
    1535                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("portMapReconfigure")
    1536                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1537                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1538                    .dwattr $C$DW$136, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1539                    .dwattr $C$DW$136, DW_AT_decl_line(0x4a)
    1540                    .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1541                    .dwendtag $C$DW$T$34
    1542            
    1543                    .dwattr $C$DW$T$34, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1544                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e)
    1545                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    1546            $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("PMAP_initPortsParam")
    1547                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    1548                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1549                    .dwattr $C$DW$T$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
    1550                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x4b)
    1551                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    1552            
    1553            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1554                    .dwattr $C$DW$T$35, DW_AT_name("RTC_B_configureCalendarAlarmParam")
    1555                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   32

    1556            $C$DW$137       .dwtag  DW_TAG_member
    1557                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1558                    .dwattr $C$DW$137, DW_AT_name("minutesAlarm")
    1559                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("minutesAlarm")
    1560                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1562                    .dwattr $C$DW$137, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1563                    .dwattr $C$DW$137, DW_AT_decl_line(0x5c)
    1564                    .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1565            $C$DW$138       .dwtag  DW_TAG_member
    1566                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1567                    .dwattr $C$DW$138, DW_AT_name("hoursAlarm")
    1568                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("hoursAlarm")
    1569                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1570                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1571                    .dwattr $C$DW$138, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1572                    .dwattr $C$DW$138, DW_AT_decl_line(0x60)
    1573                    .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1574            $C$DW$139       .dwtag  DW_TAG_member
    1575                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1576                    .dwattr $C$DW$139, DW_AT_name("dayOfWeekAlarm")
    1577                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("dayOfWeekAlarm")
    1578                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1579                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1580                    .dwattr $C$DW$139, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1581                    .dwattr $C$DW$139, DW_AT_decl_line(0x64)
    1582                    .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1583            $C$DW$140       .dwtag  DW_TAG_member
    1584                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1585                    .dwattr $C$DW$140, DW_AT_name("dayOfMonthAlarm")
    1586                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("dayOfMonthAlarm")
    1587                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1588                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1589                    .dwattr $C$DW$140, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1590                    .dwattr $C$DW$140, DW_AT_decl_line(0x68)
    1591                    .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1592                    .dwendtag $C$DW$T$35
    1593            
    1594                    .dwattr $C$DW$T$35, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1595                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x57)
    1596                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1597            $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("RTC_B_configureCalendarAlarmParam")
    1598                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    1599                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1600                    .dwattr $C$DW$T$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
    1601                    .dwattr $C$DW$T$81, DW_AT_decl_line(0x69)
    1602                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    1603            
    1604            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1605                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initCaptureModeParam")
    1606                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1607            $C$DW$141       .dwtag  DW_TAG_member
    1608                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$29)
    1609                    .dwattr $C$DW$141, DW_AT_name("captureRegister")
    1610                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("captureRegister")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   33

    1611                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1613                    .dwattr $C$DW$141, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1614                    .dwattr $C$DW$141, DW_AT_decl_line(0x89)
    1615                    .dwattr $C$DW$141, DW_AT_decl_column(0x0e)
    1616            $C$DW$142       .dwtag  DW_TAG_member
    1617                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$29)
    1618                    .dwattr $C$DW$142, DW_AT_name("captureMode")
    1619                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("captureMode")
    1620                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1621                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1622                    .dwattr $C$DW$142, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1623                    .dwattr $C$DW$142, DW_AT_decl_line(0x90)
    1624                    .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    1625            $C$DW$143       .dwtag  DW_TAG_member
    1626                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$29)
    1627                    .dwattr $C$DW$143, DW_AT_name("captureInputSelect")
    1628                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("captureInputSelect")
    1629                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1630                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1631                    .dwattr $C$DW$143, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1632                    .dwattr $C$DW$143, DW_AT_decl_line(0x97)
    1633                    .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    1634            $C$DW$144       .dwtag  DW_TAG_member
    1635                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$29)
    1636                    .dwattr $C$DW$144, DW_AT_name("synchronizeCaptureSource")
    1637                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1638                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1639                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1640                    .dwattr $C$DW$144, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1641                    .dwattr $C$DW$144, DW_AT_decl_line(0x9c)
    1642                    .dwattr $C$DW$144, DW_AT_decl_column(0x0e)
    1643            $C$DW$145       .dwtag  DW_TAG_member
    1644                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$29)
    1645                    .dwattr $C$DW$145, DW_AT_name("captureInterruptEnable")
    1646                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("captureInterruptEnable")
    1647                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1648                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1649                    .dwattr $C$DW$145, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1650                    .dwattr $C$DW$145, DW_AT_decl_line(0xa1)
    1651                    .dwattr $C$DW$145, DW_AT_decl_column(0x0e)
    1652            $C$DW$146       .dwtag  DW_TAG_member
    1653                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
    1654                    .dwattr $C$DW$146, DW_AT_name("captureOutputMode")
    1655                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("captureOutputMode")
    1656                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1657                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1658                    .dwattr $C$DW$146, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1659                    .dwattr $C$DW$146, DW_AT_decl_line(0xac)
    1660                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    1661                    .dwendtag $C$DW$T$36
    1662            
    1663                    .dwattr $C$DW$T$36, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1664                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x7d)
    1665                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   34

    1666            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCaptureModeParam")
    1667                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    1668                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1669                    .dwattr $C$DW$T$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1670                    .dwattr $C$DW$T$82, DW_AT_decl_line(0xad)
    1671                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1672            
    1673            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1674                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_initCompareModeParam")
    1675                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    1676            $C$DW$147       .dwtag  DW_TAG_member
    1677                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$29)
    1678                    .dwattr $C$DW$147, DW_AT_name("compareRegister")
    1679                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("compareRegister")
    1680                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1682                    .dwattr $C$DW$147, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1683                    .dwattr $C$DW$147, DW_AT_decl_line(0x17a)
    1684                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    1685            $C$DW$148       .dwtag  DW_TAG_member
    1686                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1687                    .dwattr $C$DW$148, DW_AT_name("compareInterruptEnable")
    1688                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("compareInterruptEnable")
    1689                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1690                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1691                    .dwattr $C$DW$148, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1692                    .dwattr $C$DW$148, DW_AT_decl_line(0x17f)
    1693                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    1694            $C$DW$149       .dwtag  DW_TAG_member
    1695                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$29)
    1696                    .dwattr $C$DW$149, DW_AT_name("compareOutputMode")
    1697                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("compareOutputMode")
    1698                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1699                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1700                    .dwattr $C$DW$149, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1701                    .dwattr $C$DW$149, DW_AT_decl_line(0x18a)
    1702                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    1703            $C$DW$150       .dwtag  DW_TAG_member
    1704                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    1705                    .dwattr $C$DW$150, DW_AT_name("compareValue")
    1706                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("compareValue")
    1707                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1708                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1709                    .dwattr $C$DW$150, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1710                    .dwattr $C$DW$150, DW_AT_decl_line(0x18c)
    1711                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    1712                    .dwendtag $C$DW$T$37
    1713            
    1714                    .dwattr $C$DW$T$37, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1715                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x16e)
    1716                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1717            $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCompareModeParam")
    1718                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$37)
    1719                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1720                    .dwattr $C$DW$T$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   35

    1721                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x18d)
    1722                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1723            
    1724            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1725                    .dwattr $C$DW$T$39, DW_AT_name("Timer_A_initContinuousModeParam")
    1726                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1727            $C$DW$151       .dwtag  DW_TAG_member
    1728                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$29)
    1729                    .dwattr $C$DW$151, DW_AT_name("clockSource")
    1730                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("clockSource")
    1731                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1733                    .dwattr $C$DW$151, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1734                    .dwattr $C$DW$151, DW_AT_decl_line(0x50)
    1735                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    1736            $C$DW$152       .dwtag  DW_TAG_member
    1737                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$29)
    1738                    .dwattr $C$DW$152, DW_AT_name("clockSourceDivider")
    1739                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("clockSourceDivider")
    1740                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1741                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1742                    .dwattr $C$DW$152, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1743                    .dwattr $C$DW$152, DW_AT_decl_line(0x67)
    1744                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    1745            $C$DW$153       .dwtag  DW_TAG_member
    1746                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$29)
    1747                    .dwattr $C$DW$153, DW_AT_name("timerInterruptEnable_TAIE")
    1748                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1749                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1750                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1751                    .dwattr $C$DW$153, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1752                    .dwattr $C$DW$153, DW_AT_decl_line(0x6c)
    1753                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    1754            $C$DW$154       .dwtag  DW_TAG_member
    1755                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$29)
    1756                    .dwattr $C$DW$154, DW_AT_name("timerClear")
    1757                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("timerClear")
    1758                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1759                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1760                    .dwattr $C$DW$154, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1761                    .dwattr $C$DW$154, DW_AT_decl_line(0x72)
    1762                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    1763            $C$DW$155       .dwtag  DW_TAG_member
    1764                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$38)
    1765                    .dwattr $C$DW$155, DW_AT_name("startTimer")
    1766                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("startTimer")
    1767                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1768                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1769                    .dwattr $C$DW$155, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1770                    .dwattr $C$DW$155, DW_AT_decl_line(0x74)
    1771                    .dwattr $C$DW$155, DW_AT_decl_column(0x0a)
    1772                    .dwendtag $C$DW$T$39
    1773            
    1774                    .dwattr $C$DW$T$39, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1775                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x48)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   36

    1776                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1777            $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initContinuousModeParam")
    1778                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$39)
    1779                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1780                    .dwattr $C$DW$T$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1781                    .dwattr $C$DW$T$84, DW_AT_decl_line(0x75)
    1782                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1783            
    1784            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1785                    .dwattr $C$DW$T$40, DW_AT_name("Timer_A_initUpDownModeParam")
    1786                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    1787            $C$DW$156       .dwtag  DW_TAG_member
    1788                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$29)
    1789                    .dwattr $C$DW$156, DW_AT_name("clockSource")
    1790                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("clockSource")
    1791                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1793                    .dwattr $C$DW$156, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1794                    .dwattr $C$DW$156, DW_AT_decl_line(0xbd)
    1795                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    1796            $C$DW$157       .dwtag  DW_TAG_member
    1797                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$29)
    1798                    .dwattr $C$DW$157, DW_AT_name("clockSourceDivider")
    1799                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("clockSourceDivider")
    1800                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1801                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1802                    .dwattr $C$DW$157, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1803                    .dwattr $C$DW$157, DW_AT_decl_line(0xd4)
    1804                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    1805            $C$DW$158       .dwtag  DW_TAG_member
    1806                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$29)
    1807                    .dwattr $C$DW$158, DW_AT_name("timerPeriod")
    1808                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("timerPeriod")
    1809                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1810                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1811                    .dwattr $C$DW$158, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1812                    .dwattr $C$DW$158, DW_AT_decl_line(0xd6)
    1813                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    1814            $C$DW$159       .dwtag  DW_TAG_member
    1815                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$29)
    1816                    .dwattr $C$DW$159, DW_AT_name("timerInterruptEnable_TAIE")
    1817                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1818                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1819                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1820                    .dwattr $C$DW$159, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1821                    .dwattr $C$DW$159, DW_AT_decl_line(0xdb)
    1822                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    1823            $C$DW$160       .dwtag  DW_TAG_member
    1824                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$29)
    1825                    .dwattr $C$DW$160, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1826                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1827                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1828                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1829                    .dwattr $C$DW$160, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1830                    .dwattr $C$DW$160, DW_AT_decl_line(0xe0)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   37

    1831                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    1832            $C$DW$161       .dwtag  DW_TAG_member
    1833                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    1834                    .dwattr $C$DW$161, DW_AT_name("timerClear")
    1835                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("timerClear")
    1836                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1837                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1838                    .dwattr $C$DW$161, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1839                    .dwattr $C$DW$161, DW_AT_decl_line(0xe6)
    1840                    .dwattr $C$DW$161, DW_AT_decl_column(0x0e)
    1841            $C$DW$162       .dwtag  DW_TAG_member
    1842                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$38)
    1843                    .dwattr $C$DW$162, DW_AT_name("startTimer")
    1844                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("startTimer")
    1845                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1846                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1847                    .dwattr $C$DW$162, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1848                    .dwattr $C$DW$162, DW_AT_decl_line(0xe8)
    1849                    .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    1850                    .dwendtag $C$DW$T$40
    1851            
    1852                    .dwattr $C$DW$T$40, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1853                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xb5)
    1854                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1855            $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpDownModeParam")
    1856                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$40)
    1857                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1858                    .dwattr $C$DW$T$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1859                    .dwattr $C$DW$T$85, DW_AT_decl_line(0xe9)
    1860                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1861            
    1862            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1863                    .dwattr $C$DW$T$41, DW_AT_name("Timer_A_initUpModeParam")
    1864                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
    1865            $C$DW$163       .dwtag  DW_TAG_member
    1866                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$29)
    1867                    .dwattr $C$DW$163, DW_AT_name("clockSource")
    1868                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("clockSource")
    1869                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1871                    .dwattr $C$DW$163, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1872                    .dwattr $C$DW$163, DW_AT_decl_line(0x139)
    1873                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1874            $C$DW$164       .dwtag  DW_TAG_member
    1875                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$29)
    1876                    .dwattr $C$DW$164, DW_AT_name("clockSourceDivider")
    1877                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("clockSourceDivider")
    1878                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1879                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1880                    .dwattr $C$DW$164, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1881                    .dwattr $C$DW$164, DW_AT_decl_line(0x150)
    1882                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1883            $C$DW$165       .dwtag  DW_TAG_member
    1884                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$29)
    1885                    .dwattr $C$DW$165, DW_AT_name("timerPeriod")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   38

    1886                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("timerPeriod")
    1887                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1888                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1889                    .dwattr $C$DW$165, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1890                    .dwattr $C$DW$165, DW_AT_decl_line(0x153)
    1891                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1892            $C$DW$166       .dwtag  DW_TAG_member
    1893                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$29)
    1894                    .dwattr $C$DW$166, DW_AT_name("timerInterruptEnable_TAIE")
    1895                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1896                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1897                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1898                    .dwattr $C$DW$166, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1899                    .dwattr $C$DW$166, DW_AT_decl_line(0x158)
    1900                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1901            $C$DW$167       .dwtag  DW_TAG_member
    1902                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$29)
    1903                    .dwattr $C$DW$167, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1904                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1905                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1906                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1907                    .dwattr $C$DW$167, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1908                    .dwattr $C$DW$167, DW_AT_decl_line(0x15d)
    1909                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    1910            $C$DW$168       .dwtag  DW_TAG_member
    1911                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$29)
    1912                    .dwattr $C$DW$168, DW_AT_name("timerClear")
    1913                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("timerClear")
    1914                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1915                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1916                    .dwattr $C$DW$168, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1917                    .dwattr $C$DW$168, DW_AT_decl_line(0x163)
    1918                    .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    1919            $C$DW$169       .dwtag  DW_TAG_member
    1920                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$38)
    1921                    .dwattr $C$DW$169, DW_AT_name("startTimer")
    1922                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("startTimer")
    1923                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1924                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1925                    .dwattr $C$DW$169, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1926                    .dwattr $C$DW$169, DW_AT_decl_line(0x165)
    1927                    .dwattr $C$DW$169, DW_AT_decl_column(0x0a)
    1928                    .dwendtag $C$DW$T$41
    1929            
    1930                    .dwattr $C$DW$T$41, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1931                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x131)
    1932                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1933            $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpModeParam")
    1934                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$41)
    1935                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1936                    .dwattr $C$DW$T$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1937                    .dwattr $C$DW$T$86, DW_AT_decl_line(0x166)
    1938                    .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1939            
    1940            $C$DW$T$42      .dwtag  DW_TAG_structure_type
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   39

    1941                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    1942                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1943            $C$DW$170       .dwtag  DW_TAG_member
    1944                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$29)
    1945                    .dwattr $C$DW$170, DW_AT_name("clockSource")
    1946                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("clockSource")
    1947                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1949                    .dwattr $C$DW$170, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1950                    .dwattr $C$DW$170, DW_AT_decl_line(0xf8)
    1951                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1952            $C$DW$171       .dwtag  DW_TAG_member
    1953                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$29)
    1954                    .dwattr $C$DW$171, DW_AT_name("clockSourceDivider")
    1955                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("clockSourceDivider")
    1956                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1957                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1958                    .dwattr $C$DW$171, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1959                    .dwattr $C$DW$171, DW_AT_decl_line(0x10f)
    1960                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1961            $C$DW$172       .dwtag  DW_TAG_member
    1962                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$29)
    1963                    .dwattr $C$DW$172, DW_AT_name("timerPeriod")
    1964                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("timerPeriod")
    1965                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1966                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1967                    .dwattr $C$DW$172, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1968                    .dwattr $C$DW$172, DW_AT_decl_line(0x111)
    1969                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1970            $C$DW$173       .dwtag  DW_TAG_member
    1971                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$29)
    1972                    .dwattr $C$DW$173, DW_AT_name("compareRegister")
    1973                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("compareRegister")
    1974                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1975                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1976                    .dwattr $C$DW$173, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1977                    .dwattr $C$DW$173, DW_AT_decl_line(0x11c)
    1978                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1979            $C$DW$174       .dwtag  DW_TAG_member
    1980                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$29)
    1981                    .dwattr $C$DW$174, DW_AT_name("compareOutputMode")
    1982                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("compareOutputMode")
    1983                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1984                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1985                    .dwattr $C$DW$174, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1986                    .dwattr $C$DW$174, DW_AT_decl_line(0x127)
    1987                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1988            $C$DW$175       .dwtag  DW_TAG_member
    1989                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$29)
    1990                    .dwattr $C$DW$175, DW_AT_name("dutyCycle")
    1991                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("dutyCycle")
    1992                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1993                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1994                    .dwattr $C$DW$175, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1995                    .dwattr $C$DW$175, DW_AT_decl_line(0x129)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   40

    1996                    .dwattr $C$DW$175, DW_AT_decl_column(0x0e)
    1997                    .dwendtag $C$DW$T$42
    1998            
    1999                    .dwattr $C$DW$T$42, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2000                    .dwattr $C$DW$T$42, DW_AT_decl_line(0xf0)
    2001                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2002            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_outputPWMParam")
    2003                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$42)
    2004                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2005                    .dwattr $C$DW$T$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    2006                    .dwattr $C$DW$T$87, DW_AT_decl_line(0x12a)
    2007                    .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2008            
    2009            $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2010                    .dwattr $C$DW$T$43, DW_AT_name("Timer_B_initCaptureModeParam")
    2011                    .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    2012            $C$DW$176       .dwtag  DW_TAG_member
    2013                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$29)
    2014                    .dwattr $C$DW$176, DW_AT_name("captureRegister")
    2015                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("captureRegister")
    2016                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2018                    .dwattr $C$DW$176, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2019                    .dwattr $C$DW$176, DW_AT_decl_line(0xd1)
    2020                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    2021            $C$DW$177       .dwtag  DW_TAG_member
    2022                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$29)
    2023                    .dwattr $C$DW$177, DW_AT_name("captureMode")
    2024                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("captureMode")
    2025                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2026                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2027                    .dwattr $C$DW$177, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2028                    .dwattr $C$DW$177, DW_AT_decl_line(0xd8)
    2029                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    2030            $C$DW$178       .dwtag  DW_TAG_member
    2031                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$29)
    2032                    .dwattr $C$DW$178, DW_AT_name("captureInputSelect")
    2033                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("captureInputSelect")
    2034                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2035                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2036                    .dwattr $C$DW$178, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2037                    .dwattr $C$DW$178, DW_AT_decl_line(0xdf)
    2038                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2039            $C$DW$179       .dwtag  DW_TAG_member
    2040                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$29)
    2041                    .dwattr $C$DW$179, DW_AT_name("synchronizeCaptureSource")
    2042                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2043                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2044                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2045                    .dwattr $C$DW$179, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2046                    .dwattr $C$DW$179, DW_AT_decl_line(0xe4)
    2047                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2048            $C$DW$180       .dwtag  DW_TAG_member
    2049                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$29)
    2050                    .dwattr $C$DW$180, DW_AT_name("captureInterruptEnable")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   41

    2051                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("captureInterruptEnable")
    2052                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2053                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2054                    .dwattr $C$DW$180, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2055                    .dwattr $C$DW$180, DW_AT_decl_line(0xe9)
    2056                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2057            $C$DW$181       .dwtag  DW_TAG_member
    2058                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$29)
    2059                    .dwattr $C$DW$181, DW_AT_name("captureOutputMode")
    2060                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("captureOutputMode")
    2061                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2062                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2063                    .dwattr $C$DW$181, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2064                    .dwattr $C$DW$181, DW_AT_decl_line(0xf4)
    2065                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    2066                    .dwendtag $C$DW$T$43
    2067            
    2068                    .dwattr $C$DW$T$43, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2069                    .dwattr $C$DW$T$43, DW_AT_decl_line(0xc5)
    2070                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    2071            $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCaptureModeParam")
    2072                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$43)
    2073                    .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2074                    .dwattr $C$DW$T$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2075                    .dwattr $C$DW$T$88, DW_AT_decl_line(0xf5)
    2076                    .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    2077            
    2078            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2079                    .dwattr $C$DW$T$44, DW_AT_name("Timer_B_initCompareModeParam")
    2080                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    2081            $C$DW$182       .dwtag  DW_TAG_member
    2082                    .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$29)
    2083                    .dwattr $C$DW$182, DW_AT_name("compareRegister")
    2084                    .dwattr $C$DW$182, DW_AT_TI_symbol_name("compareRegister")
    2085                    .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                    .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2087                    .dwattr $C$DW$182, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2088                    .dwattr $C$DW$182, DW_AT_decl_line(0x17a)
    2089                    .dwattr $C$DW$182, DW_AT_decl_column(0x0e)
    2090            $C$DW$183       .dwtag  DW_TAG_member
    2091                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$29)
    2092                    .dwattr $C$DW$183, DW_AT_name("compareInterruptEnable")
    2093                    .dwattr $C$DW$183, DW_AT_TI_symbol_name("compareInterruptEnable")
    2094                    .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2095                    .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2096                    .dwattr $C$DW$183, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2097                    .dwattr $C$DW$183, DW_AT_decl_line(0x17f)
    2098                    .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2099            $C$DW$184       .dwtag  DW_TAG_member
    2100                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$29)
    2101                    .dwattr $C$DW$184, DW_AT_name("compareOutputMode")
    2102                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("compareOutputMode")
    2103                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2104                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2105                    .dwattr $C$DW$184, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   42

    2106                    .dwattr $C$DW$184, DW_AT_decl_line(0x18a)
    2107                    .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    2108            $C$DW$185       .dwtag  DW_TAG_member
    2109                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$29)
    2110                    .dwattr $C$DW$185, DW_AT_name("compareValue")
    2111                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("compareValue")
    2112                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2113                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2114                    .dwattr $C$DW$185, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2115                    .dwattr $C$DW$185, DW_AT_decl_line(0x18c)
    2116                    .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    2117                    .dwendtag $C$DW$T$44
    2118            
    2119                    .dwattr $C$DW$T$44, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2120                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x16e)
    2121                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    2122            $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCompareModeParam")
    2123                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$44)
    2124                    .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2125                    .dwattr $C$DW$T$89, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2126                    .dwattr $C$DW$T$89, DW_AT_decl_line(0x18d)
    2127                    .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    2128            
    2129            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2130                    .dwattr $C$DW$T$45, DW_AT_name("Timer_B_initContinuousModeParam")
    2131                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    2132            $C$DW$186       .dwtag  DW_TAG_member
    2133                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$29)
    2134                    .dwattr $C$DW$186, DW_AT_name("clockSource")
    2135                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("clockSource")
    2136                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2138                    .dwattr $C$DW$186, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2139                    .dwattr $C$DW$186, DW_AT_decl_line(0x105)
    2140                    .dwattr $C$DW$186, DW_AT_decl_column(0x0e)
    2141            $C$DW$187       .dwtag  DW_TAG_member
    2142                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$29)
    2143                    .dwattr $C$DW$187, DW_AT_name("clockSourceDivider")
    2144                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("clockSourceDivider")
    2145                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2146                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2147                    .dwattr $C$DW$187, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2148                    .dwattr $C$DW$187, DW_AT_decl_line(0x11c)
    2149                    .dwattr $C$DW$187, DW_AT_decl_column(0x0e)
    2150            $C$DW$188       .dwtag  DW_TAG_member
    2151                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$29)
    2152                    .dwattr $C$DW$188, DW_AT_name("timerInterruptEnable_TBIE")
    2153                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    2154                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2155                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2156                    .dwattr $C$DW$188, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2157                    .dwattr $C$DW$188, DW_AT_decl_line(0x121)
    2158                    .dwattr $C$DW$188, DW_AT_decl_column(0x0e)
    2159            $C$DW$189       .dwtag  DW_TAG_member
    2160                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$29)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
hw_layer.asm                                                         PAGE   43

    2161                    .dwattr $C$DW$189, DW_AT_name("timerClear")
    2162                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("timerClear")
    2163                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2164                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2165                    .dwattr $C$DW$189, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    2166                    .dwattr $C$DW$189, DW_AT_decl_line(0x127)
    2167                    .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2168            $C$DW$190       .dwtag  DW_TAG_member
    2169                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$38)
    2170                    .dwattr $C$DW$190, DW_AT_name("startTimer")
    2171                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("startTimer")
