MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 17:15:22 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../main.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("push")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("push")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$11)
      16                    .dwattr $C$DW$1, DW_AT_declaration

         000008 000D 
         000009 000A 
         00000a 003E 
         00000b 0000 
     271            ;*****************************************************************************
     272            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     273            ;*****************************************************************************
     274                    .global push
     275                    .global put_cstr
     276                    .global init
     277                    .global debug_scan
     278                    .global UCA0RXBUF
     279                    .global UCA0TXBUF
     280                    .global UCA0ICTL_H
     281                    .global WDTCTL
     282                    .global SerialRX
     283                    .global hooks
     284            
     285            ;******************************************************************************
     286            ;* BUILD ATTRIBUTES                                                           *
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    7

     287            ;******************************************************************************
     288                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     289                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000001111100000000
     290                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
     291                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     292                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     293                    .battr "mspabi", Tag_File, 1, Tag_enum_size(2)
     294            
     295            ;******************************************************************************
     296            ;* TYPE INFORMATION                                                           *
     297            ;******************************************************************************
     298            
     299            $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
     300                    .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
     301            $C$DW$21        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_NONE"), DW_AT_const_value(0x00)
     302                    .dwattr $C$DW$21, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     303                    .dwattr $C$DW$21, DW_AT_decl_line(0x1c)
     304                    .dwattr $C$DW$21, DW_AT_decl_column(0x05)
     305            $C$DW$22        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_DOWNLOAD"), DW_AT_const_value(0x01)
     306                    .dwattr $C$DW$22, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     307                    .dwattr $C$DW$22, DW_AT_decl_line(0x1d)
     308                    .dwattr $C$DW$22, DW_AT_decl_column(0x05)
     309            $C$DW$23        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_PENDING_VALIDATION"), DW_AT_const_valu
     310                    .dwattr $C$DW$23, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     311                    .dwattr $C$DW$23, DW_AT_decl_line(0x1e)
     312                    .dwattr $C$DW$23, DW_AT_decl_column(0x05)
     313            $C$DW$24        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_VALIDATED"), DW_AT_const_value(0x03)
     314                    .dwattr $C$DW$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     315                    .dwattr $C$DW$24, DW_AT_decl_line(0x1f)
     316                    .dwattr $C$DW$24, DW_AT_decl_column(0x05)
     317            $C$DW$25        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_RECOVERED"), DW_AT_const_value(0x04)
     318                    .dwattr $C$DW$25, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     319                    .dwattr $C$DW$25, DW_AT_decl_line(0x20)
     320                    .dwattr $C$DW$25, DW_AT_decl_column(0x05)
     321            $C$DW$26        .dwtag  DW_TAG_enumerator, DW_AT_name("BL_IMAGE_FLASHING_ERROR"), DW_AT_const_value(0x
     322                    .dwattr $C$DW$26, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     323                    .dwattr $C$DW$26, DW_AT_decl_line(0x21)
     324                    .dwattr $C$DW$26, DW_AT_decl_column(0x05)
     325                    .dwendtag $C$DW$T$67
     326            
     327                    .dwattr $C$DW$T$67, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     328                    .dwattr $C$DW$T$67, DW_AT_decl_line(0x1b)
     329                    .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
     330            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("bl_image_status_t")
     331                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
     332                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     333                    .dwattr $C$DW$T$68, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/hw_layer.h")
     334                    .dwattr $C$DW$T$68, DW_AT_decl_line(0x22)
     335                    .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
     336            
     337            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     338                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
     339            $C$DW$27        .dwtag  DW_TAG_member
     340                    .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$21)
     341                    .dwattr $C$DW$27, DW_AT_name("base_ptr")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    8

     342                    .dwattr $C$DW$27, DW_AT_TI_symbol_name("base_ptr")
     343                    .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344                    .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     345                    .dwattr $C$DW$27, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     346                    .dwattr $C$DW$27, DW_AT_decl_line(0x15)
     347                    .dwattr $C$DW$27, DW_AT_decl_column(0x14)
     348            $C$DW$28        .dwtag  DW_TAG_member
     349                    .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$22)
     350                    .dwattr $C$DW$28, DW_AT_name("start_ptr")
     351                    .dwattr $C$DW$28, DW_AT_TI_symbol_name("start_ptr")
     352                    .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     353                    .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     354                    .dwattr $C$DW$28, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     355                    .dwattr $C$DW$28, DW_AT_decl_line(0x16)
     356                    .dwattr $C$DW$28, DW_AT_decl_column(0x0e)
     357            $C$DW$29        .dwtag  DW_TAG_member
     358                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     359                    .dwattr $C$DW$29, DW_AT_name("max_len")
     360                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("max_len")
     361                    .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     362                    .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     363                    .dwattr $C$DW$29, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     364                    .dwattr $C$DW$29, DW_AT_decl_line(0x17)
     365                    .dwattr $C$DW$29, DW_AT_decl_column(0x18)
     366            $C$DW$30        .dwtag  DW_TAG_member
     367                    .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     368                    .dwattr $C$DW$30, DW_AT_name("len")
     369                    .dwattr $C$DW$30, DW_AT_TI_symbol_name("len")
     370                    .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     371                    .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     372                    .dwattr $C$DW$30, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     373                    .dwattr $C$DW$30, DW_AT_decl_line(0x18)
     374                    .dwattr $C$DW$30, DW_AT_decl_column(0x12)
     375                    .dwendtag $C$DW$T$24
     376            
     377                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     378                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
     379                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     380            $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
     381                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
     382                    .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     383                    .dwattr $C$DW$T$69, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
     384                    .dwattr $C$DW$T$69, DW_AT_decl_line(0x19)
     385                    .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
     386            $C$DW$T$70      .dwtag  DW_TAG_pointer_type
     387                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
     388                    .dwattr $C$DW$T$70, DW_AT_address_class(0x14)
     389            
     390            $C$DW$T$25      .dwtag  DW_TAG_structure_type
     391                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     392            $C$DW$31        .dwtag  DW_TAG_member
     393                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$10)
     394                    .dwattr $C$DW$31, DW_AT_name("quot")
     395                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("quot")
     396                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE    9

     397                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     398                    .dwattr $C$DW$31, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     399                    .dwattr $C$DW$31, DW_AT_decl_line(0x46)
     400                    .dwattr $C$DW$31, DW_AT_decl_column(0x16)
     401            $C$DW$32        .dwtag  DW_TAG_member
     402                    .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$10)
     403                    .dwattr $C$DW$32, DW_AT_name("rem")
     404                    .dwattr $C$DW$32, DW_AT_TI_symbol_name("rem")
     405                    .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     406                    .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     407                    .dwattr $C$DW$32, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     408                    .dwattr $C$DW$32, DW_AT_decl_line(0x46)
     409                    .dwattr $C$DW$32, DW_AT_decl_column(0x1c)
     410                    .dwendtag $C$DW$T$25
     411            
     412                    .dwattr $C$DW$T$25, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     413                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x46)
     414                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     415            $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     416                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$25)
     417                    .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
     418                    .dwattr $C$DW$T$71, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     419                    .dwattr $C$DW$T$71, DW_AT_decl_line(0x46)
     420                    .dwattr $C$DW$T$71, DW_AT_decl_column(0x23)
     421            
     422            $C$DW$T$26      .dwtag  DW_TAG_structure_type
     423                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
     424            $C$DW$33        .dwtag  DW_TAG_member
     425                    .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$12)
     426                    .dwattr $C$DW$33, DW_AT_name("quot")
     427                    .dwattr $C$DW$33, DW_AT_TI_symbol_name("quot")
     428                    .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                    .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     430                    .dwattr $C$DW$33, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     431                    .dwattr $C$DW$33, DW_AT_decl_line(0x48)
     432                    .dwattr $C$DW$33, DW_AT_decl_column(0x17)
     433            $C$DW$34        .dwtag  DW_TAG_member
     434                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$12)
     435                    .dwattr $C$DW$34, DW_AT_name("rem")
     436                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("rem")
     437                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     438                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     439                    .dwattr $C$DW$34, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     440                    .dwattr $C$DW$34, DW_AT_decl_line(0x48)
     441                    .dwattr $C$DW$34, DW_AT_decl_column(0x1d)
     442                    .dwendtag $C$DW$T$26
     443            
     444                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     445                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
     446                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     447            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     448                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
     449                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     450                    .dwattr $C$DW$T$72, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     451                    .dwattr $C$DW$T$72, DW_AT_decl_line(0x48)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   10

     452                    .dwattr $C$DW$T$72, DW_AT_decl_column(0x24)
     453            
     454            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     455                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
     456            $C$DW$35        .dwtag  DW_TAG_member
     457                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$14)
     458                    .dwattr $C$DW$35, DW_AT_name("quot")
     459                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("quot")
     460                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     461                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     462                    .dwattr $C$DW$35, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     463                    .dwattr $C$DW$35, DW_AT_decl_line(0x4b)
     464                    .dwattr $C$DW$35, DW_AT_decl_column(0x1c)
     465            $C$DW$36        .dwtag  DW_TAG_member
     466                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$14)
     467                    .dwattr $C$DW$36, DW_AT_name("rem")
     468                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("rem")
     469                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     470                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     471                    .dwattr $C$DW$36, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/in
     472                    .dwattr $C$DW$36, DW_AT_decl_line(0x4b)
     473                    .dwattr $C$DW$36, DW_AT_decl_column(0x22)
     474                    .dwendtag $C$DW$T$27
     475            
     476                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     477                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x4b)
     478                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
     479            $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     480                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$27)
     481                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     482                    .dwattr $C$DW$T$73, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
     483                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x4b)
     484                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x29)
     485            
     486            $C$DW$T$28      .dwtag  DW_TAG_structure_type
     487                    .dwattr $C$DW$T$28, DW_AT_name("ADC12_A_configureMemoryParam")
     488                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x05)
     489            $C$DW$37        .dwtag  DW_TAG_member
     490                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     491                    .dwattr $C$DW$37, DW_AT_name("memoryBufferControlIndex")
     492                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("memoryBufferControlIndex")
     493                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     495                    .dwattr $C$DW$37, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     496                    .dwattr $C$DW$37, DW_AT_decl_line(0x53)
     497                    .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     498            $C$DW$38        .dwtag  DW_TAG_member
     499                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     500                    .dwattr $C$DW$38, DW_AT_name("inputSourceSelect")
     501                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("inputSourceSelect")
     502                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     503                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     504                    .dwattr $C$DW$38, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     505                    .dwattr $C$DW$38, DW_AT_decl_line(0x67)
     506                    .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   11

     507            $C$DW$39        .dwtag  DW_TAG_member
     508                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     509                    .dwattr $C$DW$39, DW_AT_name("positiveRefVoltageSourceSelect")
     510                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("positiveRefVoltageSourceSelect")
     511                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     512                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     513                    .dwattr $C$DW$39, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     514                    .dwattr $C$DW$39, DW_AT_decl_line(0x6e)
     515                    .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     516            $C$DW$40        .dwtag  DW_TAG_member
     517                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     518                    .dwattr $C$DW$40, DW_AT_name("negativeRefVoltageSourceSelect")
     519                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("negativeRefVoltageSourceSelect")
     520                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     521                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     522                    .dwattr $C$DW$40, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     523                    .dwattr $C$DW$40, DW_AT_decl_line(0x74)
     524                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     525            $C$DW$41        .dwtag  DW_TAG_member
     526                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     527                    .dwattr $C$DW$41, DW_AT_name("endOfSequence")
     528                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("endOfSequence")
     529                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     530                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     531                    .dwattr $C$DW$41, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     532                    .dwattr $C$DW$41, DW_AT_decl_line(0x7a)
     533                    .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     534                    .dwendtag $C$DW$T$28
     535            
     536                    .dwattr $C$DW$T$28, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     537                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f)
     538                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     539            $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("ADC12_A_configureMemoryParam")
     540                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$28)
     541                    .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
     542                    .dwattr $C$DW$T$74, DW_AT_decl_file("/work/c1202-firmware/driverlib/adc12_a.h")
     543                    .dwattr $C$DW$T$74, DW_AT_decl_line(0x7b)
     544                    .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
     545            
     546            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     547                    .dwattr $C$DW$T$30, DW_AT_name("Calendar")
     548                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
     549            $C$DW$42        .dwtag  DW_TAG_member
     550                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     551                    .dwattr $C$DW$42, DW_AT_name("Seconds")
     552                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("Seconds")
     553                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     555                    .dwattr $C$DW$42, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     556                    .dwattr $C$DW$42, DW_AT_decl_line(0x42)
     557                    .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     558            $C$DW$43        .dwtag  DW_TAG_member
     559                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     560                    .dwattr $C$DW$43, DW_AT_name("Minutes")
     561                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("Minutes")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   12

     562                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     563                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     564                    .dwattr $C$DW$43, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     565                    .dwattr $C$DW$43, DW_AT_decl_line(0x44)
     566                    .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     567            $C$DW$44        .dwtag  DW_TAG_member
     568                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     569                    .dwattr $C$DW$44, DW_AT_name("Hours")
     570                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("Hours")
     571                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     572                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     573                    .dwattr $C$DW$44, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     574                    .dwattr $C$DW$44, DW_AT_decl_line(0x46)
     575                    .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     576            $C$DW$45        .dwtag  DW_TAG_member
     577                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     578                    .dwattr $C$DW$45, DW_AT_name("DayOfWeek")
     579                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("DayOfWeek")
     580                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     581                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     582                    .dwattr $C$DW$45, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     583                    .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     584                    .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     585            $C$DW$46        .dwtag  DW_TAG_member
     586                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     587                    .dwattr $C$DW$46, DW_AT_name("DayOfMonth")
     588                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("DayOfMonth")
     589                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     590                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     591                    .dwattr $C$DW$46, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     592                    .dwattr $C$DW$46, DW_AT_decl_line(0x4a)
     593                    .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     594            $C$DW$47        .dwtag  DW_TAG_member
     595                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     596                    .dwattr $C$DW$47, DW_AT_name("Month")
     597                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("Month")
     598                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     599                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     600                    .dwattr $C$DW$47, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     601                    .dwattr $C$DW$47, DW_AT_decl_line(0x4c)
     602                    .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     603            $C$DW$48        .dwtag  DW_TAG_member
     604                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$29)
     605                    .dwattr $C$DW$48, DW_AT_name("Year")
     606                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("Year")
     607                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     608                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     609                    .dwattr $C$DW$48, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     610                    .dwattr $C$DW$48, DW_AT_decl_line(0x4e)
     611                    .dwattr $C$DW$48, DW_AT_decl_column(0x0e)
     612                    .dwendtag $C$DW$T$30
     613            
     614                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     615                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3f)
     616                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   13

     617            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("Calendar")
     618                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$30)
     619                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
     620                    .dwattr $C$DW$T$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     621                    .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
     622                    .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
     623            
     624            $C$DW$T$31      .dwtag  DW_TAG_structure_type
     625                    .dwattr $C$DW$T$31, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     626                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
     627            $C$DW$49        .dwtag  DW_TAG_member
     628                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$29)
     629                    .dwattr $C$DW$49, DW_AT_name("supplyVoltageReferenceBase")
     630                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("supplyVoltageReferenceBase")
     631                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     633                    .dwattr $C$DW$49, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     634                    .dwattr $C$DW$49, DW_AT_decl_line(0x8e)
     635                    .dwattr $C$DW$49, DW_AT_decl_column(0x0e)
     636            $C$DW$50        .dwtag  DW_TAG_member
     637                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
     638                    .dwattr $C$DW$50, DW_AT_name("lowerLimitSupplyVoltageFractionOf32")
     639                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("lowerLimitSupplyVoltageFractionOf32")
     640                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     641                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     642                    .dwattr $C$DW$50, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     643                    .dwattr $C$DW$50, DW_AT_decl_line(0x91)
     644                    .dwattr $C$DW$50, DW_AT_decl_column(0x0e)
     645            $C$DW$51        .dwtag  DW_TAG_member
     646                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$29)
     647                    .dwattr $C$DW$51, DW_AT_name("upperLimitSupplyVoltageFractionOf32")
     648                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("upperLimitSupplyVoltageFractionOf32")
     649                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     650                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     651                    .dwattr $C$DW$51, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     652                    .dwattr $C$DW$51, DW_AT_decl_line(0x94)
     653                    .dwattr $C$DW$51, DW_AT_decl_column(0x0e)
     654            $C$DW$52        .dwtag  DW_TAG_member
     655                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$29)
     656                    .dwattr $C$DW$52, DW_AT_name("referenceAccuracy")
     657                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("referenceAccuracy")
     658                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     659                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     660                    .dwattr $C$DW$52, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     661                    .dwattr $C$DW$52, DW_AT_decl_line(0x9a)
     662                    .dwattr $C$DW$52, DW_AT_decl_column(0x0e)
     663                    .dwendtag $C$DW$T$31
     664            
     665                    .dwattr $C$DW$T$31, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     666                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x85)
     667                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
     668            $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_configureReferenceVoltageParam")
     669                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$31)
     670                    .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
     671                    .dwattr $C$DW$T$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   14

     672                    .dwattr $C$DW$T$76, DW_AT_decl_line(0x9b)
     673                    .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
     674            
     675            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     676                    .dwattr $C$DW$T$32, DW_AT_name("Comp_B_initializeParam")
     677                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
     678            $C$DW$53        .dwtag  DW_TAG_member
     679                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     680                    .dwattr $C$DW$53, DW_AT_name("positiveTerminalInput")
     681                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("positiveTerminalInput")
     682                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     684                    .dwattr $C$DW$53, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     685                    .dwattr $C$DW$53, DW_AT_decl_line(0x53)
     686                    .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     687            $C$DW$54        .dwtag  DW_TAG_member
     688                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     689                    .dwattr $C$DW$54, DW_AT_name("negativeTerminalInput")
     690                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("negativeTerminalInput")
     691                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     692                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     693                    .dwattr $C$DW$54, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     694                    .dwattr $C$DW$54, DW_AT_decl_line(0x67)
     695                    .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     696            $C$DW$55        .dwtag  DW_TAG_member
     697                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$29)
     698                    .dwattr $C$DW$55, DW_AT_name("powerModeSelect")
     699                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("powerModeSelect")
     700                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     701                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     702                    .dwattr $C$DW$55, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     703                    .dwattr $C$DW$55, DW_AT_decl_line(0x6d)
     704                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     705            $C$DW$56        .dwtag  DW_TAG_member
     706                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     707                    .dwattr $C$DW$56, DW_AT_name("outputFilterEnableAndDelayLevel")
     708                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("outputFilterEnableAndDelayLevel")
     709                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     710                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     711                    .dwattr $C$DW$56, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     712                    .dwattr $C$DW$56, DW_AT_decl_line(0x77)
     713                    .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     714            $C$DW$57        .dwtag  DW_TAG_member
     715                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$29)
     716                    .dwattr $C$DW$57, DW_AT_name("invertedOutputPolarity")
     717                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("invertedOutputPolarity")
     718                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     719                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     720                    .dwattr $C$DW$57, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     721                    .dwattr $C$DW$57, DW_AT_decl_line(0x7c)
     722                    .dwattr $C$DW$57, DW_AT_decl_column(0x0e)
     723                    .dwendtag $C$DW$T$32
     724            
     725                    .dwattr $C$DW$T$32, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     726                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x3e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   15

     727                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
     728            $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("Comp_B_initializeParam")
     729                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$32)
     730                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
     731                    .dwattr $C$DW$T$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/comp_b.h")
     732                    .dwattr $C$DW$T$77, DW_AT_decl_line(0x7d)
     733                    .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
     734            
     735            $C$DW$T$33      .dwtag  DW_TAG_structure_type
     736                    .dwattr $C$DW$T$33, DW_AT_name("DMA_initializeParam")
     737                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x0a)
     738            $C$DW$58        .dwtag  DW_TAG_member
     739                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     740                    .dwattr $C$DW$58, DW_AT_name("channelSelect")
     741                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("channelSelect")
     742                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     744                    .dwattr $C$DW$58, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     745                    .dwattr $C$DW$58, DW_AT_decl_line(0x4a)
     746                    .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     747            $C$DW$59        .dwtag  DW_TAG_member
     748                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$29)
     749                    .dwattr $C$DW$59, DW_AT_name("transferModeSelect")
     750                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("transferModeSelect")
     751                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     752                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     753                    .dwattr $C$DW$59, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     754                    .dwattr $C$DW$59, DW_AT_decl_line(0x53)
     755                    .dwattr $C$DW$59, DW_AT_decl_column(0x0e)
     756            $C$DW$60        .dwtag  DW_TAG_member
     757                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$29)
     758                    .dwattr $C$DW$60, DW_AT_name("transferSize")
     759                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("transferSize")
     760                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     761                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     762                    .dwattr $C$DW$60, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     763                    .dwattr $C$DW$60, DW_AT_decl_line(0x57)
     764                    .dwattr $C$DW$60, DW_AT_decl_column(0x0e)
     765            $C$DW$61        .dwtag  DW_TAG_member
     766                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     767                    .dwattr $C$DW$61, DW_AT_name("triggerSourceSelect")
     768                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("triggerSourceSelect")
     769                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     770                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     771                    .dwattr $C$DW$61, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     772                    .dwattr $C$DW$61, DW_AT_decl_line(0x7b)
     773                    .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     774            $C$DW$62        .dwtag  DW_TAG_member
     775                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     776                    .dwattr $C$DW$62, DW_AT_name("transferUnitSelect")
     777                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("transferUnitSelect")
     778                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     779                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     780                    .dwattr $C$DW$62, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     781                    .dwattr $C$DW$62, DW_AT_decl_line(0x82)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     782                    .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     783            $C$DW$63        .dwtag  DW_TAG_member
     784                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     785                    .dwattr $C$DW$63, DW_AT_name("triggerTypeSelect")
     786                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("triggerTypeSelect")
     787                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     788                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     789                    .dwattr $C$DW$63, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     790                    .dwattr $C$DW$63, DW_AT_decl_line(0x88)
     791                    .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     792                    .dwendtag $C$DW$T$33
     793            
     794                    .dwattr $C$DW$T$33, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     795                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x3e)
     796                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
     797            $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("DMA_initializeParam")
     798                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$33)
     799                    .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     800                    .dwattr $C$DW$T$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/dma.h")
     801                    .dwattr $C$DW$T$78, DW_AT_decl_line(0x89)
     802                    .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
     803            
     804            $C$DW$T$34      .dwtag  DW_TAG_structure_type
     805                    .dwattr $C$DW$T$34, DW_AT_name("PMAP_initPortsParam")
     806                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
     807            $C$DW$64        .dwtag  DW_TAG_member
     808                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     809                    .dwattr $C$DW$64, DW_AT_name("portMapping")
     810                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("portMapping")
     811                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     813                    .dwattr $C$DW$64, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     814                    .dwattr $C$DW$64, DW_AT_decl_line(0x41)
     815                    .dwattr $C$DW$64, DW_AT_decl_column(0x14)
     816            $C$DW$65        .dwtag  DW_TAG_member
     817                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
     818                    .dwattr $C$DW$65, DW_AT_name("PxMAPy")
     819                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("PxMAPy")
     820                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     821                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     822                    .dwattr $C$DW$65, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     823                    .dwattr $C$DW$65, DW_AT_decl_line(0x43)
     824                    .dwattr $C$DW$65, DW_AT_decl_column(0x0e)
     825            $C$DW$66        .dwtag  DW_TAG_member
     826                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     827                    .dwattr $C$DW$66, DW_AT_name("numberOfPorts")
     828                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("numberOfPorts")
     829                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     830                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     831                    .dwattr $C$DW$66, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     832                    .dwattr $C$DW$66, DW_AT_decl_line(0x45)
     833                    .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     834            $C$DW$67        .dwtag  DW_TAG_member
     835                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     836                    .dwattr $C$DW$67, DW_AT_name("portMapReconfigure")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     837                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("portMapReconfigure")
     838                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     839                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     840                    .dwattr $C$DW$67, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     841                    .dwattr $C$DW$67, DW_AT_decl_line(0x4a)
     842                    .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     843                    .dwendtag $C$DW$T$34
     844            
     845                    .dwattr $C$DW$T$34, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     846                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e)
     847                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
     848            $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("PMAP_initPortsParam")
     849                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$34)
     850                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     851                    .dwattr $C$DW$T$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/pmap.h")
     852                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x4b)
     853                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
     854            
     855            $C$DW$T$35      .dwtag  DW_TAG_structure_type
     856                    .dwattr $C$DW$T$35, DW_AT_name("RTC_B_configureCalendarAlarmParam")
     857                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
     858            $C$DW$68        .dwtag  DW_TAG_member
     859                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     860                    .dwattr $C$DW$68, DW_AT_name("minutesAlarm")
     861                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("minutesAlarm")
     862                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     864                    .dwattr $C$DW$68, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     865                    .dwattr $C$DW$68, DW_AT_decl_line(0x5c)
     866                    .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     867            $C$DW$69        .dwtag  DW_TAG_member
     868                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     869                    .dwattr $C$DW$69, DW_AT_name("hoursAlarm")
     870                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("hoursAlarm")
     871                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     872                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     873                    .dwattr $C$DW$69, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     874                    .dwattr $C$DW$69, DW_AT_decl_line(0x60)
     875                    .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     876            $C$DW$70        .dwtag  DW_TAG_member
     877                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     878                    .dwattr $C$DW$70, DW_AT_name("dayOfWeekAlarm")
     879                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("dayOfWeekAlarm")
     880                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     881                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     882                    .dwattr $C$DW$70, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     883                    .dwattr $C$DW$70, DW_AT_decl_line(0x64)
     884                    .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     885            $C$DW$71        .dwtag  DW_TAG_member
     886                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     887                    .dwattr $C$DW$71, DW_AT_name("dayOfMonthAlarm")
     888                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("dayOfMonthAlarm")
     889                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     890                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     891                    .dwattr $C$DW$71, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     892                    .dwattr $C$DW$71, DW_AT_decl_line(0x68)
     893                    .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     894                    .dwendtag $C$DW$T$35
     895            
     896                    .dwattr $C$DW$T$35, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     897                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x57)
     898                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
     899            $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("RTC_B_configureCalendarAlarmParam")
     900                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$35)
     901                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
     902                    .dwattr $C$DW$T$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/rtc_b.h")
     903                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x69)
     904                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
     905            
     906            $C$DW$T$36      .dwtag  DW_TAG_structure_type
     907                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initCaptureModeParam")
     908                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
     909            $C$DW$72        .dwtag  DW_TAG_member
     910                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$29)
     911                    .dwattr $C$DW$72, DW_AT_name("captureRegister")
     912                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("captureRegister")
     913                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     915                    .dwattr $C$DW$72, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     916                    .dwattr $C$DW$72, DW_AT_decl_line(0x89)
     917                    .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
     918            $C$DW$73        .dwtag  DW_TAG_member
     919                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$29)
     920                    .dwattr $C$DW$73, DW_AT_name("captureMode")
     921                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("captureMode")
     922                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     923                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     924                    .dwattr $C$DW$73, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     925                    .dwattr $C$DW$73, DW_AT_decl_line(0x90)
     926                    .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
     927            $C$DW$74        .dwtag  DW_TAG_member
     928                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$29)
     929                    .dwattr $C$DW$74, DW_AT_name("captureInputSelect")
     930                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("captureInputSelect")
     931                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     932                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     933                    .dwattr $C$DW$74, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     934                    .dwattr $C$DW$74, DW_AT_decl_line(0x97)
     935                    .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
     936            $C$DW$75        .dwtag  DW_TAG_member
     937                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$29)
     938                    .dwattr $C$DW$75, DW_AT_name("synchronizeCaptureSource")
     939                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("synchronizeCaptureSource")
     940                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     941                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     942                    .dwattr $C$DW$75, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     943                    .dwattr $C$DW$75, DW_AT_decl_line(0x9c)
     944                    .dwattr $C$DW$75, DW_AT_decl_column(0x0e)
     945            $C$DW$76        .dwtag  DW_TAG_member
     946                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$29)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     947                    .dwattr $C$DW$76, DW_AT_name("captureInterruptEnable")
     948                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("captureInterruptEnable")
     949                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     950                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     951                    .dwattr $C$DW$76, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     952                    .dwattr $C$DW$76, DW_AT_decl_line(0xa1)
     953                    .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
     954            $C$DW$77        .dwtag  DW_TAG_member
     955                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$29)
     956                    .dwattr $C$DW$77, DW_AT_name("captureOutputMode")
     957                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("captureOutputMode")
     958                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     959                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     960                    .dwattr $C$DW$77, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     961                    .dwattr $C$DW$77, DW_AT_decl_line(0xac)
     962                    .dwattr $C$DW$77, DW_AT_decl_column(0x0e)
     963                    .dwendtag $C$DW$T$36
     964            
     965                    .dwattr $C$DW$T$36, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     966                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x7d)
     967                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
     968            $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCaptureModeParam")
     969                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$36)
     970                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
     971                    .dwattr $C$DW$T$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     972                    .dwattr $C$DW$T$81, DW_AT_decl_line(0xad)
     973                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
     974            
     975            $C$DW$T$37      .dwtag  DW_TAG_structure_type
     976                    .dwattr $C$DW$T$37, DW_AT_name("Timer_A_initCompareModeParam")
     977                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
     978            $C$DW$78        .dwtag  DW_TAG_member
     979                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$29)
     980                    .dwattr $C$DW$78, DW_AT_name("compareRegister")
     981                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("compareRegister")
     982                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     984                    .dwattr $C$DW$78, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     985                    .dwattr $C$DW$78, DW_AT_decl_line(0x17a)
     986                    .dwattr $C$DW$78, DW_AT_decl_column(0x0e)
     987            $C$DW$79        .dwtag  DW_TAG_member
     988                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$29)
     989                    .dwattr $C$DW$79, DW_AT_name("compareInterruptEnable")
     990                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("compareInterruptEnable")
     991                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     992                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     993                    .dwattr $C$DW$79, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
     994                    .dwattr $C$DW$79, DW_AT_decl_line(0x17f)
     995                    .dwattr $C$DW$79, DW_AT_decl_column(0x0e)
     996            $C$DW$80        .dwtag  DW_TAG_member
     997                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$29)
     998                    .dwattr $C$DW$80, DW_AT_name("compareOutputMode")
     999                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("compareOutputMode")
    1000                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1001                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1002                    .dwattr $C$DW$80, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1003                    .dwattr $C$DW$80, DW_AT_decl_line(0x18a)
    1004                    .dwattr $C$DW$80, DW_AT_decl_column(0x0e)
    1005            $C$DW$81        .dwtag  DW_TAG_member
    1006                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$29)
    1007                    .dwattr $C$DW$81, DW_AT_name("compareValue")
    1008                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("compareValue")
    1009                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1010                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1011                    .dwattr $C$DW$81, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1012                    .dwattr $C$DW$81, DW_AT_decl_line(0x18c)
    1013                    .dwattr $C$DW$81, DW_AT_decl_column(0x0e)
    1014                    .dwendtag $C$DW$T$37
    1015            
    1016                    .dwattr $C$DW$T$37, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1017                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x16e)
    1018                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    1019            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initCompareModeParam")
    1020                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$37)
    1021                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1022                    .dwattr $C$DW$T$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1023                    .dwattr $C$DW$T$82, DW_AT_decl_line(0x18d)
    1024                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1025            
    1026            $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1027                    .dwattr $C$DW$T$39, DW_AT_name("Timer_A_initContinuousModeParam")
    1028                    .dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
    1029            $C$DW$82        .dwtag  DW_TAG_member
    1030                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
    1031                    .dwattr $C$DW$82, DW_AT_name("clockSource")
    1032                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("clockSource")
    1033                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1035                    .dwattr $C$DW$82, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1036                    .dwattr $C$DW$82, DW_AT_decl_line(0x50)
    1037                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1038            $C$DW$83        .dwtag  DW_TAG_member
    1039                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
    1040                    .dwattr $C$DW$83, DW_AT_name("clockSourceDivider")
    1041                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("clockSourceDivider")
    1042                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1043                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1044                    .dwattr $C$DW$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1045                    .dwattr $C$DW$83, DW_AT_decl_line(0x67)
    1046                    .dwattr $C$DW$83, DW_AT_decl_column(0x0e)
    1047            $C$DW$84        .dwtag  DW_TAG_member
    1048                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$29)
    1049                    .dwattr $C$DW$84, DW_AT_name("timerInterruptEnable_TAIE")
    1050                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1051                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1052                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1053                    .dwattr $C$DW$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1054                    .dwattr $C$DW$84, DW_AT_decl_line(0x6c)
    1055                    .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    1056            $C$DW$85        .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1057                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$29)
    1058                    .dwattr $C$DW$85, DW_AT_name("timerClear")
    1059                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("timerClear")
    1060                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1061                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1062                    .dwattr $C$DW$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1063                    .dwattr $C$DW$85, DW_AT_decl_line(0x72)
    1064                    .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1065            $C$DW$86        .dwtag  DW_TAG_member
    1066                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$38)
    1067                    .dwattr $C$DW$86, DW_AT_name("startTimer")
    1068                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("startTimer")
    1069                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1070                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1071                    .dwattr $C$DW$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1072                    .dwattr $C$DW$86, DW_AT_decl_line(0x74)
    1073                    .dwattr $C$DW$86, DW_AT_decl_column(0x0a)
    1074                    .dwendtag $C$DW$T$39
    1075            
    1076                    .dwattr $C$DW$T$39, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1077                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x48)
    1078                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    1079            $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initContinuousModeParam")
    1080                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
    1081                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1082                    .dwattr $C$DW$T$83, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1083                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x75)
    1084                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1085            
    1086            $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1087                    .dwattr $C$DW$T$40, DW_AT_name("Timer_A_initUpDownModeParam")
    1088                    .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    1089            $C$DW$87        .dwtag  DW_TAG_member
    1090                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
    1091                    .dwattr $C$DW$87, DW_AT_name("clockSource")
    1092                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("clockSource")
    1093                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1095                    .dwattr $C$DW$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1096                    .dwattr $C$DW$87, DW_AT_decl_line(0xbd)
    1097                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1098            $C$DW$88        .dwtag  DW_TAG_member
    1099                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$29)
    1100                    .dwattr $C$DW$88, DW_AT_name("clockSourceDivider")
    1101                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("clockSourceDivider")
    1102                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1103                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1104                    .dwattr $C$DW$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1105                    .dwattr $C$DW$88, DW_AT_decl_line(0xd4)
    1106                    .dwattr $C$DW$88, DW_AT_decl_column(0x0e)
    1107            $C$DW$89        .dwtag  DW_TAG_member
    1108                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$29)
    1109                    .dwattr $C$DW$89, DW_AT_name("timerPeriod")
    1110                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("timerPeriod")
    1111                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1112                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1113                    .dwattr $C$DW$89, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1114                    .dwattr $C$DW$89, DW_AT_decl_line(0xd6)
    1115                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
    1116            $C$DW$90        .dwtag  DW_TAG_member
    1117                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$29)
    1118                    .dwattr $C$DW$90, DW_AT_name("timerInterruptEnable_TAIE")
    1119                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1120                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1121                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1122                    .dwattr $C$DW$90, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1123                    .dwattr $C$DW$90, DW_AT_decl_line(0xdb)
    1124                    .dwattr $C$DW$90, DW_AT_decl_column(0x0e)
    1125            $C$DW$91        .dwtag  DW_TAG_member
    1126                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$29)
    1127                    .dwattr $C$DW$91, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1128                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1129                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1130                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1131                    .dwattr $C$DW$91, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1132                    .dwattr $C$DW$91, DW_AT_decl_line(0xe0)
    1133                    .dwattr $C$DW$91, DW_AT_decl_column(0x0e)
    1134            $C$DW$92        .dwtag  DW_TAG_member
    1135                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$29)
    1136                    .dwattr $C$DW$92, DW_AT_name("timerClear")
    1137                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("timerClear")
    1138                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1139                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1140                    .dwattr $C$DW$92, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1141                    .dwattr $C$DW$92, DW_AT_decl_line(0xe6)
    1142                    .dwattr $C$DW$92, DW_AT_decl_column(0x0e)
    1143            $C$DW$93        .dwtag  DW_TAG_member
    1144                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$38)
    1145                    .dwattr $C$DW$93, DW_AT_name("startTimer")
    1146                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("startTimer")
    1147                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1148                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1149                    .dwattr $C$DW$93, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1150                    .dwattr $C$DW$93, DW_AT_decl_line(0xe8)
    1151                    .dwattr $C$DW$93, DW_AT_decl_column(0x0a)
    1152                    .dwendtag $C$DW$T$40
    1153            
    1154                    .dwattr $C$DW$T$40, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1155                    .dwattr $C$DW$T$40, DW_AT_decl_line(0xb5)
    1156                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    1157            $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpDownModeParam")
    1158                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$40)
    1159                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1160                    .dwattr $C$DW$T$84, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1161                    .dwattr $C$DW$T$84, DW_AT_decl_line(0xe9)
    1162                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1163            
    1164            $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1165                    .dwattr $C$DW$T$41, DW_AT_name("Timer_A_initUpModeParam")
    1166                    .dwattr $C$DW$T$41, DW_AT_byte_size(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1167            $C$DW$94        .dwtag  DW_TAG_member
    1168                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$29)
    1169                    .dwattr $C$DW$94, DW_AT_name("clockSource")
    1170                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("clockSource")
    1171                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1173                    .dwattr $C$DW$94, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1174                    .dwattr $C$DW$94, DW_AT_decl_line(0x139)
    1175                    .dwattr $C$DW$94, DW_AT_decl_column(0x0e)
    1176            $C$DW$95        .dwtag  DW_TAG_member
    1177                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
    1178                    .dwattr $C$DW$95, DW_AT_name("clockSourceDivider")
    1179                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("clockSourceDivider")
    1180                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1181                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1182                    .dwattr $C$DW$95, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1183                    .dwattr $C$DW$95, DW_AT_decl_line(0x150)
    1184                    .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1185            $C$DW$96        .dwtag  DW_TAG_member
    1186                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$29)
    1187                    .dwattr $C$DW$96, DW_AT_name("timerPeriod")
    1188                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("timerPeriod")
    1189                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1190                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1191                    .dwattr $C$DW$96, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1192                    .dwattr $C$DW$96, DW_AT_decl_line(0x153)
    1193                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1194            $C$DW$97        .dwtag  DW_TAG_member
    1195                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1196                    .dwattr $C$DW$97, DW_AT_name("timerInterruptEnable_TAIE")
    1197                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    1198                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1199                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1200                    .dwattr $C$DW$97, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1201                    .dwattr $C$DW$97, DW_AT_decl_line(0x158)
    1202                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1203            $C$DW$98        .dwtag  DW_TAG_member
    1204                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$29)
    1205                    .dwattr $C$DW$98, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    1206                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    1207                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1208                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1209                    .dwattr $C$DW$98, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1210                    .dwattr $C$DW$98, DW_AT_decl_line(0x15d)
    1211                    .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1212            $C$DW$99        .dwtag  DW_TAG_member
    1213                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$29)
    1214                    .dwattr $C$DW$99, DW_AT_name("timerClear")
    1215                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("timerClear")
    1216                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1217                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1218                    .dwattr $C$DW$99, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1219                    .dwattr $C$DW$99, DW_AT_decl_line(0x163)
    1220                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1221            $C$DW$100       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1222                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$38)
    1223                    .dwattr $C$DW$100, DW_AT_name("startTimer")
    1224                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("startTimer")
    1225                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1226                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1227                    .dwattr $C$DW$100, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1228                    .dwattr $C$DW$100, DW_AT_decl_line(0x165)
    1229                    .dwattr $C$DW$100, DW_AT_decl_column(0x0a)
    1230                    .dwendtag $C$DW$T$41
    1231            
    1232                    .dwattr $C$DW$T$41, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1233                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x131)
    1234                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1235            $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_initUpModeParam")
    1236                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$41)
    1237                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1238                    .dwattr $C$DW$T$85, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1239                    .dwattr $C$DW$T$85, DW_AT_decl_line(0x166)
    1240                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1241            
    1242            $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1243                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    1244                    .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
    1245            $C$DW$101       .dwtag  DW_TAG_member
    1246                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$29)
    1247                    .dwattr $C$DW$101, DW_AT_name("clockSource")
    1248                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("clockSource")
    1249                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1251                    .dwattr $C$DW$101, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1252                    .dwattr $C$DW$101, DW_AT_decl_line(0xf8)
    1253                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1254            $C$DW$102       .dwtag  DW_TAG_member
    1255                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
    1256                    .dwattr $C$DW$102, DW_AT_name("clockSourceDivider")
    1257                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("clockSourceDivider")
    1258                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1259                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1260                    .dwattr $C$DW$102, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1261                    .dwattr $C$DW$102, DW_AT_decl_line(0x10f)
    1262                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1263            $C$DW$103       .dwtag  DW_TAG_member
    1264                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$29)
    1265                    .dwattr $C$DW$103, DW_AT_name("timerPeriod")
    1266                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("timerPeriod")
    1267                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1268                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1269                    .dwattr $C$DW$103, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1270                    .dwattr $C$DW$103, DW_AT_decl_line(0x111)
    1271                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1272            $C$DW$104       .dwtag  DW_TAG_member
    1273                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$29)
    1274                    .dwattr $C$DW$104, DW_AT_name("compareRegister")
    1275                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("compareRegister")
    1276                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1277                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1278                    .dwattr $C$DW$104, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1279                    .dwattr $C$DW$104, DW_AT_decl_line(0x11c)
    1280                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1281            $C$DW$105       .dwtag  DW_TAG_member
    1282                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$29)
    1283                    .dwattr $C$DW$105, DW_AT_name("compareOutputMode")
    1284                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("compareOutputMode")
    1285                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1286                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1287                    .dwattr $C$DW$105, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1288                    .dwattr $C$DW$105, DW_AT_decl_line(0x127)
    1289                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1290            $C$DW$106       .dwtag  DW_TAG_member
    1291                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
    1292                    .dwattr $C$DW$106, DW_AT_name("dutyCycle")
    1293                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("dutyCycle")
    1294                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1295                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1296                    .dwattr $C$DW$106, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1297                    .dwattr $C$DW$106, DW_AT_decl_line(0x129)
    1298                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1299                    .dwendtag $C$DW$T$42
    1300            
    1301                    .dwattr $C$DW$T$42, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1302                    .dwattr $C$DW$T$42, DW_AT_decl_line(0xf0)
    1303                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    1304            $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_A_outputPWMParam")
    1305                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$42)
    1306                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1307                    .dwattr $C$DW$T$86, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_a.h")
    1308                    .dwattr $C$DW$T$86, DW_AT_decl_line(0x12a)
    1309                    .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1310            
    1311            $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1312                    .dwattr $C$DW$T$43, DW_AT_name("Timer_B_initCaptureModeParam")
    1313                    .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
    1314            $C$DW$107       .dwtag  DW_TAG_member
    1315                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    1316                    .dwattr $C$DW$107, DW_AT_name("captureRegister")
    1317                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("captureRegister")
    1318                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1320                    .dwattr $C$DW$107, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1321                    .dwattr $C$DW$107, DW_AT_decl_line(0xd1)
    1322                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1323            $C$DW$108       .dwtag  DW_TAG_member
    1324                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$29)
    1325                    .dwattr $C$DW$108, DW_AT_name("captureMode")
    1326                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("captureMode")
    1327                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1328                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1329                    .dwattr $C$DW$108, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1330                    .dwattr $C$DW$108, DW_AT_decl_line(0xd8)
    1331                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1332            $C$DW$109       .dwtag  DW_TAG_member
    1333                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$29)
    1334                    .dwattr $C$DW$109, DW_AT_name("captureInputSelect")
    1335                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("captureInputSelect")
    1336                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1337                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1338                    .dwattr $C$DW$109, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1339                    .dwattr $C$DW$109, DW_AT_decl_line(0xdf)
    1340                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1341            $C$DW$110       .dwtag  DW_TAG_member
    1342                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$29)
    1343                    .dwattr $C$DW$110, DW_AT_name("synchronizeCaptureSource")
    1344                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    1345                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1346                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1347                    .dwattr $C$DW$110, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1348                    .dwattr $C$DW$110, DW_AT_decl_line(0xe4)
    1349                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1350            $C$DW$111       .dwtag  DW_TAG_member
    1351                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$29)
    1352                    .dwattr $C$DW$111, DW_AT_name("captureInterruptEnable")
    1353                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("captureInterruptEnable")
    1354                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1355                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1356                    .dwattr $C$DW$111, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1357                    .dwattr $C$DW$111, DW_AT_decl_line(0xe9)
    1358                    .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1359            $C$DW$112       .dwtag  DW_TAG_member
    1360                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$29)
    1361                    .dwattr $C$DW$112, DW_AT_name("captureOutputMode")
    1362                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("captureOutputMode")
    1363                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1364                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1365                    .dwattr $C$DW$112, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1366                    .dwattr $C$DW$112, DW_AT_decl_line(0xf4)
    1367                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1368                    .dwendtag $C$DW$T$43
    1369            
    1370                    .dwattr $C$DW$T$43, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1371                    .dwattr $C$DW$T$43, DW_AT_decl_line(0xc5)
    1372                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    1373            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCaptureModeParam")
    1374                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$43)
    1375                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1376                    .dwattr $C$DW$T$87, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1377                    .dwattr $C$DW$T$87, DW_AT_decl_line(0xf5)
    1378                    .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1379            
    1380            $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1381                    .dwattr $C$DW$T$44, DW_AT_name("Timer_B_initCompareModeParam")
    1382                    .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    1383            $C$DW$113       .dwtag  DW_TAG_member
    1384                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1385                    .dwattr $C$DW$113, DW_AT_name("compareRegister")
    1386                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("compareRegister")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1387                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1389                    .dwattr $C$DW$113, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1390                    .dwattr $C$DW$113, DW_AT_decl_line(0x17a)
    1391                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1392            $C$DW$114       .dwtag  DW_TAG_member
    1393                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$29)
    1394                    .dwattr $C$DW$114, DW_AT_name("compareInterruptEnable")
    1395                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("compareInterruptEnable")
    1396                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1397                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1398                    .dwattr $C$DW$114, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1399                    .dwattr $C$DW$114, DW_AT_decl_line(0x17f)
    1400                    .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1401            $C$DW$115       .dwtag  DW_TAG_member
    1402                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1403                    .dwattr $C$DW$115, DW_AT_name("compareOutputMode")
    1404                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("compareOutputMode")
    1405                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1406                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1407                    .dwattr $C$DW$115, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1408                    .dwattr $C$DW$115, DW_AT_decl_line(0x18a)
    1409                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1410            $C$DW$116       .dwtag  DW_TAG_member
    1411                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    1412                    .dwattr $C$DW$116, DW_AT_name("compareValue")
    1413                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("compareValue")
    1414                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1415                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1416                    .dwattr $C$DW$116, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1417                    .dwattr $C$DW$116, DW_AT_decl_line(0x18c)
    1418                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1419                    .dwendtag $C$DW$T$44
    1420            
    1421                    .dwattr $C$DW$T$44, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1422                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x16e)
    1423                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    1424            $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCompareModeParam")
    1425                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$44)
    1426                    .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1427                    .dwattr $C$DW$T$88, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1428                    .dwattr $C$DW$T$88, DW_AT_decl_line(0x18d)
    1429                    .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1430            
    1431            $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1432                    .dwattr $C$DW$T$45, DW_AT_name("Timer_B_initContinuousModeParam")
    1433                    .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    1434            $C$DW$117       .dwtag  DW_TAG_member
    1435                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1436                    .dwattr $C$DW$117, DW_AT_name("clockSource")
    1437                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("clockSource")
    1438                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1440                    .dwattr $C$DW$117, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1441                    .dwattr $C$DW$117, DW_AT_decl_line(0x105)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1442                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1443            $C$DW$118       .dwtag  DW_TAG_member
    1444                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1445                    .dwattr $C$DW$118, DW_AT_name("clockSourceDivider")
    1446                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("clockSourceDivider")
    1447                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1448                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1449                    .dwattr $C$DW$118, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1450                    .dwattr $C$DW$118, DW_AT_decl_line(0x11c)
    1451                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1452            $C$DW$119       .dwtag  DW_TAG_member
    1453                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
    1454                    .dwattr $C$DW$119, DW_AT_name("timerInterruptEnable_TBIE")
    1455                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
    1456                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1457                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1458                    .dwattr $C$DW$119, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1459                    .dwattr $C$DW$119, DW_AT_decl_line(0x121)
    1460                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1461            $C$DW$120       .dwtag  DW_TAG_member
    1462                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$29)
    1463                    .dwattr $C$DW$120, DW_AT_name("timerClear")
    1464                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("timerClear")
    1465                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1466                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1467                    .dwattr $C$DW$120, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1468                    .dwattr $C$DW$120, DW_AT_decl_line(0x127)
    1469                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1470            $C$DW$121       .dwtag  DW_TAG_member
    1471                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$38)
    1472                    .dwattr $C$DW$121, DW_AT_name("startTimer")
    1473                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("startTimer")
    1474                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1475                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1476                    .dwattr $C$DW$121, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1477                    .dwattr $C$DW$121, DW_AT_decl_line(0x129)
    1478                    .dwattr $C$DW$121, DW_AT_decl_column(0x0a)
    1479                    .dwendtag $C$DW$T$45
    1480            
    1481                    .dwattr $C$DW$T$45, DW_AT_decl_file("/work/c1202-firmware/driverlib/timer_b.h")
    1482                    .dwattr $C$DW$T$45, DW_AT_decl_line(0xfd)
    1483                    .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1484            $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initContinuousModeParam")
    1485                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$45)
    1486                    .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
