MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 11:28:30 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../serial.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("putch")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("putch")
      15                    .dwattr $C$DW$1, DW_AT_declaration
      16                    .dwattr $C$DW$1, DW_AT_external

    1893                    .dwattr $C$DW$130, DW_AT_high_pc(0x00)
    1894                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("put_ui8_arr")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   41

    1895                    .dwattr $C$DW$130, DW_AT_external
    1896                    .dwattr $C$DW$130, DW_AT_TI_begin_file("../serial.c")
    1897                    .dwattr $C$DW$130, DW_AT_TI_begin_line(0xf6)
    1898                    .dwattr $C$DW$130, DW_AT_TI_begin_column(0x06)
    1899                    .dwattr $C$DW$130, DW_AT_decl_file("../serial.c")
    1900                    .dwattr $C$DW$130, DW_AT_decl_line(0xf6)
    1901                    .dwattr $C$DW$130, DW_AT_decl_column(0x06)
    1902                    .dwattr $C$DW$130, DW_AT_TI_max_frame_size(0x08)
    1903                    .dwpsn  file "../serial.c",line 246,column 33,is_stmt,address put_ui8_arr,isa 0
    1904            
    1905                    .dwfde $C$DW$CIE, put_ui8_arr
    1906            $C$DW$131       .dwtag  DW_TAG_formal_parameter, DW_AT_name("In")
    1907                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("In")
    1908                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$31)
    1909                    .dwattr $C$DW$131, DW_AT_location[DW_OP_reg12]
    1910            
    1911            ;*****************************************************************************
    1912            ;* FUNCTION NAME: put_ui8_arr                                                *
    1913            ;*                                                                           *
    1914            ;*   Regs Modified     : SP,SR                                               *
    1915            ;*   Regs Used         : SP,SR,r12                                           *
    1916            ;*   Local Frame Size  : 0 Args + 4 Auto + 0 Save = 4 byte                   *
    1917            ;*****************************************************************************
    1918 000000       put_ui8_arr:
    1919            ;* --------------------------------------------------------------------------*
    1920                    .dwcfi  cfa_offset, 4
    1921                    .dwcfi  save_reg_to_mem, 16, -4
    1922 000000 00B1          SUBA      #4,SP                 ; [] 
         000002 0004 
    1923                    .dwcfi  cfa_offset, 8
    1924            $C$DW$132       .dwtag  DW_TAG_variable, DW_AT_name("In")
    1925                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("In")
    1926                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$31)
    1927                    .dwattr $C$DW$132, DW_AT_location[DW_OP_breg1 0]
    1928 000004 0C71          MOVX.A    r12,0(SP)             ; [] |246| 
         000006 0000 
    1929                    .dwpsn  file "../serial.c",line 248,column 1,is_stmt,isa 0
    1930 000008 00A1          ADDA      #4,SP                 ; [] 
         00000a 0004 
    1931                    .dwcfi  cfa_offset, 4
    1932            $C$DW$133       .dwtag  DW_TAG_TI_branch
    1933                    .dwattr $C$DW$133, DW_AT_low_pc(0x00)
    1934                    .dwattr $C$DW$133, DW_AT_TI_return
    1935 00000c 0110          RETA      ; [] 
    1936                    ; [] 
    1937                    .dwattr $C$DW$130, DW_AT_TI_end_file("../serial.c")
    1938                    .dwattr $C$DW$130, DW_AT_TI_end_line(0xf8)
    1939                    .dwattr $C$DW$130, DW_AT_TI_end_column(0x01)
    1940                    .dwendentry
    1941                    .dwendtag $C$DW$130
    1942            
    1943            ;*****************************************************************************
    1944            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1945            ;*****************************************************************************
    1946                    .global putch
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   42

    1947                    .global __mspabi_divu
    1948                    .global __mspabi_remu
    1949            
    1950            ;******************************************************************************
    1951            ;* BUILD ATTRIBUTES                                                           *
    1952            ;******************************************************************************
    1953                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    1954                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000000000000000000
    1955                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(1)
    1956                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1957                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1958                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1959            
    1960            ;******************************************************************************
    1961            ;* TYPE INFORMATION                                                           *
    1962            ;******************************************************************************
    1963            
    1964            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1965                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    1966            $C$DW$134       .dwtag  DW_TAG_member
    1967                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1968                    .dwattr $C$DW$134, DW_AT_name("base_ptr")
    1969                    .dwattr $C$DW$134, DW_AT_TI_symbol_name("base_ptr")
    1970                    .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971                    .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1972                    .dwattr $C$DW$134, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1973                    .dwattr $C$DW$134, DW_AT_decl_line(0x15)
    1974                    .dwattr $C$DW$134, DW_AT_decl_column(0x14)
    1975            $C$DW$135       .dwtag  DW_TAG_member
    1976                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
    1977                    .dwattr $C$DW$135, DW_AT_name("start_ptr")
    1978                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("start_ptr")
    1979                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1980                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1981                    .dwattr $C$DW$135, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1982                    .dwattr $C$DW$135, DW_AT_decl_line(0x16)
    1983                    .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    1984            $C$DW$136       .dwtag  DW_TAG_member
    1985                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$23)
    1986                    .dwattr $C$DW$136, DW_AT_name("max_len")
    1987                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("max_len")
    1988                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1989                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1990                    .dwattr $C$DW$136, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    1991                    .dwattr $C$DW$136, DW_AT_decl_line(0x17)
    1992                    .dwattr $C$DW$136, DW_AT_decl_column(0x18)
    1993            $C$DW$137       .dwtag  DW_TAG_member
    1994                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1995                    .dwattr $C$DW$137, DW_AT_name("len")
    1996                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("len")
    1997                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1998                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1999                    .dwattr $C$DW$137, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2000                    .dwattr $C$DW$137, DW_AT_decl_line(0x18)
    2001                    .dwattr $C$DW$137, DW_AT_decl_column(0x12)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   43

    2002                    .dwendtag $C$DW$T$24
    2003            
    2004                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2005                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
    2006                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2007            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
    2008                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
    2009                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2010                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2011                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x19)
    2012                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2013            $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2014                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2015                    .dwattr $C$DW$T$31, DW_AT_address_class(0x14)
    2016            
    2017            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2018                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    2019            $C$DW$138       .dwtag  DW_TAG_member
    2020                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$10)
    2021                    .dwattr $C$DW$138, DW_AT_name("fd")
    2022                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("fd")
    2023                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2025                    .dwattr $C$DW$138, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2026                    .dwattr $C$DW$138, DW_AT_decl_line(0x49)
    2027                    .dwattr $C$DW$138, DW_AT_decl_column(0x0b)
    2028            $C$DW$139       .dwtag  DW_TAG_member
    2029                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    2030                    .dwattr $C$DW$139, DW_AT_name("buf")
    2031                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("buf")
    2032                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2033                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2034                    .dwattr $C$DW$139, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2035                    .dwattr $C$DW$139, DW_AT_decl_line(0x4a)
    2036                    .dwattr $C$DW$139, DW_AT_decl_column(0x16)
    2037            $C$DW$140       .dwtag  DW_TAG_member
    2038                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$25)
    2039                    .dwattr $C$DW$140, DW_AT_name("pos")
    2040                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("pos")
    2041                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2042                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2043                    .dwattr $C$DW$140, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2044                    .dwattr $C$DW$140, DW_AT_decl_line(0x4b)
    2045                    .dwattr $C$DW$140, DW_AT_decl_column(0x16)
    2046            $C$DW$141       .dwtag  DW_TAG_member
    2047                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$25)
    2048                    .dwattr $C$DW$141, DW_AT_name("bufend")
    2049                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("bufend")
    2050                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2051                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2052                    .dwattr $C$DW$141, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2053                    .dwattr $C$DW$141, DW_AT_decl_line(0x4c)
    2054                    .dwattr $C$DW$141, DW_AT_decl_column(0x16)
    2055            $C$DW$142       .dwtag  DW_TAG_member
    2056                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$25)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   44

    2057                    .dwattr $C$DW$142, DW_AT_name("buff_stop")
    2058                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("buff_stop")
    2059                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2060                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2061                    .dwattr $C$DW$142, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2062                    .dwattr $C$DW$142, DW_AT_decl_line(0x4d)
    2063                    .dwattr $C$DW$142, DW_AT_decl_column(0x16)
    2064            $C$DW$143       .dwtag  DW_TAG_member
    2065                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$11)
    2066                    .dwattr $C$DW$143, DW_AT_name("flags")
    2067                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("flags")
    2068                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2069                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2070                    .dwattr $C$DW$143, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2071                    .dwattr $C$DW$143, DW_AT_decl_line(0x4e)
    2072                    .dwattr $C$DW$143, DW_AT_decl_column(0x16)
    2073                    .dwendtag $C$DW$T$26
    2074            
    2075                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2076                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
    2077                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2078            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2079                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    2080                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2081                    .dwattr $C$DW$T$32, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2082                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x4f)
    2083                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2084            
    2085            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2086                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2087            $C$DW$144       .dwtag  DW_TAG_member
    2088                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$10)
    2089                    .dwattr $C$DW$144, DW_AT_name("quot")
    2090                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("quot")
    2091                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2093                    .dwattr $C$DW$144, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2094                    .dwattr $C$DW$144, DW_AT_decl_line(0x46)
    2095                    .dwattr $C$DW$144, DW_AT_decl_column(0x16)
    2096            $C$DW$145       .dwtag  DW_TAG_member
    2097                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$10)
    2098                    .dwattr $C$DW$145, DW_AT_name("rem")
    2099                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("rem")
    2100                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2101                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2102                    .dwattr $C$DW$145, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2103                    .dwattr $C$DW$145, DW_AT_decl_line(0x46)
    2104                    .dwattr $C$DW$145, DW_AT_decl_column(0x1c)
    2105                    .dwendtag $C$DW$T$27
    2106            
    2107                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2108                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x46)
    2109                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2110            $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2111                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   45

    2112                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2113                    .dwattr $C$DW$T$33, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2114                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x46)
    2115                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x23)
    2116            
    2117            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2118                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    2119            $C$DW$146       .dwtag  DW_TAG_member
    2120                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$12)
    2121                    .dwattr $C$DW$146, DW_AT_name("quot")
    2122                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("quot")
    2123                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2125                    .dwattr $C$DW$146, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2126                    .dwattr $C$DW$146, DW_AT_decl_line(0x48)
    2127                    .dwattr $C$DW$146, DW_AT_decl_column(0x17)
    2128            $C$DW$147       .dwtag  DW_TAG_member
    2129                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$12)
    2130                    .dwattr $C$DW$147, DW_AT_name("rem")
    2131                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("rem")
    2132                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2133                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2134                    .dwattr $C$DW$147, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2135                    .dwattr $C$DW$147, DW_AT_decl_line(0x48)
    2136                    .dwattr $C$DW$147, DW_AT_decl_column(0x1d)
    2137                    .dwendtag $C$DW$T$28
    2138            
    2139                    .dwattr $C$DW$T$28, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2140                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    2141                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2142            $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2143                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$28)
    2144                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2145                    .dwattr $C$DW$T$34, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2146                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x48)
    2147                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x24)
    2148            
    2149            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2150                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2151            $C$DW$148       .dwtag  DW_TAG_member
    2152                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$14)
    2153                    .dwattr $C$DW$148, DW_AT_name("quot")
    2154                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("quot")
    2155                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2157                    .dwattr $C$DW$148, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2158                    .dwattr $C$DW$148, DW_AT_decl_line(0x4b)
    2159                    .dwattr $C$DW$148, DW_AT_decl_column(0x1c)
    2160            $C$DW$149       .dwtag  DW_TAG_member
    2161                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$14)
    2162                    .dwattr $C$DW$149, DW_AT_name("rem")
    2163                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("rem")
    2164                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2165                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2166                    .dwattr $C$DW$149, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
MSP430 Assembler Unix v4.4.3 Wed Mar 11 11:28:30 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   46

    2167                    .dwattr $C$DW$149, DW_AT_decl_line(0x4b)
    2168                    .dwattr $C$DW$149, DW_AT_decl_column(0x22)
    2169                    .dwendtag $C$DW$T$29
    2170            
    2171                    .dwattr $C$DW$T$29, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2172                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x4b)
    2173                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2174            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2175                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$29)
    2176                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2177                    .dwattr $C$DW$T$35, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2178                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x4b)
    2179                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x29)
    2180            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2181                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2182            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2183                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2184                    .dwattr $C$DW$T$3, DW_AT_address_class(0x14)
    2185            
    2186            $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
    2187                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2188            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2189                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2190                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
    2191            $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    2192                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2193                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2194                    .dwattr $C$DW$T$43, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2195                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x9a)
    2196                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x14)
    2197            $C$DW$150       .dwtag  DW_TAG_TI_far_type
    2198                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$2)
    2199            $C$DW$T$44      .dwtag  DW_TAG_const_type
    2200                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$150)
    2201            $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2202                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2203                    .dwattr $C$DW$T$45, DW_AT_address_class(0x14)
    2204            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2205                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2206                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2207                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2208            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2209                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2210                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2211                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2212            $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2213                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$5)
    2214                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
