MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
       3            ;* Date/Time created: Wed Mar 11 17:15:22 2015                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../serial.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("/work/c1202-firmware/msp430-OTP/Debug")
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("putch")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("putch")
      15                    .dwattr $C$DW$1, DW_AT_declaration
      16                    .dwattr $C$DW$1, DW_AT_external

    2042                    .dwpsn  file "../serial.c",line 261,column 5,is_stmt,isa 0
    2043 00006c 411E          MOV.W     8(SP),r14             ; [] |261| 
         00006e 0008 
    2044 000070 0ECF          MOVA      r14,r15               ; [] |261| 
    2045 000072 831F          SUB.W     #1,r15                ; [] |261| 
    2046 000074 4F81          MOV.W     r15,8(SP)             ; [] |261| 
         000076 0008 
    2047 000078 930E          TST.W     r14                   ; [] |261| 
    2048 00007a 240F          JEQ       $C$L53                ; [] |261| 
    2049                                                      ; [] |261| 
    2050            ;* --------------------------------------------------------------------------*
    2051            ;*   BEGIN LOOP $C$L52
    2052            ;*
    2053            ;*   Loop source line                : 261
    2054            ;*   Loop closing brace source line  : 263
    2055            ;*   Known Minimum Trip Count        : 1
    2056            ;*   Known Maximum Trip Count        : 4294967295
    2057            ;*   Known Max Trip Count Factor     : 1
    2058            ;* --------------------------------------------------------------------------*
    2059 00007c       $C$L52:    
    2060                    .dwpsn  file "../serial.c",line 262,column 9,is_stmt,isa 0
    2061 00007c 013F          MOVX.A    10(SP),r15            ; [] |262| 
         00007e 000A 
    2062 000080 4F7C          MOV.B     @r15+,r12             ; [] |262| 
    2063 000082 0F71          MOVX.A    r15,10(SP)            ; [] |262| 
         000084 000A 
    2064            $C$DW$146       .dwtag  DW_TAG_TI_branch
    2065                    .dwattr $C$DW$146, DW_AT_low_pc(0x00)
    2066                    .dwattr $C$DW$146, DW_AT_name("putch")
    2067                    .dwattr $C$DW$146, DW_AT_TI_call
    2068 000086 13B0!         CALLA     #putch                ; [] |262| 
         000088 0000 
    2069                                                      ; [] |262| 
    2070                    .dwpsn  file "../serial.c",line 261,column 5,is_stmt,isa 0
    2071 00008a 411E          MOV.W     8(SP),r14             ; [] |261| 
         00008c 0008 
    2072 00008e 0ECF          MOVA      r14,r15               ; [] |261| 
    2073 000090 831F          SUB.W     #1,r15                ; [] |261| 
    2074 000092 4F81          MOV.W     r15,8(SP)             ; [] |261| 
         000094 0008 
    2075 000096 930E          TST.W     r14                   ; [] |261| 
    2076 000098 23F1          JNE       $C$L52                ; [] |261| 
    2077                                                      ; [] |261| 
    2078            ;* --------------------------------------------------------------------------*
    2079                    .dwpsn  file "../serial.c",line 264,column 1,is_stmt,isa 0
    2080            ;* --------------------------------------------------------------------------*
    2081 00009a       $C$L53:    
    2082 00009a 00A1          ADDA      #14,SP                ; [] 
         00009c 000E 
    2083                    .dwcfi  cfa_offset, 4
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   45

    2084            $C$DW$147       .dwtag  DW_TAG_TI_branch
    2085                    .dwattr $C$DW$147, DW_AT_low_pc(0x00)
    2086                    .dwattr $C$DW$147, DW_AT_TI_return
    2087 00009e 0110          RETA      ; [] 
    2088                    ; [] 
    2089                    .dwattr $C$DW$138, DW_AT_TI_end_file("../serial.c")
    2090                    .dwattr $C$DW$138, DW_AT_TI_end_line(0x108)
    2091                    .dwattr $C$DW$138, DW_AT_TI_end_column(0x01)
    2092                    .dwendentry
    2093                    .dwendtag $C$DW$138
    2094            
    2095            ;*****************************************************************************
    2096            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2097            ;*****************************************************************************
    2098                    .global putch
    2099                    .global __mspabi_divu
    2100                    .global __mspabi_remu
    2101            
    2102            ;******************************************************************************
    2103            ;* BUILD ATTRIBUTES                                                           *
    2104            ;******************************************************************************
    2105                    .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
    2106                    .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0000000000000000000000000
    2107                    .battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(1)
    2108                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2109                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2110                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2111            
    2112            ;******************************************************************************
    2113            ;* TYPE INFORMATION                                                           *
    2114            ;******************************************************************************
    2115            
    2116            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2117                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    2118            $C$DW$148       .dwtag  DW_TAG_member
    2119                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    2120                    .dwattr $C$DW$148, DW_AT_name("base_ptr")
    2121                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("base_ptr")
    2122                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2124                    .dwattr $C$DW$148, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2125                    .dwattr $C$DW$148, DW_AT_decl_line(0x15)
    2126                    .dwattr $C$DW$148, DW_AT_decl_column(0x14)
    2127            $C$DW$149       .dwtag  DW_TAG_member
    2128                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
    2129                    .dwattr $C$DW$149, DW_AT_name("start_ptr")
    2130                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("start_ptr")
    2131                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2132                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2133                    .dwattr $C$DW$149, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2134                    .dwattr $C$DW$149, DW_AT_decl_line(0x16)
    2135                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2136            $C$DW$150       .dwtag  DW_TAG_member
    2137                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
    2138                    .dwattr $C$DW$150, DW_AT_name("max_len")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   46

    2139                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("max_len")
    2140                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2141                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2142                    .dwattr $C$DW$150, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2143                    .dwattr $C$DW$150, DW_AT_decl_line(0x17)
    2144                    .dwattr $C$DW$150, DW_AT_decl_column(0x18)
    2145            $C$DW$151       .dwtag  DW_TAG_member
    2146                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$11)
    2147                    .dwattr $C$DW$151, DW_AT_name("len")
    2148                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("len")
    2149                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2150                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2151                    .dwattr $C$DW$151, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2152                    .dwattr $C$DW$151, DW_AT_decl_line(0x18)
    2153                    .dwattr $C$DW$151, DW_AT_decl_column(0x12)
    2154                    .dwendtag $C$DW$T$24
    2155            
    2156                    .dwattr $C$DW$T$24, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2157                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x14)
    2158                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2159            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("ui8_array")
    2160                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$24)
    2161                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2162                    .dwattr $C$DW$T$30, DW_AT_decl_file("/work/c1202-firmware/msp430-OTP/serial.h")
    2163                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x19)
    2164                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2165            $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2166                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2167                    .dwattr $C$DW$T$31, DW_AT_address_class(0x14)
    2168            
    2169            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2170                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    2171            $C$DW$152       .dwtag  DW_TAG_member
    2172                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$10)
    2173                    .dwattr $C$DW$152, DW_AT_name("fd")
    2174                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("fd")
    2175                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2177                    .dwattr $C$DW$152, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2178                    .dwattr $C$DW$152, DW_AT_decl_line(0x49)
    2179                    .dwattr $C$DW$152, DW_AT_decl_column(0x0b)
    2180            $C$DW$153       .dwtag  DW_TAG_member
    2181                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$25)
    2182                    .dwattr $C$DW$153, DW_AT_name("buf")
    2183                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("buf")
    2184                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2185                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2186                    .dwattr $C$DW$153, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2187                    .dwattr $C$DW$153, DW_AT_decl_line(0x4a)
    2188                    .dwattr $C$DW$153, DW_AT_decl_column(0x16)
    2189            $C$DW$154       .dwtag  DW_TAG_member
    2190                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$25)
    2191                    .dwattr $C$DW$154, DW_AT_name("pos")
    2192                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("pos")
    2193                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   47

    2194                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2195                    .dwattr $C$DW$154, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2196                    .dwattr $C$DW$154, DW_AT_decl_line(0x4b)
    2197                    .dwattr $C$DW$154, DW_AT_decl_column(0x16)
    2198            $C$DW$155       .dwtag  DW_TAG_member
    2199                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$25)
    2200                    .dwattr $C$DW$155, DW_AT_name("bufend")
    2201                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("bufend")
    2202                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2203                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2204                    .dwattr $C$DW$155, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2205                    .dwattr $C$DW$155, DW_AT_decl_line(0x4c)
    2206                    .dwattr $C$DW$155, DW_AT_decl_column(0x16)
    2207            $C$DW$156       .dwtag  DW_TAG_member
    2208                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$25)
    2209                    .dwattr $C$DW$156, DW_AT_name("buff_stop")
    2210                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("buff_stop")
    2211                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2212                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2213                    .dwattr $C$DW$156, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2214                    .dwattr $C$DW$156, DW_AT_decl_line(0x4d)
    2215                    .dwattr $C$DW$156, DW_AT_decl_column(0x16)
    2216            $C$DW$157       .dwtag  DW_TAG_member
    2217                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$11)
    2218                    .dwattr $C$DW$157, DW_AT_name("flags")
    2219                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("flags")
    2220                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2221                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2222                    .dwattr $C$DW$157, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2223                    .dwattr $C$DW$157, DW_AT_decl_line(0x4e)
    2224                    .dwattr $C$DW$157, DW_AT_decl_column(0x16)
    2225                    .dwendtag $C$DW$T$26
    2226            
    2227                    .dwattr $C$DW$T$26, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2228                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x48)
    2229                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    2230            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2231                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$26)
    2232                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2233                    .dwattr $C$DW$T$32, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2234                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x4f)
    2235                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2236            
    2237            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2238                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    2239            $C$DW$158       .dwtag  DW_TAG_member
    2240                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$10)
    2241                    .dwattr $C$DW$158, DW_AT_name("quot")
    2242                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("quot")
    2243                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2245                    .dwattr $C$DW$158, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2246                    .dwattr $C$DW$158, DW_AT_decl_line(0x46)
    2247                    .dwattr $C$DW$158, DW_AT_decl_column(0x16)
    2248            $C$DW$159       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   48

    2249                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$10)
    2250                    .dwattr $C$DW$159, DW_AT_name("rem")
    2251                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("rem")
    2252                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2253                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2254                    .dwattr $C$DW$159, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2255                    .dwattr $C$DW$159, DW_AT_decl_line(0x46)
    2256                    .dwattr $C$DW$159, DW_AT_decl_column(0x1c)
    2257                    .dwendtag $C$DW$T$27
    2258            
    2259                    .dwattr $C$DW$T$27, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2260                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x46)
    2261                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2262            $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2263                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$27)
    2264                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2265                    .dwattr $C$DW$T$33, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2266                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x46)
    2267                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x23)
    2268            
    2269            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2270                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    2271            $C$DW$160       .dwtag  DW_TAG_member
    2272                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$12)
    2273                    .dwattr $C$DW$160, DW_AT_name("quot")
    2274                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("quot")
    2275                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2277                    .dwattr $C$DW$160, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2278                    .dwattr $C$DW$160, DW_AT_decl_line(0x48)
    2279                    .dwattr $C$DW$160, DW_AT_decl_column(0x17)
    2280            $C$DW$161       .dwtag  DW_TAG_member
    2281                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$12)
    2282                    .dwattr $C$DW$161, DW_AT_name("rem")
    2283                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("rem")
    2284                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2285                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2286                    .dwattr $C$DW$161, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2287                    .dwattr $C$DW$161, DW_AT_decl_line(0x48)
    2288                    .dwattr $C$DW$161, DW_AT_decl_column(0x1d)
    2289                    .dwendtag $C$DW$T$28
    2290            
    2291                    .dwattr $C$DW$T$28, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2292                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    2293                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2294            $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2295                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$28)
    2296                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2297                    .dwattr $C$DW$T$34, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2298                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x48)
    2299                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x24)
    2300            
    2301            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2302                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2303            $C$DW$162       .dwtag  DW_TAG_member
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   49

    2304                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$14)
    2305                    .dwattr $C$DW$162, DW_AT_name("quot")
    2306                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("quot")
    2307                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2309                    .dwattr $C$DW$162, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2310                    .dwattr $C$DW$162, DW_AT_decl_line(0x4b)
    2311                    .dwattr $C$DW$162, DW_AT_decl_column(0x1c)
    2312            $C$DW$163       .dwtag  DW_TAG_member
    2313                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$14)
    2314                    .dwattr $C$DW$163, DW_AT_name("rem")
    2315                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("rem")
    2316                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2317                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2318                    .dwattr $C$DW$163, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/i
    2319                    .dwattr $C$DW$163, DW_AT_decl_line(0x4b)
    2320                    .dwattr $C$DW$163, DW_AT_decl_column(0x22)
    2321                    .dwendtag $C$DW$T$29
    2322            
    2323                    .dwattr $C$DW$T$29, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2324                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x4b)
    2325                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2326            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2327                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$29)
    2328                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2329                    .dwattr $C$DW$T$35, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2330                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x4b)
    2331                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x29)
    2332            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2333                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2334            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2335                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2336                    .dwattr $C$DW$T$3, DW_AT_address_class(0x14)
    2337            
    2338            $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
    2339                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2340            $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2341                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2342                    .dwattr $C$DW$T$42, DW_AT_address_class(0x14)
    2343            $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    2344                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2345                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2346                    .dwattr $C$DW$T$43, DW_AT_decl_file("/home/sporty/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/
    2347                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x9a)
    2348                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x14)
    2349            $C$DW$164       .dwtag  DW_TAG_TI_far_type
    2350                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$2)
    2351            $C$DW$T$44      .dwtag  DW_TAG_const_type
    2352                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$164)
    2353            $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2354                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2355                    .dwattr $C$DW$T$45, DW_AT_address_class(0x14)
    2356            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2357                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2358                    .dwattr $C$DW$T$4, DW_AT_name("bool")
MSP430 Assembler Unix v4.4.3 Wed Mar 11 17:15:22 2015

Tools Copyright (c) 2003-2015 Texas Instruments Incorporated
serial.asm                                                           PAGE   50

    2359                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2360            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2361                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2362                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2363                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2364            $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2365                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$5)
    2366                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
